read_verilog -sv /home/kelvin/FABulous_fork/myProject/PnR/mac-pipelined/mac-pipelined.sv
read_verilog -sv -lib /home/kelvin/FABulous_fork/myProject/Tile/E_Mem_bot/Mem.v
hierarchy -auto-top; flatten; proc; 
opt_mem_priority
opt_mem_feedback
memory_bmux2rom
memory_dff
opt_clean
memory_share
opt_mem_widen
opt_clean
memory_collect
clean -purge

techmap -map /home/kelvin/FABulous_fork/myProject/Tile/E_Mem_bot/metadata/wrap_map_Mem.v
connwrappers -unsigned \$__mem_v2_wrapper RD_DATA WIDTH
connwrappers -unsigned \$__mux_wrapper Y WIDTH 
show
design -push

read_json /home/kelvin/FABulous_fork/myProject/Tile/E_Mem_bot/metadata/cell_Mem.json
proc; clean -purge;
opt_mem_priority
opt_mem_feedback
memory_bmux2rom
memory_dff
opt_clean
memory_share
opt_mem_widen
opt_clean
memory_collect
clean -purge
techmap -map /home/kelvin/FABulous_fork/myProject/Tile/E_Mem_bot/metadata/wrap_map_Mem.v
design -save xmap
design -pop

extract -constports -ignore_parameters -map %xmap
stat