read_verilog /home/kelvin/FABulous_fork/test.v
hierarchy -auto-top; proc; opt -full;;;
techmap -map /home/kelvin/FABulous_fork/myProject/.FABulous/ne_to_xor.v -autoproc
show