; ModuleID = 'bfs/queue/bfs_opt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "riscv64-unknown-linux-gnu"

%struct.node_t_struct = type { i64, i64 }
%struct.edge_t_struct = type { i64 }
%struct.bench_args_t = type { [256 x %struct.node_t_struct], [4096 x %struct.edge_t_struct], i64, [256 x i8], [10 x i64] }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.node_t_struct, %struct.node_t_struct, %struct.node_t_struct, [2 x i32] }

@.str.1 = private unnamed_addr constant [34 x i8] c"fd>1 && \22Invalid file descriptor\22\00", align 1, !dbg !0
@.str.2 = private unnamed_addr constant [23 x i8] c"../../common/support.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.readfile = private unnamed_addr constant [20 x i8] c"char *readfile(int)\00", align 1, !dbg !12
@.str.4 = private unnamed_addr constant [51 x i8] c"0==fstat(fd, &s) && \22Couldn't determine file size\22\00", align 1, !dbg !18
@.str.6 = private unnamed_addr constant [25 x i8] c"len>0 && \22File is empty\22\00", align 1, !dbg !23
@.str.8 = private unnamed_addr constant [29 x i8] c"status>=0 && \22read() failed\22\00", align 1, !dbg !28
@.str.10 = private unnamed_addr constant [33 x i8] c"n>=0 && \22Invalid section number\22\00", align 1, !dbg !33
@__PRETTY_FUNCTION__.find_section_start = private unnamed_addr constant [38 x i8] c"char *find_section_start(char *, int)\00", align 1, !dbg !38

!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !99, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !118, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 328, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 41)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 7)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !123, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 240, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 30)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 6)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 90)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !40, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !65)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !171, isLocal: true, isDefinition: true)
!170 = !DIFile(filename: "../../common/harness.c", directory: "/home/kelvin/MachSuite/bfs/queue")
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 57)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !9, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 184, elements: !10)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !170, line: 22, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 11)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !170, line: 24, type: !181, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "INPUT_SIZE", scope: !188, file: !189, line: 5, type: !233, isLocal: false, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C11, file: !189, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !190, globals: !232, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "local_support.c", directory: "/home/kelvin/MachSuite/bfs/queue")
!190 = !{!191, !231}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bench_args_t", file: !193, line: 45, size: 297664, elements: !194)
!193 = !DIFile(filename: "./bfs.h", directory: "/home/kelvin/MachSuite/bfs/queue")
!194 = !{!195, !210, !219, !220, !227}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !192, file: !193, line: 46, baseType: !196, size: 32768)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 32768, elements: !208)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !193, line: 37, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node_t_struct", file: !193, line: 34, size: 128, elements: !199)
!199 = !{!200, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "edge_begin", scope: !198, file: !193, line: 35, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge_index_t", file: !193, line: 24, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !203, line: 27, baseType: !204)
!203 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-uintn.h", directory: "")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !205, line: 45, baseType: !206)
!205 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types.h", directory: "")
!206 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "edge_end", scope: !198, file: !193, line: 36, baseType: !201, size: 64, offset: 64)
!208 = !{!209}
!209 = !DISubrange(count: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !192, file: !193, line: 47, baseType: !211, size: 262144, offset: 32768)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 262144, elements: !217)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge_t", file: !193, line: 32, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_t_struct", file: !193, line: 27, size: 64, elements: !214)
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !213, file: !193, line: 31, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_index_t", file: !193, line: 25, baseType: !202)
!217 = !{!218}
!218 = !DISubrange(count: 4096)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "starting_node", scope: !192, file: !193, line: 48, baseType: !216, size: 64, offset: 294912)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !192, file: !193, line: 49, baseType: !221, size: 2048, offset: 294976)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 2048, elements: !208)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "level_t", file: !193, line: 39, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !224, line: 24, baseType: !225)
!224 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-intn.h", directory: "")
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !205, line: 37, baseType: !226)
!226 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "level_counts", scope: !192, file: !193, line: 50, baseType: !228, size: 640, offset: 297024)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 640, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 10)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!232 = !{!186}
!233 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !151)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !124)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !170, line: 47, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 12)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !247, isLocal: true, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !100)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !170, line: 58, type: !30, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !74)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !170, line: 67, type: !35, isLocal: true, isDefinition: true)
!255 = distinct !DICompileUnit(language: DW_LANG_C11, file: !256, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!256 = !DIFile(filename: "bfs.c", directory: "/home/kelvin/MachSuite/bfs/queue")
!257 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !258, globals: !280, splitDebugInlining: false, nameTableKind: None)
!258 = !{!259, !4, !260, !261, !264, !267, !202, !223, !270, !273, !275, !278, !279}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !203, line: 24, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !205, line: 38, baseType: !263)
!263 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !203, line: 25, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !205, line: 40, baseType: !266)
!266 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !203, line: 26, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !205, line: 42, baseType: !269)
!269 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !224, line: 25, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !205, line: 39, baseType: !272)
!272 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !224, line: 26, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !205, line: 41, baseType: !233)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !224, line: 27, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !205, line: 44, baseType: !277)
!277 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!278 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!279 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!280 = !{!281, !0, !7, !12, !286, !18, !288, !23, !293, !28, !295, !33, !38, !297, !43, !45, !47, !52, !57, !62, !67, !69, !71, !76, !78, !80, !82, !87, !89, !302, !92, !97, !102, !107, !112, !114, !116, !121, !126, !128, !130, !132, !134, !136, !141, !146, !148, !153, !307, !158, !163, !309, !165}
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 24)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !30, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !290, isLocal: true, isDefinition: true)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 14)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !290, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !9, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 21)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !2, line: 154, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 13)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !20, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !311, isLocal: true, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 27)
!314 = distinct !DICompileUnit(language: DW_LANG_C11, file: !170, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !315, globals: !316, splitDebugInlining: false, nameTableKind: None)
!315 = !{!260}
!316 = !{!317, !168, !174, !176, !179, !184, !319, !234, !321, !237, !240, !323, !245, !248, !328, !250, !253, !330}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !247, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !290, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !236, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 31)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !236, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !170, line: 74, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !229)
!333 = !{!"clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)"}
!334 = !{i32 7, !"Dwarf Version", i32 4}
!335 = !{i32 2, !"Debug Info Version", i32 3}
!336 = !{i32 1, !"wchar_size", i32 4}
!337 = !{i32 1, !"target-abi", !"lp64d"}
!338 = distinct !{i32 6, !"riscv-isa", !339}
!339 = distinct !{!"rv64i2p1_m2p0_a2p1_f2p2_d2p2_zicsr2p0_zifencei2p0"}
!340 = !{i32 8, !"PIC Level", i32 2}
!341 = !{i32 7, !"PIE Level", i32 2}
!342 = !{i32 7, !"uwtable", i32 2}
!343 = !{i32 8, !"SmallDataLimit", i32 8}
!344 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!345 = distinct !DISubprogram(name: "bfs", scope: !256, file: !256, line: 13, type: !346, scopeLine: 16, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !255, retainedNodes: !361)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !348, !354, !216, !359, !360}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !193, line: 37, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node_t_struct", file: !193, line: 34, size: 128, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "edge_begin", scope: !350, file: !193, line: 35, baseType: !201, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "edge_end", scope: !350, file: !193, line: 36, baseType: !201, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge_t", file: !193, line: 32, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_t_struct", file: !193, line: 27, size: 64, elements: !357)
!357 = !{!358}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !356, file: !193, line: 31, baseType: !216, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!361 = !{!362, !363, !364, !365, !366, !367, !369, !370, !371, !372, !373, !374, !375, !379, !380, !381, !385, !386}
!362 = !DILocalVariable(name: "nodes", arg: 1, scope: !345, file: !256, line: 13, type: !348)
!363 = !DILocalVariable(name: "edges", arg: 2, scope: !345, file: !256, line: 13, type: !354)
!364 = !DILocalVariable(name: "starting_node", arg: 3, scope: !345, file: !256, line: 14, type: !216)
!365 = !DILocalVariable(name: "level", arg: 4, scope: !345, file: !256, line: 14, type: !359)
!366 = !DILocalVariable(name: "level_counts", arg: 5, scope: !345, file: !256, line: 15, type: !360)
!367 = !DILocalVariable(name: "queue", scope: !345, file: !256, line: 17, type: !368)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 16384, elements: !208)
!369 = !DILocalVariable(name: "q_in", scope: !345, file: !256, line: 18, type: !216)
!370 = !DILocalVariable(name: "q_out", scope: !345, file: !256, line: 18, type: !216)
!371 = !DILocalVariable(name: "dummy", scope: !345, file: !256, line: 19, type: !216)
!372 = !DILocalVariable(name: "n", scope: !345, file: !256, line: 20, type: !216)
!373 = !DILocalVariable(name: "e", scope: !345, file: !256, line: 21, type: !201)
!374 = !DILabel(scope: !345, name: "loop_queue", file: !256, line: 34)
!375 = !DILocalVariable(name: "tmp_begin", scope: !376, file: !256, line: 39, type: !201)
!376 = distinct !DILexicalBlock(scope: !377, file: !256, line: 34, column: 54)
!377 = distinct !DILexicalBlock(scope: !378, file: !256, line: 34, column: 15)
!378 = distinct !DILexicalBlock(scope: !345, file: !256, line: 34, column: 15)
!379 = !DILocalVariable(name: "tmp_end", scope: !376, file: !256, line: 40, type: !201)
!380 = !DILabel(scope: !376, name: "loop_neighbors", file: !256, line: 41)
!381 = !DILocalVariable(name: "tmp_dst", scope: !382, file: !256, line: 42, type: !216)
!382 = distinct !DILexicalBlock(scope: !383, file: !256, line: 41, column: 56)
!383 = distinct !DILexicalBlock(scope: !384, file: !256, line: 41, column: 21)
!384 = distinct !DILexicalBlock(scope: !376, file: !256, line: 41, column: 21)
!385 = !DILocalVariable(name: "tmp_level", scope: !382, file: !256, line: 43, type: !222)
!386 = !DILocalVariable(name: "tmp_level", scope: !387, file: !256, line: 46, type: !222)
!387 = distinct !DILexicalBlock(scope: !388, file: !256, line: 45, column: 35)
!388 = distinct !DILexicalBlock(scope: !382, file: !256, line: 45, column: 11)
!389 = distinct !DIAssignID()
!390 = !DILocation(line: 0, scope: !345)
!391 = !DILocation(line: 17, column: 3, scope: !345)
!392 = !DILocation(line: 30, column: 3, scope: !345)
!393 = !DILocation(line: 30, column: 24, scope: !345)
!394 = !{!395, !395, i64 0}
!395 = !{!"omnipotent char", !396, i64 0}
!396 = !{!"Simple C/C++ TBAA"}
!397 = !DILocation(line: 31, column: 19, scope: !345)
!398 = !{!399, !399, i64 0}
!399 = !{!"long", !395, i64 0}
!400 = !DILocation(line: 32, column: 3, scope: !401)
!401 = distinct !DILexicalBlock(scope: !345, file: !256, line: 32, column: 3)
!402 = !DILocation(line: 34, column: 3, scope: !345)
!403 = !DILocation(line: 34, column: 15, scope: !378)
!404 = !DILocation(line: 35, column: 9, scope: !405)
!405 = distinct !DILexicalBlock(scope: !376, file: !256, line: 35, column: 9)
!406 = !DILocation(line: 35, column: 9, scope: !376)
!407 = !DILocation(line: 38, column: 5, scope: !408)
!408 = distinct !DILexicalBlock(scope: !376, file: !256, line: 38, column: 5)
!409 = !DILocation(line: 37, column: 9, scope: !376)
!410 = !DILocation(line: 39, column: 30, scope: !376)
!411 = !DILocation(line: 39, column: 39, scope: !376)
!412 = !DILocation(line: 0, scope: !376)
!413 = !DILocation(line: 40, column: 37, scope: !376)
!414 = !DILocation(line: 41, column: 5, scope: !376)
!415 = !DILocation(line: 41, column: 40, scope: !383)
!416 = !DILocation(line: 41, column: 21, scope: !384)
!417 = !DILocation(line: 42, column: 30, scope: !382)
!418 = !DILocation(line: 42, column: 39, scope: !382)
!419 = !DILocation(line: 0, scope: !382)
!420 = !DILocation(line: 43, column: 27, scope: !382)
!421 = !DILocation(line: 45, column: 21, scope: !388)
!422 = !DILocation(line: 45, column: 11, scope: !382)
!423 = !DILocation(line: 46, column: 29, scope: !387)
!424 = !DILocation(line: 46, column: 37, scope: !387)
!425 = !DILocation(line: 0, scope: !387)
!426 = !DILocation(line: 47, column: 24, scope: !387)
!427 = !DILocation(line: 48, column: 11, scope: !387)
!428 = !DILocation(line: 48, column: 9, scope: !387)
!429 = !DILocation(line: 49, column: 9, scope: !430)
!430 = distinct !DILexicalBlock(scope: !387, file: !256, line: 49, column: 9)
!431 = !DILocation(line: 50, column: 7, scope: !387)
!432 = !DILocation(line: 41, column: 51, scope: !383)
!433 = distinct !{!433, !416, !434, !435, !436}
!434 = !DILocation(line: 51, column: 5, scope: !384)
!435 = !{!"llvm.loop.mustprogress"}
!436 = !{!"llvm.loop.unroll.disable"}
!437 = !DILocation(line: 34, column: 49, scope: !377)
!438 = !DILocation(line: 34, column: 34, scope: !377)
!439 = distinct !{!439, !403, !440, !435, !436}
!440 = !DILocation(line: 52, column: 3, scope: !378)
!441 = !DILocation(line: 60, column: 1, scope: !345)
!442 = distinct !DISubprogram(name: "run_benchmark", scope: !189, file: !189, line: 7, type: !443, scopeLine: 7, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !445)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !260}
!445 = !{!446, !447}
!446 = !DILocalVariable(name: "vargs", arg: 1, scope: !442, file: !189, line: 7, type: !260)
!447 = !DILocalVariable(name: "args", scope: !442, file: !189, line: 8, type: !191)
!448 = distinct !DIAssignID()
!449 = !DILocation(line: 0, scope: !442)
!450 = !DILocation(line: 9, column: 26, scope: !442)
!451 = !DILocation(line: 9, column: 39, scope: !442)
!452 = !{!453, !399, i64 36864}
!453 = !{!"bench_args_t", !395, i64 0, !395, i64 4096, !399, i64 36864, !395, i64 36872, !395, i64 37128}
!454 = !DILocation(line: 9, column: 60, scope: !442)
!455 = !DILocation(line: 9, column: 73, scope: !442)
!456 = !DILocation(line: 0, scope: !345, inlinedAt: !457)
!457 = distinct !DILocation(line: 9, column: 3, scope: !442)
!458 = !DILocation(line: 17, column: 3, scope: !345, inlinedAt: !457)
!459 = !DILocation(line: 30, column: 3, scope: !345, inlinedAt: !457)
!460 = !DILocation(line: 30, column: 24, scope: !345, inlinedAt: !457)
!461 = !DILocation(line: 31, column: 19, scope: !345, inlinedAt: !457)
!462 = !DILocation(line: 32, column: 3, scope: !401, inlinedAt: !457)
!463 = !DILocation(line: 34, column: 3, scope: !345, inlinedAt: !457)
!464 = !DILocation(line: 34, column: 15, scope: !378, inlinedAt: !457)
!465 = !DILocation(line: 35, column: 9, scope: !405, inlinedAt: !457)
!466 = !DILocation(line: 35, column: 9, scope: !376, inlinedAt: !457)
!467 = !DILocation(line: 38, column: 5, scope: !408, inlinedAt: !457)
!468 = !DILocation(line: 37, column: 9, scope: !376, inlinedAt: !457)
!469 = !DILocation(line: 39, column: 30, scope: !376, inlinedAt: !457)
!470 = !DILocation(line: 39, column: 39, scope: !376, inlinedAt: !457)
!471 = !DILocation(line: 0, scope: !376, inlinedAt: !457)
!472 = !DILocation(line: 40, column: 37, scope: !376, inlinedAt: !457)
!473 = !DILocation(line: 41, column: 5, scope: !376, inlinedAt: !457)
!474 = !DILocation(line: 41, column: 40, scope: !383, inlinedAt: !457)
!475 = !DILocation(line: 41, column: 21, scope: !384, inlinedAt: !457)
!476 = !DILocation(line: 42, column: 30, scope: !382, inlinedAt: !457)
!477 = !DILocation(line: 42, column: 39, scope: !382, inlinedAt: !457)
!478 = !DILocation(line: 0, scope: !382, inlinedAt: !457)
!479 = !DILocation(line: 43, column: 27, scope: !382, inlinedAt: !457)
!480 = !DILocation(line: 45, column: 21, scope: !388, inlinedAt: !457)
!481 = !DILocation(line: 45, column: 11, scope: !382, inlinedAt: !457)
!482 = !DILocation(line: 46, column: 29, scope: !387, inlinedAt: !457)
!483 = !DILocation(line: 46, column: 37, scope: !387, inlinedAt: !457)
!484 = !DILocation(line: 0, scope: !387, inlinedAt: !457)
!485 = !DILocation(line: 47, column: 24, scope: !387, inlinedAt: !457)
!486 = !DILocation(line: 48, column: 11, scope: !387, inlinedAt: !457)
!487 = !DILocation(line: 48, column: 9, scope: !387, inlinedAt: !457)
!488 = !DILocation(line: 49, column: 9, scope: !430, inlinedAt: !457)
!489 = !DILocation(line: 50, column: 7, scope: !387, inlinedAt: !457)
!490 = !DILocation(line: 41, column: 51, scope: !383, inlinedAt: !457)
!491 = distinct !{!491, !475, !492, !435, !436}
!492 = !DILocation(line: 51, column: 5, scope: !384, inlinedAt: !457)
!493 = !DILocation(line: 34, column: 49, scope: !377, inlinedAt: !457)
!494 = !DILocation(line: 34, column: 34, scope: !377, inlinedAt: !457)
!495 = distinct !{!495, !464, !496, !435, !436}
!496 = !DILocation(line: 52, column: 3, scope: !378, inlinedAt: !457)
!497 = !DILocation(line: 60, column: 1, scope: !345, inlinedAt: !457)
!498 = !DILocation(line: 10, column: 1, scope: !442)
!499 = distinct !DISubprogram(name: "input_to_data", scope: !189, file: !189, line: 21, type: !500, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !502)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !233, !260}
!502 = !{!503, !504, !505, !506, !507, !508, !509}
!503 = !DILocalVariable(name: "fd", arg: 1, scope: !499, file: !189, line: 21, type: !233)
!504 = !DILocalVariable(name: "vdata", arg: 2, scope: !499, file: !189, line: 21, type: !260)
!505 = !DILocalVariable(name: "data", scope: !499, file: !189, line: 22, type: !191)
!506 = !DILocalVariable(name: "p", scope: !499, file: !189, line: 23, type: !259)
!507 = !DILocalVariable(name: "s", scope: !499, file: !189, line: 23, type: !259)
!508 = !DILocalVariable(name: "nodes", scope: !499, file: !189, line: 24, type: !231)
!509 = !DILocalVariable(name: "i", scope: !499, file: !189, line: 25, type: !275)
!510 = !DILocation(line: 0, scope: !499)
!511 = !DILocation(line: 28, column: 3, scope: !499)
!512 = !DILocation(line: 30, column: 3, scope: !513)
!513 = distinct !DILexicalBlock(scope: !499, file: !189, line: 30, column: 3)
!514 = !DILocation(line: 31, column: 19, scope: !515)
!515 = distinct !DILexicalBlock(scope: !516, file: !189, line: 30, column: 28)
!516 = distinct !DILexicalBlock(scope: !513, file: !189, line: 30, column: 3)
!517 = !DILocation(line: 34, column: 7, scope: !499)
!518 = !DILocalVariable(name: "s", arg: 1, scope: !519, file: !2, line: 56, type: !259)
!519 = distinct !DISubprogram(name: "find_section_start", scope: !2, file: !2, line: 56, type: !520, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !257, retainedNodes: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{!259, !259, !233}
!522 = !{!518, !523, !524}
!523 = !DILocalVariable(name: "n", arg: 2, scope: !519, file: !2, line: 56, type: !233)
!524 = !DILocalVariable(name: "i", scope: !519, file: !2, line: 57, type: !233)
!525 = !DILocation(line: 0, scope: !519, inlinedAt: !526)
!526 = distinct !DILocation(line: 36, column: 7, scope: !499)
!527 = !DILocation(line: 64, column: 17, scope: !519, inlinedAt: !526)
!528 = !DILocation(line: 64, column: 3, scope: !519, inlinedAt: !526)
!529 = !DILocation(line: 66, column: 22, scope: !530, inlinedAt: !526)
!530 = distinct !DILexicalBlock(scope: !531, file: !2, line: 66, column: 9)
!531 = distinct !DILexicalBlock(scope: !519, file: !2, line: 64, column: 31)
!532 = !DILocation(line: 66, column: 26, scope: !530, inlinedAt: !526)
!533 = !DILocation(line: 66, column: 32, scope: !530, inlinedAt: !526)
!534 = !DILocation(line: 66, column: 35, scope: !530, inlinedAt: !526)
!535 = !DILocation(line: 66, column: 39, scope: !530, inlinedAt: !526)
!536 = !DILocation(line: 66, column: 9, scope: !531, inlinedAt: !526)
!537 = !DILocation(line: 69, column: 6, scope: !531, inlinedAt: !526)
!538 = !DILocation(line: 64, column: 10, scope: !519, inlinedAt: !526)
!539 = !DILocation(line: 64, column: 13, scope: !519, inlinedAt: !526)
!540 = distinct !{!540, !528, !541, !435, !436}
!541 = !DILocation(line: 70, column: 3, scope: !519, inlinedAt: !526)
!542 = !DILocation(line: 71, column: 6, scope: !543, inlinedAt: !526)
!543 = distinct !DILexicalBlock(scope: !519, file: !2, line: 71, column: 6)
!544 = !DILocation(line: 71, column: 8, scope: !543, inlinedAt: !526)
!545 = !DILocation(line: 71, column: 6, scope: !519, inlinedAt: !526)
!546 = !DILocation(line: 37, column: 34, scope: !499)
!547 = !DILocation(line: 37, column: 3, scope: !499)
!548 = !DILocation(line: 0, scope: !519, inlinedAt: !549)
!549 = distinct !DILocation(line: 40, column: 7, scope: !499)
!550 = !DILocation(line: 64, column: 17, scope: !519, inlinedAt: !549)
!551 = !DILocation(line: 64, column: 3, scope: !519, inlinedAt: !549)
!552 = !DILocation(line: 66, column: 22, scope: !530, inlinedAt: !549)
!553 = !DILocation(line: 66, column: 26, scope: !530, inlinedAt: !549)
!554 = !DILocation(line: 66, column: 32, scope: !530, inlinedAt: !549)
!555 = !DILocation(line: 66, column: 35, scope: !530, inlinedAt: !549)
!556 = !DILocation(line: 66, column: 39, scope: !530, inlinedAt: !549)
!557 = !DILocation(line: 66, column: 9, scope: !531, inlinedAt: !549)
!558 = !DILocation(line: 69, column: 6, scope: !531, inlinedAt: !549)
!559 = !DILocation(line: 64, column: 10, scope: !519, inlinedAt: !549)
!560 = !DILocation(line: 64, column: 13, scope: !519, inlinedAt: !549)
!561 = distinct !{!561, !551, !562, !435, !436}
!562 = !DILocation(line: 70, column: 3, scope: !519, inlinedAt: !549)
!563 = !DILocation(line: 71, column: 6, scope: !543, inlinedAt: !549)
!564 = !DILocation(line: 71, column: 8, scope: !543, inlinedAt: !549)
!565 = !DILocation(line: 71, column: 6, scope: !519, inlinedAt: !549)
!566 = !DILocation(line: 41, column: 23, scope: !499)
!567 = !DILocation(line: 42, column: 3, scope: !499)
!568 = !DILocation(line: 43, column: 3, scope: !569)
!569 = distinct !DILexicalBlock(scope: !499, file: !189, line: 43, column: 3)
!570 = !DILocation(line: 44, column: 40, scope: !571)
!571 = distinct !DILexicalBlock(scope: !572, file: !189, line: 43, column: 28)
!572 = distinct !DILexicalBlock(scope: !569, file: !189, line: 43, column: 3)
!573 = !DILocation(line: 44, column: 33, scope: !571)
!574 = !DILocation(line: 44, column: 5, scope: !571)
!575 = !DILocation(line: 44, column: 31, scope: !571)
!576 = !{!577, !399, i64 0}
!577 = !{!"node_t_struct", !399, i64 0, !399, i64 8}
!578 = !DILocation(line: 45, column: 40, scope: !571)
!579 = !DILocation(line: 45, column: 31, scope: !571)
!580 = !DILocation(line: 45, column: 20, scope: !571)
!581 = !DILocation(line: 45, column: 29, scope: !571)
!582 = !{!577, !399, i64 8}
!583 = !DILocation(line: 43, column: 24, scope: !572)
!584 = !DILocation(line: 43, column: 13, scope: !572)
!585 = distinct !{!585, !568, !586, !435, !436}
!586 = !DILocation(line: 46, column: 3, scope: !569)
!587 = !DILocation(line: 47, column: 3, scope: !499)
!588 = !DILocation(line: 0, scope: !519, inlinedAt: !589)
!589 = distinct !DILocation(line: 49, column: 7, scope: !499)
!590 = !DILocation(line: 64, column: 17, scope: !519, inlinedAt: !589)
!591 = !DILocation(line: 64, column: 3, scope: !519, inlinedAt: !589)
!592 = !DILocation(line: 66, column: 22, scope: !530, inlinedAt: !589)
!593 = !DILocation(line: 66, column: 26, scope: !530, inlinedAt: !589)
!594 = !DILocation(line: 66, column: 32, scope: !530, inlinedAt: !589)
!595 = !DILocation(line: 66, column: 35, scope: !530, inlinedAt: !589)
!596 = !DILocation(line: 66, column: 39, scope: !530, inlinedAt: !589)
!597 = !DILocation(line: 66, column: 9, scope: !531, inlinedAt: !589)
!598 = !DILocation(line: 69, column: 6, scope: !531, inlinedAt: !589)
!599 = !DILocation(line: 64, column: 10, scope: !519, inlinedAt: !589)
!600 = !DILocation(line: 64, column: 13, scope: !519, inlinedAt: !589)
!601 = distinct !{!601, !591, !602, !435, !436}
!602 = !DILocation(line: 70, column: 3, scope: !519, inlinedAt: !589)
!603 = !DILocation(line: 71, column: 6, scope: !543, inlinedAt: !589)
!604 = !DILocation(line: 71, column: 8, scope: !543, inlinedAt: !589)
!605 = !DILocation(line: 71, column: 6, scope: !519, inlinedAt: !589)
!606 = !DILocation(line: 50, column: 46, scope: !499)
!607 = !DILocation(line: 50, column: 3, scope: !499)
!608 = !DILocation(line: 51, column: 3, scope: !499)
!609 = !DILocation(line: 52, column: 1, scope: !499)
!610 = !DISubprogram(name: "malloc", scope: !611, file: !611, line: 672, type: !612, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!611 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdlib.h", directory: "")
!612 = !DISubroutineType(types: !613)
!613 = !{!260, !614}
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !615, line: 18, baseType: !206)
!615 = !DIFile(filename: "/opt/riscv/lib/clang/18/include/__stddef_size_t.h", directory: "")
!616 = !DISubprogram(name: "free", scope: !611, file: !611, line: 687, type: !443, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!617 = distinct !DISubprogram(name: "data_to_input", scope: !189, file: !189, line: 54, type: !500, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !618)
!618 = !{!619, !620, !621, !622, !623}
!619 = !DILocalVariable(name: "fd", arg: 1, scope: !617, file: !189, line: 54, type: !233)
!620 = !DILocalVariable(name: "vdata", arg: 2, scope: !617, file: !189, line: 54, type: !260)
!621 = !DILocalVariable(name: "nodes", scope: !617, file: !189, line: 55, type: !231)
!622 = !DILocalVariable(name: "i", scope: !617, file: !189, line: 56, type: !275)
!623 = !DILocalVariable(name: "data", scope: !617, file: !189, line: 58, type: !191)
!624 = !DILocation(line: 0, scope: !617)
!625 = !DILocalVariable(name: "fd", arg: 1, scope: !626, file: !2, line: 189, type: !233)
!626 = distinct !DISubprogram(name: "write_section_header", scope: !2, file: !2, line: 189, type: !627, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !257, retainedNodes: !629)
!627 = !DISubroutineType(types: !628)
!628 = !{!233, !233}
!629 = !{!625}
!630 = !DILocation(line: 0, scope: !626, inlinedAt: !631)
!631 = distinct !DILocation(line: 60, column: 3, scope: !617)
!632 = !DILocation(line: 190, column: 3, scope: !633, inlinedAt: !631)
!633 = distinct !DILexicalBlock(scope: !634, file: !2, line: 190, column: 3)
!634 = distinct !DILexicalBlock(scope: !626, file: !2, line: 190, column: 3)
!635 = !DILocation(line: 191, column: 3, scope: !626, inlinedAt: !631)
!636 = !DILocation(line: 61, column: 35, scope: !617)
!637 = !DILocalVariable(name: "fd", arg: 1, scope: !638, file: !2, line: 180, type: !233)
!638 = distinct !DISubprogram(name: "write_uint64_t_array", scope: !2, file: !2, line: 180, type: !639, scopeLine: 180, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !257, retainedNodes: !641)
!639 = !DISubroutineType(types: !640)
!640 = !{!233, !233, !231, !233}
!641 = !{!637, !642, !643, !644}
!642 = !DILocalVariable(name: "arr", arg: 2, scope: !638, file: !2, line: 180, type: !231)
!643 = !DILocalVariable(name: "n", arg: 3, scope: !638, file: !2, line: 180, type: !233)
!644 = !DILocalVariable(name: "i", scope: !638, file: !2, line: 180, type: !233)
!645 = !DILocation(line: 0, scope: !638, inlinedAt: !646)
!646 = distinct !DILocation(line: 61, column: 3, scope: !617)
!647 = !DILocation(line: 180, column: 1, scope: !648, inlinedAt: !646)
!648 = distinct !DILexicalBlock(scope: !649, file: !2, line: 180, column: 1)
!649 = distinct !DILexicalBlock(scope: !650, file: !2, line: 180, column: 1)
!650 = distinct !DILexicalBlock(scope: !638, file: !2, line: 180, column: 1)
!651 = !DILocation(line: 0, scope: !626, inlinedAt: !652)
!652 = distinct !DILocation(line: 63, column: 3, scope: !617)
!653 = !DILocation(line: 191, column: 3, scope: !626, inlinedAt: !652)
!654 = !DILocation(line: 64, column: 23, scope: !617)
!655 = !DILocation(line: 65, column: 3, scope: !656)
!656 = distinct !DILexicalBlock(scope: !617, file: !189, line: 65, column: 3)
!657 = !DILocation(line: 66, column: 19, scope: !658)
!658 = distinct !DILexicalBlock(scope: !659, file: !189, line: 65, column: 28)
!659 = distinct !DILexicalBlock(scope: !656, file: !189, line: 65, column: 3)
!660 = !DILocation(line: 66, column: 34, scope: !658)
!661 = !DILocation(line: 66, column: 12, scope: !658)
!662 = !DILocation(line: 66, column: 5, scope: !658)
!663 = !DILocation(line: 66, column: 17, scope: !658)
!664 = !DILocation(line: 67, column: 34, scope: !658)
!665 = !DILocation(line: 67, column: 14, scope: !658)
!666 = !DILocation(line: 67, column: 5, scope: !658)
!667 = !DILocation(line: 67, column: 17, scope: !658)
!668 = !DILocation(line: 65, column: 24, scope: !659)
!669 = !DILocation(line: 65, column: 13, scope: !659)
!670 = distinct !{!670, !655, !671, !435, !436}
!671 = !DILocation(line: 68, column: 3, scope: !656)
!672 = !DILocation(line: 0, scope: !638, inlinedAt: !673)
!673 = distinct !DILocation(line: 69, column: 3, scope: !617)
!674 = !DILocation(line: 180, column: 1, scope: !648, inlinedAt: !673)
!675 = !DILocation(line: 180, column: 1, scope: !649, inlinedAt: !673)
!676 = !DILocation(line: 180, column: 1, scope: !650, inlinedAt: !673)
!677 = distinct !{!677, !676, !676, !435, !436}
!678 = !DILocation(line: 70, column: 3, scope: !617)
!679 = !DILocation(line: 0, scope: !626, inlinedAt: !680)
!680 = distinct !DILocation(line: 72, column: 3, scope: !617)
!681 = !DILocation(line: 191, column: 3, scope: !626, inlinedAt: !680)
!682 = !DILocation(line: 73, column: 48, scope: !617)
!683 = !DILocation(line: 0, scope: !638, inlinedAt: !684)
!684 = distinct !DILocation(line: 73, column: 3, scope: !617)
!685 = !DILocation(line: 180, column: 1, scope: !650, inlinedAt: !684)
!686 = !DILocation(line: 180, column: 1, scope: !648, inlinedAt: !684)
!687 = !DILocation(line: 180, column: 1, scope: !649, inlinedAt: !684)
!688 = distinct !{!688, !685, !685, !435, !436}
!689 = !DILocation(line: 74, column: 1, scope: !617)
!690 = distinct !DISubprogram(name: "output_to_data", scope: !189, file: !189, line: 81, type: !500, scopeLine: 81, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !691)
!691 = !{!692, !693, !694, !695, !696}
!692 = !DILocalVariable(name: "fd", arg: 1, scope: !690, file: !189, line: 81, type: !233)
!693 = !DILocalVariable(name: "vdata", arg: 2, scope: !690, file: !189, line: 81, type: !260)
!694 = !DILocalVariable(name: "data", scope: !690, file: !189, line: 82, type: !191)
!695 = !DILocalVariable(name: "p", scope: !690, file: !189, line: 83, type: !259)
!696 = !DILocalVariable(name: "s", scope: !690, file: !189, line: 83, type: !259)
!697 = !DILocation(line: 0, scope: !690)
!698 = !DILocation(line: 85, column: 3, scope: !690)
!699 = !DILocation(line: 87, column: 7, scope: !690)
!700 = !DILocation(line: 0, scope: !519, inlinedAt: !701)
!701 = distinct !DILocation(line: 89, column: 7, scope: !690)
!702 = !DILocation(line: 64, column: 17, scope: !519, inlinedAt: !701)
!703 = !DILocation(line: 64, column: 3, scope: !519, inlinedAt: !701)
!704 = !DILocation(line: 66, column: 22, scope: !530, inlinedAt: !701)
!705 = !DILocation(line: 66, column: 26, scope: !530, inlinedAt: !701)
!706 = !DILocation(line: 66, column: 32, scope: !530, inlinedAt: !701)
!707 = !DILocation(line: 66, column: 35, scope: !530, inlinedAt: !701)
!708 = !DILocation(line: 66, column: 39, scope: !530, inlinedAt: !701)
!709 = !DILocation(line: 66, column: 9, scope: !531, inlinedAt: !701)
!710 = !DILocation(line: 69, column: 6, scope: !531, inlinedAt: !701)
!711 = !DILocation(line: 64, column: 10, scope: !519, inlinedAt: !701)
!712 = !DILocation(line: 64, column: 13, scope: !519, inlinedAt: !701)
!713 = distinct !{!713, !703, !714, !435, !436}
!714 = !DILocation(line: 70, column: 3, scope: !519, inlinedAt: !701)
!715 = !DILocation(line: 71, column: 6, scope: !543, inlinedAt: !701)
!716 = !DILocation(line: 71, column: 8, scope: !543, inlinedAt: !701)
!717 = !DILocation(line: 71, column: 6, scope: !519, inlinedAt: !701)
!718 = !DILocation(line: 90, column: 33, scope: !690)
!719 = !DILocation(line: 90, column: 3, scope: !690)
!720 = !DILocation(line: 91, column: 3, scope: !690)
!721 = !DILocation(line: 92, column: 1, scope: !690)
!722 = distinct !DISubprogram(name: "data_to_output", scope: !189, file: !189, line: 94, type: !500, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !723)
!723 = !{!724, !725, !726}
!724 = !DILocalVariable(name: "fd", arg: 1, scope: !722, file: !189, line: 94, type: !233)
!725 = !DILocalVariable(name: "vdata", arg: 2, scope: !722, file: !189, line: 94, type: !260)
!726 = !DILocalVariable(name: "data", scope: !722, file: !189, line: 95, type: !191)
!727 = !DILocation(line: 0, scope: !722)
!728 = !DILocation(line: 0, scope: !626, inlinedAt: !729)
!729 = distinct !DILocation(line: 97, column: 3, scope: !722)
!730 = !DILocation(line: 190, column: 3, scope: !633, inlinedAt: !729)
!731 = !DILocation(line: 191, column: 3, scope: !626, inlinedAt: !729)
!732 = !DILocation(line: 98, column: 34, scope: !722)
!733 = !DILocation(line: 0, scope: !638, inlinedAt: !734)
!734 = distinct !DILocation(line: 98, column: 3, scope: !722)
!735 = !DILocation(line: 180, column: 1, scope: !650, inlinedAt: !734)
!736 = !DILocation(line: 180, column: 1, scope: !648, inlinedAt: !734)
!737 = !DILocation(line: 180, column: 1, scope: !649, inlinedAt: !734)
!738 = distinct !{!738, !735, !735, !435, !436}
!739 = !DILocation(line: 99, column: 1, scope: !722)
!740 = distinct !DISubprogram(name: "check_data", scope: !189, file: !189, line: 101, type: !741, scopeLine: 101, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !743)
!741 = !DISubroutineType(types: !742)
!742 = !{!233, !260, !260}
!743 = !{!744, !745, !746, !747, !748, !749}
!744 = !DILocalVariable(name: "vdata", arg: 1, scope: !740, file: !189, line: 101, type: !260)
!745 = !DILocalVariable(name: "vref", arg: 2, scope: !740, file: !189, line: 101, type: !260)
!746 = !DILocalVariable(name: "data", scope: !740, file: !189, line: 102, type: !191)
!747 = !DILocalVariable(name: "ref", scope: !740, file: !189, line: 103, type: !191)
!748 = !DILocalVariable(name: "has_errors", scope: !740, file: !189, line: 104, type: !233)
!749 = !DILocalVariable(name: "i", scope: !740, file: !189, line: 105, type: !233)
!750 = !DILocation(line: 0, scope: !740)
!751 = !DILocation(line: 108, column: 3, scope: !752)
!752 = distinct !DILexicalBlock(scope: !740, file: !189, line: 108, column: 3)
!753 = !DILocation(line: 109, column: 20, scope: !754)
!754 = distinct !DILexicalBlock(scope: !755, file: !189, line: 108, column: 29)
!755 = distinct !DILexicalBlock(scope: !752, file: !189, line: 108, column: 3)
!756 = !DILocation(line: 109, column: 43, scope: !754)
!757 = !DILocation(line: 109, column: 41, scope: !754)
!758 = !DILocation(line: 109, column: 16, scope: !754)
!759 = !DILocation(line: 108, column: 25, scope: !755)
!760 = !DILocation(line: 108, column: 13, scope: !755)
!761 = distinct !{!761, !751, !762, !435, !436}
!762 = !DILocation(line: 110, column: 3, scope: !752)
!763 = !DILocation(line: 113, column: 10, scope: !740)
!764 = !DILocation(line: 113, column: 3, scope: !740)
!765 = distinct !DISubprogram(name: "readfile", scope: !2, file: !2, line: 34, type: !766, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !257, retainedNodes: !768)
!766 = !DISubroutineType(types: !767)
!767 = !{!259, !233}
!768 = !{!769, !770, !771, !808, !811, !814}
!769 = !DILocalVariable(name: "fd", arg: 1, scope: !765, file: !2, line: 34, type: !233)
!770 = !DILocalVariable(name: "p", scope: !765, file: !2, line: 35, type: !259)
!771 = !DILocalVariable(name: "s", scope: !765, file: !2, line: 36, type: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !773, line: 44, size: 1024, elements: !774)
!773 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/struct_stat.h", directory: "")
!774 = !{!775, !777, !779, !781, !783, !785, !787, !788, !789, !791, !793, !794, !796, !804, !805, !806}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !772, file: !773, line: 46, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !205, line: 145, baseType: !206)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !772, file: !773, line: 47, baseType: !778, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !205, line: 148, baseType: !206)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !772, file: !773, line: 48, baseType: !780, size: 32, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !205, line: 150, baseType: !269)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !772, file: !773, line: 49, baseType: !782, size: 32, offset: 160)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !205, line: 151, baseType: !269)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !772, file: !773, line: 50, baseType: !784, size: 32, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !205, line: 146, baseType: !269)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !772, file: !773, line: 51, baseType: !786, size: 32, offset: 224)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !205, line: 147, baseType: !269)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !772, file: !773, line: 52, baseType: !776, size: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !772, file: !773, line: 53, baseType: !776, size: 64, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !772, file: !773, line: 54, baseType: !790, size: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !205, line: 152, baseType: !277)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !772, file: !773, line: 55, baseType: !792, size: 32, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !205, line: 175, baseType: !233)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !772, file: !773, line: 56, baseType: !233, size: 32, offset: 480)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !772, file: !773, line: 57, baseType: !795, size: 64, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !205, line: 180, baseType: !277)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !772, file: !773, line: 65, baseType: !797, size: 128, offset: 576)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !798, line: 11, size: 128, elements: !799)
!798 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_timespec.h", directory: "")
!799 = !{!800, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !797, file: !798, line: 16, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !205, line: 160, baseType: !277)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !797, file: !798, line: 21, baseType: !803, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !205, line: 197, baseType: !277)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !772, file: !773, line: 66, baseType: !797, size: 128, offset: 704)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !772, file: !773, line: 67, baseType: !797, size: 128, offset: 832)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !772, file: !773, line: 79, baseType: !807, size: 64, offset: 960)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 64, elements: !55)
!808 = !DILocalVariable(name: "len", scope: !765, file: !2, line: 37, type: !809)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !810, line: 85, baseType: !790)
!810 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/types.h", directory: "")
!811 = !DILocalVariable(name: "bytes_read", scope: !765, file: !2, line: 38, type: !812)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !810, line: 108, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !205, line: 194, baseType: !277)
!814 = !DILocalVariable(name: "status", scope: !765, file: !2, line: 38, type: !812)
!815 = distinct !DIAssignID()
!816 = !DILocation(line: 0, scope: !765)
!817 = !DILocation(line: 36, column: 3, scope: !765)
!818 = !DILocation(line: 40, column: 3, scope: !819)
!819 = distinct !DILexicalBlock(scope: !820, file: !2, line: 40, column: 3)
!820 = distinct !DILexicalBlock(scope: !765, file: !2, line: 40, column: 3)
!821 = !DILocation(line: 41, column: 3, scope: !822)
!822 = distinct !DILexicalBlock(scope: !823, file: !2, line: 41, column: 3)
!823 = distinct !DILexicalBlock(scope: !765, file: !2, line: 41, column: 3)
!824 = !DILocation(line: 42, column: 11, scope: !765)
!825 = !DILocation(line: 43, column: 3, scope: !826)
!826 = distinct !DILexicalBlock(scope: !827, file: !2, line: 43, column: 3)
!827 = distinct !DILexicalBlock(scope: !765, file: !2, line: 43, column: 3)
!828 = !DILocation(line: 44, column: 25, scope: !765)
!829 = !DILocation(line: 44, column: 15, scope: !765)
!830 = !DILocation(line: 46, column: 3, scope: !765)
!831 = !DILocation(line: 49, column: 15, scope: !832)
!832 = distinct !DILexicalBlock(scope: !765, file: !2, line: 46, column: 27)
!833 = !DILocation(line: 46, column: 20, scope: !765)
!834 = distinct !{!834, !830, !835, !435, !436}
!835 = !DILocation(line: 50, column: 3, scope: !765)
!836 = !DILocation(line: 47, column: 24, scope: !832)
!837 = !DILocation(line: 47, column: 42, scope: !832)
!838 = !DILocation(line: 47, column: 14, scope: !832)
!839 = !DILocation(line: 48, column: 5, scope: !840)
!840 = distinct !DILexicalBlock(scope: !841, file: !2, line: 48, column: 5)
!841 = distinct !DILexicalBlock(scope: !832, file: !2, line: 48, column: 5)
!842 = !DILocation(line: 51, column: 3, scope: !765)
!843 = !DILocation(line: 51, column: 10, scope: !765)
!844 = !DILocation(line: 52, column: 3, scope: !765)
!845 = !DILocation(line: 54, column: 1, scope: !765)
!846 = !DILocation(line: 53, column: 3, scope: !765)
!847 = !DISubprogram(name: "__assert_fail", scope: !848, file: !848, line: 67, type: !849, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!848 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/assert.h", directory: "")
!849 = !DISubroutineType(types: !850)
!850 = !{null, !851, !851, !269, !851}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!852 = !DISubprogram(name: "fstat", scope: !853, file: !853, line: 210, type: !854, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!853 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/stat.h", directory: "")
!854 = !DISubroutineType(types: !855)
!855 = !{!233, !233, !856}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!857 = !DISubprogram(name: "read", scope: !858, file: !858, line: 371, type: !859, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!858 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/unistd.h", directory: "")
!859 = !DISubroutineType(types: !860)
!860 = !{!812, !233, !260, !614}
!861 = !DISubprogram(name: "close", scope: !858, file: !858, line: 358, type: !627, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!862 = !DILocation(line: 0, scope: !519)
!863 = !DILocation(line: 59, column: 3, scope: !864)
!864 = distinct !DILexicalBlock(scope: !865, file: !2, line: 59, column: 3)
!865 = distinct !DILexicalBlock(scope: !519, file: !2, line: 59, column: 3)
!866 = !DILocation(line: 60, column: 7, scope: !867)
!867 = distinct !DILexicalBlock(scope: !519, file: !2, line: 60, column: 6)
!868 = !DILocation(line: 60, column: 6, scope: !519)
!869 = !DILocation(line: 64, column: 17, scope: !519)
!870 = !DILocation(line: 64, column: 3, scope: !519)
!871 = !DILocation(line: 66, column: 22, scope: !530)
!872 = !DILocation(line: 66, column: 26, scope: !530)
!873 = !DILocation(line: 66, column: 32, scope: !530)
!874 = !DILocation(line: 66, column: 35, scope: !530)
!875 = !DILocation(line: 66, column: 39, scope: !530)
!876 = !DILocation(line: 66, column: 9, scope: !531)
!877 = !DILocation(line: 69, column: 6, scope: !531)
!878 = !DILocation(line: 64, column: 10, scope: !519)
!879 = !DILocation(line: 64, column: 13, scope: !519)
!880 = distinct !{!880, !870, !881, !435, !436}
!881 = !DILocation(line: 70, column: 3, scope: !519)
!882 = !DILocation(line: 71, column: 6, scope: !543)
!883 = !DILocation(line: 71, column: 8, scope: !543)
!884 = !DILocation(line: 71, column: 6, scope: !519)
!885 = !DILocation(line: 74, column: 1, scope: !519)
!886 = distinct !DISubprogram(name: "parse_string", scope: !2, file: !2, line: 77, type: !887, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !257, retainedNodes: !889)
!887 = !DISubroutineType(types: !888)
!888 = !{!233, !259, !259, !233}
!889 = !{!890, !891, !892, !893}
!890 = !DILocalVariable(name: "s", arg: 1, scope: !886, file: !2, line: 77, type: !259)
!891 = !DILocalVariable(name: "arr", arg: 2, scope: !886, file: !2, line: 77, type: !259)
!892 = !DILocalVariable(name: "n", arg: 3, scope: !886, file: !2, line: 77, type: !233)
!893 = !DILocalVariable(name: "k", scope: !886, file: !2, line: 78, type: !233)
!894 = !DILocation(line: 0, scope: !886)
!895 = !DILocation(line: 79, column: 3, scope: !896)
!896 = distinct !DILexicalBlock(scope: !897, file: !2, line: 79, column: 3)
!897 = distinct !DILexicalBlock(scope: !886, file: !2, line: 79, column: 3)
!898 = !DILocation(line: 81, column: 8, scope: !899)
!899 = distinct !DILexicalBlock(scope: !886, file: !2, line: 81, column: 7)
!900 = !DILocation(line: 81, column: 7, scope: !886)
!901 = !DILocation(line: 83, column: 12, scope: !902)
!902 = distinct !DILexicalBlock(scope: !899, file: !2, line: 81, column: 13)
!903 = !DILocation(line: 83, column: 5, scope: !902)
!904 = !DILocation(line: 91, column: 19, scope: !886)
!905 = !DILocation(line: 91, column: 3, scope: !886)
!906 = !DILocation(line: 92, column: 7, scope: !886)
!907 = !DILocation(line: 83, column: 16, scope: !902)
!908 = !DILocation(line: 83, column: 26, scope: !902)
!909 = !DILocation(line: 83, column: 32, scope: !902)
!910 = !DILocation(line: 83, column: 29, scope: !902)
!911 = !DILocation(line: 83, column: 35, scope: !902)
!912 = !DILocation(line: 83, column: 45, scope: !902)
!913 = !DILocation(line: 83, column: 48, scope: !902)
!914 = !DILocation(line: 83, column: 54, scope: !902)
!915 = !DILocation(line: 84, column: 9, scope: !902)
!916 = !DILocation(line: 84, column: 18, scope: !902)
!917 = !DILocation(line: 84, column: 26, scope: !902)
!918 = distinct !{!918, !903, !919, !435, !436}
!919 = !DILocation(line: 86, column: 5, scope: !902)
!920 = !DILocation(line: 93, column: 5, scope: !921)
!921 = distinct !DILexicalBlock(scope: !886, file: !2, line: 92, column: 7)
!922 = !DILocation(line: 93, column: 12, scope: !921)
!923 = !DILocation(line: 95, column: 3, scope: !886)
!924 = distinct !DISubprogram(name: "parse_uint8_t_array", scope: !2, file: !2, line: 132, type: !925, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !257, retainedNodes: !928)
!925 = !DISubroutineType(types: !926)
!926 = !{!233, !259, !927, !233}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!928 = !{!929, !930, !931, !932, !933, !934, !935}
!929 = !DILocalVariable(name: "s", arg: 1, scope: !924, file: !2, line: 132, type: !259)
!930 = !DILocalVariable(name: "arr", arg: 2, scope: !924, file: !2, line: 132, type: !927)
!931 = !DILocalVariable(name: "n", arg: 3, scope: !924, file: !2, line: 132, type: !233)
!932 = !DILocalVariable(name: "line", scope: !924, file: !2, line: 132, type: !259)
!933 = !DILocalVariable(name: "endptr", scope: !924, file: !2, line: 132, type: !259)
!934 = !DILocalVariable(name: "i", scope: !924, file: !2, line: 132, type: !233)
!935 = !DILocalVariable(name: "v", scope: !924, file: !2, line: 132, type: !261)
!936 = distinct !DIAssignID()
!937 = !DILocation(line: 0, scope: !924)
!938 = !DILocation(line: 132, column: 1, scope: !924)
!939 = !DILocation(line: 132, column: 1, scope: !940)
!940 = distinct !DILexicalBlock(scope: !941, file: !2, line: 132, column: 1)
!941 = distinct !DILexicalBlock(scope: !924, file: !2, line: 132, column: 1)
!942 = !DILocation(line: 132, column: 1, scope: !943)
!943 = distinct !DILexicalBlock(scope: !924, file: !2, line: 132, column: 1)
!944 = !{!945, !945, i64 0}
!945 = !{!"any pointer", !395, i64 0}
!946 = distinct !DIAssignID()
!947 = !DILocation(line: 132, column: 1, scope: !948)
!948 = distinct !DILexicalBlock(scope: !943, file: !2, line: 132, column: 1)
!949 = !DILocation(line: 132, column: 1, scope: !950)
!950 = distinct !DILexicalBlock(scope: !948, file: !2, line: 132, column: 1)
!951 = distinct !{!951, !938, !938, !435, !436}
!952 = !DILocation(line: 132, column: 1, scope: !953)
!953 = distinct !DILexicalBlock(scope: !954, file: !2, line: 132, column: 1)
!954 = distinct !DILexicalBlock(scope: !924, file: !2, line: 132, column: 1)
!955 = !DISubprogram(name: "strtok", scope: !956, file: !956, line: 356, type: !957, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!956 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/string.h", directory: "")
!957 = !DISubroutineType(types: !958)
!958 = !{!259, !959, !960}
!959 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !259)
!960 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !851)
!961 = !DISubprogram(name: "strtol", scope: !611, file: !611, line: 177, type: !962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!962 = !DISubroutineType(types: !963)
!963 = !{!277, !960, !964, !233}
!964 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!966 = !DISubprogram(name: "fprintf", scope: !967, file: !967, line: 357, type: !968, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!967 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdio.h", directory: "")
!968 = !DISubroutineType(types: !969)
!969 = !{!233, !970, !960, null}
!970 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !973, line: 7, baseType: !974)
!973 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/FILE.h", directory: "")
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !975, line: 49, size: 1728, elements: !976)
!975 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_FILE.h", directory: "")
!976 = !{!977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !992, !994, !995, !996, !997, !998, !999, !1003, !1006, !1008, !1011, !1014, !1015, !1016, !1018, !1019}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !974, file: !975, line: 51, baseType: !233, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !974, file: !975, line: 54, baseType: !259, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !974, file: !975, line: 55, baseType: !259, size: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !974, file: !975, line: 56, baseType: !259, size: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !974, file: !975, line: 57, baseType: !259, size: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !974, file: !975, line: 58, baseType: !259, size: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !974, file: !975, line: 59, baseType: !259, size: 64, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !974, file: !975, line: 60, baseType: !259, size: 64, offset: 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !974, file: !975, line: 61, baseType: !259, size: 64, offset: 512)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !974, file: !975, line: 64, baseType: !259, size: 64, offset: 576)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !974, file: !975, line: 65, baseType: !259, size: 64, offset: 640)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !974, file: !975, line: 66, baseType: !259, size: 64, offset: 704)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !974, file: !975, line: 68, baseType: !990, size: 64, offset: 768)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !975, line: 36, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !974, file: !975, line: 70, baseType: !993, size: 64, offset: 832)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !974, file: !975, line: 72, baseType: !233, size: 32, offset: 896)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !974, file: !975, line: 73, baseType: !233, size: 32, offset: 928)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !974, file: !975, line: 74, baseType: !790, size: 64, offset: 960)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !974, file: !975, line: 77, baseType: !266, size: 16, offset: 1024)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !974, file: !975, line: 78, baseType: !226, size: 8, offset: 1040)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !974, file: !975, line: 79, baseType: !1000, size: 8, offset: 1048)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !1001)
!1001 = !{!1002}
!1002 = !DISubrange(count: 1)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !974, file: !975, line: 81, baseType: !1004, size: 64, offset: 1088)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !975, line: 43, baseType: null)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !974, file: !975, line: 89, baseType: !1007, size: 64, offset: 1152)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !205, line: 153, baseType: !277)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !974, file: !975, line: 91, baseType: !1009, size: 64, offset: 1216)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !975, line: 37, flags: DIFlagFwdDecl)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !974, file: !975, line: 92, baseType: !1012, size: 64, offset: 1280)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !975, line: 38, flags: DIFlagFwdDecl)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !974, file: !975, line: 93, baseType: !993, size: 64, offset: 1344)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !974, file: !975, line: 94, baseType: !260, size: 64, offset: 1408)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_prevchain", scope: !974, file: !975, line: 95, baseType: !1017, size: 64, offset: 1472)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !974, file: !975, line: 96, baseType: !233, size: 32, offset: 1536)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !974, file: !975, line: 98, baseType: !1020, size: 160, offset: 1568)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !16)
!1021 = !DISubprogram(name: "strlen", scope: !956, file: !956, line: 407, type: !1022, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!206, !851}
!1024 = distinct !DISubprogram(name: "parse_uint16_t_array", scope: !2, file: !2, line: 133, type: !1025, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !257, retainedNodes: !1028)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!233, !259, !1027, !233}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034, !1035}
!1029 = !DILocalVariable(name: "s", arg: 1, scope: !1024, file: !2, line: 133, type: !259)
!1030 = !DILocalVariable(name: "arr", arg: 2, scope: !1024, file: !2, line: 133, type: !1027)
!1031 = !DILocalVariable(name: "n", arg: 3, scope: !1024, file: !2, line: 133, type: !233)
!1032 = !DILocalVariable(name: "line", scope: !1024, file: !2, line: 133, type: !259)
!1033 = !DILocalVariable(name: "endptr", scope: !1024, file: !2, line: 133, type: !259)
!1034 = !DILocalVariable(name: "i", scope: !1024, file: !2, line: 133, type: !233)
!1035 = !DILocalVariable(name: "v", scope: !1024, file: !2, line: 133, type: !264)
!1036 = distinct !DIAssignID()
!1037 = !DILocation(line: 0, scope: !1024)
!1038 = !DILocation(line: 133, column: 1, scope: !1024)
!1039 = !DILocation(line: 133, column: 1, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !2, line: 133, column: 1)
!1041 = distinct !DILexicalBlock(scope: !1024, file: !2, line: 133, column: 1)
!1042 = !DILocation(line: 133, column: 1, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1024, file: !2, line: 133, column: 1)
!1044 = distinct !DIAssignID()
!1045 = !DILocation(line: 133, column: 1, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1043, file: !2, line: 133, column: 1)
!1047 = !DILocation(line: 133, column: 1, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1046, file: !2, line: 133, column: 1)
!1049 = !{!1050, !1050, i64 0}
!1050 = !{!"short", !395, i64 0}
!1051 = distinct !{!1051, !1038, !1038, !435, !436}
!1052 = !DILocation(line: 133, column: 1, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !2, line: 133, column: 1)
!1054 = distinct !DILexicalBlock(scope: !1024, file: !2, line: 133, column: 1)
!1055 = distinct !DISubprogram(name: "parse_uint32_t_array", scope: !2, file: !2, line: 134, type: !1056, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !257, retainedNodes: !1059)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!233, !259, !1058, !233}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1065, !1066}
!1060 = !DILocalVariable(name: "s", arg: 1, scope: !1055, file: !2, line: 134, type: !259)
!1061 = !DILocalVariable(name: "arr", arg: 2, scope: !1055, file: !2, line: 134, type: !1058)
!1062 = !DILocalVariable(name: "n", arg: 3, scope: !1055, file: !2, line: 134, type: !233)
!1063 = !DILocalVariable(name: "line", scope: !1055, file: !2, line: 134, type: !259)
!1064 = !DILocalVariable(name: "endptr", scope: !1055, file: !2, line: 134, type: !259)
!1065 = !DILocalVariable(name: "i", scope: !1055, file: !2, line: 134, type: !233)
!1066 = !DILocalVariable(name: "v", scope: !1055, file: !2, line: 134, type: !267)
!1067 = distinct !DIAssignID()
!1068 = !DILocation(line: 0, scope: !1055)
!1069 = !DILocation(line: 134, column: 1, scope: !1055)
!1070 = !DILocation(line: 134, column: 1, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !2, line: 134, column: 1)
