; ModuleID = 'fft/strided/fft_opt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "riscv64-unknown-linux-gnu"

%struct.bench_args_t = type { [1024 x double], [1024 x double], [512 x double], [512 x double] }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str.1 = private unnamed_addr constant [34 x i8] c"fd>1 && \22Invalid file descriptor\22\00", align 1, !dbg !0
@.str.2 = private unnamed_addr constant [23 x i8] c"../../common/support.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.readfile = private unnamed_addr constant [20 x i8] c"char *readfile(int)\00", align 1, !dbg !12
@.str.4 = private unnamed_addr constant [51 x i8] c"0==fstat(fd, &s) && \22Couldn't determine file size\22\00", align 1, !dbg !18
@.str.6 = private unnamed_addr constant [25 x i8] c"len>0 && \22File is empty\22\00", align 1, !dbg !23
@.str.8 = private unnamed_addr constant [29 x i8] c"status>=0 && \22read() failed\22\00", align 1, !dbg !28
@.str.10 = private unnamed_addr constant [33 x i8] c"n>=0 && \22Invalid section number\22\00", align 1, !dbg !33
@__PRETTY_FUNCTION__.find_section_start = private unnamed_addr constant [38 x i8] c"char *find_section_start(char *, int)\00", align 1, !dbg !38
@.str.12 = private unnamed_addr constant [34 x i8] c"s!=NULL && \22Invalid input string\22\00", align 1, !dbg !43

!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 344, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 43)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !104, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 182, type: !99, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !99, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !99, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !118, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 328, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 41)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 7)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !123, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 240, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 30)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 6)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 90)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !40, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !65)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !171, isLocal: true, isDefinition: true)
!170 = !DIFile(filename: "../../common/harness.c", directory: "/home/kelvin/MachSuite/fft/strided")
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 57)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !9, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 184, elements: !10)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !170, line: 22, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 11)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !170, line: 24, type: !181, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "INPUT_SIZE", scope: !188, file: !189, line: 4, type: !207, isLocal: false, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C11, file: !189, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !190, globals: !206, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "local_support.c", directory: "/home/kelvin/MachSuite/fft/strided")
!190 = !{!191, !197}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bench_args_t", file: !193, line: 14, size: 196608, elements: !194)
!193 = !DIFile(filename: "./fft.h", directory: "/home/kelvin/MachSuite/fft/strided")
!194 = !{!195, !200, !201, !205}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !192, file: !193, line: 15, baseType: !196, size: 65536)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 65536, elements: !198)
!197 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!198 = !{!199}
!199 = !DISubrange(count: 1024)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !192, file: !193, line: 16, baseType: !196, size: 65536, offset: 65536)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "real_twid", scope: !192, file: !193, line: 17, baseType: !202, size: 32768, offset: 131072)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 32768, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "img_twid", scope: !192, file: !193, line: 18, baseType: !202, size: 32768, offset: 163840)
!206 = !{!186}
!207 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !210, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !151)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !124)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !170, line: 47, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 12)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !100)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !170, line: 58, type: !30, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !74)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !170, line: 67, type: !35, isLocal: true, isDefinition: true)
!229 = distinct !DICompileUnit(language: DW_LANG_C11, file: !230, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!230 = !DIFile(filename: "fft.c", directory: "/home/kelvin/MachSuite/fft/strided")
!231 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !232, globals: !262, splitDebugInlining: false, nameTableKind: None)
!232 = !{!233, !4, !234, !235, !240, !243, !246, !249, !253, !256, !258, !261, !197}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !236, line: 24, baseType: !237)
!236 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-uintn.h", directory: "")
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !238, line: 38, baseType: !239)
!238 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types.h", directory: "")
!239 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !236, line: 25, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !238, line: 40, baseType: !242)
!242 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !236, line: 26, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !238, line: 42, baseType: !245)
!245 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !236, line: 27, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !238, line: 45, baseType: !248)
!248 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !250, line: 24, baseType: !251)
!250 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-intn.h", directory: "")
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !238, line: 37, baseType: !252)
!252 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !250, line: 25, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !238, line: 39, baseType: !255)
!255 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !250, line: 26, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !238, line: 41, baseType: !207)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !250, line: 27, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !238, line: 44, baseType: !260)
!260 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!261 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!262 = !{!263, !0, !7, !12, !268, !18, !270, !23, !275, !28, !277, !33, !38, !279, !43, !45, !47, !52, !57, !62, !67, !69, !71, !76, !78, !80, !82, !87, !89, !284, !92, !97, !102, !107, !112, !114, !116, !121, !126, !128, !130, !132, !134, !136, !141, !146, !148, !153, !289, !158, !163, !291, !165}
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 24)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !30, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !272, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 14)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !272, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !9, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !281, isLocal: true, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 21)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !2, line: 154, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 13)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !20, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 27)
!296 = distinct !DICompileUnit(language: DW_LANG_C11, file: !170, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !297, globals: !298, splitDebugInlining: false, nameTableKind: None)
!297 = !{!234}
!298 = !{!299, !168, !174, !176, !179, !184, !301, !208, !303, !211, !214, !305, !219, !222, !310, !224, !227, !312}
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !221, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !272, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !210, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 31)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !210, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !170, line: 74, type: !314, isLocal: true, isDefinition: true)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 10)
!317 = !{!"clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)"}
!318 = !{i32 7, !"Dwarf Version", i32 4}
!319 = !{i32 2, !"Debug Info Version", i32 3}
!320 = !{i32 1, !"wchar_size", i32 4}
!321 = !{i32 1, !"target-abi", !"lp64d"}
!322 = distinct !{i32 6, !"riscv-isa", !323}
!323 = distinct !{!"rv64i2p1_m2p0_a2p1_f2p2_d2p2_zicsr2p0_zifencei2p0"}
!324 = !{i32 8, !"PIC Level", i32 2}
!325 = !{i32 7, !"PIE Level", i32 2}
!326 = !{i32 7, !"uwtable", i32 2}
!327 = !{i32 8, !"SmallDataLimit", i32 8}
!328 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!329 = distinct !DISubprogram(name: "fft", scope: !230, file: !230, line: 3, type: !330, scopeLine: 3, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !229, retainedNodes: !333)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !332, !332, !332, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!334 = !DILocalVariable(name: "real", arg: 1, scope: !329, file: !230, line: 3, type: !332)
!335 = !DILocalVariable(name: "img", arg: 2, scope: !329, file: !230, line: 3, type: !332)
!336 = !DILocalVariable(name: "real_twid", arg: 3, scope: !329, file: !230, line: 3, type: !332)
!337 = !DILocalVariable(name: "img_twid", arg: 4, scope: !329, file: !230, line: 3, type: !332)
!338 = !DILocalVariable(name: "even", scope: !329, file: !230, line: 4, type: !207)
!339 = !DILocalVariable(name: "odd", scope: !329, file: !230, line: 4, type: !207)
!340 = !DILocalVariable(name: "span", scope: !329, file: !230, line: 4, type: !207)
!341 = !DILocalVariable(name: "log", scope: !329, file: !230, line: 4, type: !207)
!342 = !DILocalVariable(name: "rootindex", scope: !329, file: !230, line: 4, type: !207)
!343 = !DILocalVariable(name: "temp", scope: !329, file: !230, line: 5, type: !197)
!344 = !DILabel(scope: !329, name: "outer", file: !230, line: 8)
!345 = !DILabel(scope: !346, name: "inner", file: !230, line: 9)
!346 = distinct !DILexicalBlock(scope: !347, file: !230, line: 8, column: 55)
!347 = distinct !DILexicalBlock(scope: !348, file: !230, line: 8, column: 11)
!348 = distinct !DILexicalBlock(scope: !329, file: !230, line: 8, column: 11)
!349 = !DILocation(line: 0, scope: !329)
!350 = !DILocation(line: 8, column: 5, scope: !329)
!351 = !DILocation(line: 8, column: 11, scope: !348)
!352 = !DILocation(line: 9, column: 15, scope: !353)
!353 = distinct !DILexicalBlock(scope: !346, file: !230, line: 9, column: 15)
!354 = !DILocation(line: 10, column: 17, scope: !355)
!355 = distinct !DILexicalBlock(scope: !356, file: !230, line: 9, column: 49)
!356 = distinct !DILexicalBlock(scope: !353, file: !230, line: 9, column: 15)
!357 = !DILocation(line: 11, column: 24, scope: !355)
!358 = !DILocation(line: 13, column: 20, scope: !355)
!359 = !{!360, !360, i64 0}
!360 = !{!"double", !361, i64 0}
!361 = !{!"omnipotent char", !362, i64 0}
!362 = !{!"Simple C/C++ TBAA"}
!363 = !DILocation(line: 13, column: 33, scope: !355)
!364 = !DILocation(line: 13, column: 31, scope: !355)
!365 = !DILocation(line: 14, column: 36, scope: !355)
!366 = !DILocation(line: 14, column: 23, scope: !355)
!367 = !DILocation(line: 15, column: 24, scope: !355)
!368 = !DILocation(line: 17, column: 20, scope: !355)
!369 = !DILocation(line: 17, column: 32, scope: !355)
!370 = !DILocation(line: 17, column: 30, scope: !355)
!371 = !DILocation(line: 18, column: 34, scope: !355)
!372 = !DILocation(line: 18, column: 22, scope: !355)
!373 = !DILocation(line: 19, column: 23, scope: !355)
!374 = !DILocation(line: 21, column: 30, scope: !355)
!375 = !DILocation(line: 21, column: 37, scope: !355)
!376 = !DILocation(line: 22, column: 16, scope: !377)
!377 = distinct !DILexicalBlock(scope: !355, file: !230, line: 22, column: 16)
!378 = !DILocation(line: 22, column: 16, scope: !355)
!379 = !DILocation(line: 23, column: 24, scope: !380)
!380 = distinct !DILexicalBlock(scope: !377, file: !230, line: 22, column: 26)
!381 = !DILocation(line: 23, column: 47, scope: !380)
!382 = !DILocation(line: 24, column: 21, scope: !380)
!383 = !DILocation(line: 24, column: 44, scope: !380)
!384 = !DILocation(line: 23, column: 57, scope: !380)
!385 = !DILocation(line: 26, column: 40, scope: !380)
!386 = !DILocation(line: 25, column: 58, scope: !380)
!387 = !DILocation(line: 25, column: 26, scope: !380)
!388 = !DILocation(line: 27, column: 27, scope: !380)
!389 = !DILocation(line: 28, column: 13, scope: !380)
!390 = !DILocation(line: 9, column: 46, scope: !356)
!391 = !DILocation(line: 9, column: 32, scope: !356)
!392 = distinct !{!392, !352, !393, !394, !395}
!393 = !DILocation(line: 29, column: 9, scope: !353)
!394 = !{!"llvm.loop.mustprogress"}
!395 = !{!"llvm.loop.unroll.disable"}
!396 = !DILocation(line: 8, column: 43, scope: !347)
!397 = !DILocation(line: 8, column: 52, scope: !347)
!398 = distinct !{!398, !351, !399, !394, !395}
!399 = !DILocation(line: 30, column: 5, scope: !348)
!400 = !DILocation(line: 31, column: 1, scope: !329)
!401 = distinct !DISubprogram(name: "run_benchmark", scope: !189, file: !189, line: 8, type: !402, scopeLine: 8, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !404)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !234}
!404 = !{!405, !406}
!405 = !DILocalVariable(name: "vargs", arg: 1, scope: !401, file: !189, line: 8, type: !234)
!406 = !DILocalVariable(name: "args", scope: !401, file: !189, line: 9, type: !191)
!407 = !DILocation(line: 0, scope: !401)
!408 = !DILocation(line: 10, column: 25, scope: !401)
!409 = !DILocation(line: 10, column: 36, scope: !401)
!410 = !DILocation(line: 10, column: 53, scope: !401)
!411 = !DILocation(line: 0, scope: !329, inlinedAt: !412)
!412 = distinct !DILocation(line: 10, column: 3, scope: !401)
!413 = !DILocation(line: 8, column: 5, scope: !329, inlinedAt: !412)
!414 = !DILocation(line: 8, column: 11, scope: !348, inlinedAt: !412)
!415 = !DILocation(line: 9, column: 15, scope: !353, inlinedAt: !412)
!416 = !DILocation(line: 10, column: 17, scope: !355, inlinedAt: !412)
!417 = !DILocation(line: 11, column: 24, scope: !355, inlinedAt: !412)
!418 = !DILocation(line: 13, column: 20, scope: !355, inlinedAt: !412)
!419 = !DILocation(line: 13, column: 33, scope: !355, inlinedAt: !412)
!420 = !DILocation(line: 13, column: 31, scope: !355, inlinedAt: !412)
!421 = !DILocation(line: 14, column: 36, scope: !355, inlinedAt: !412)
!422 = !DILocation(line: 14, column: 23, scope: !355, inlinedAt: !412)
!423 = !DILocation(line: 15, column: 24, scope: !355, inlinedAt: !412)
!424 = !DILocation(line: 17, column: 20, scope: !355, inlinedAt: !412)
!425 = !DILocation(line: 17, column: 32, scope: !355, inlinedAt: !412)
!426 = !DILocation(line: 17, column: 30, scope: !355, inlinedAt: !412)
!427 = !DILocation(line: 18, column: 34, scope: !355, inlinedAt: !412)
!428 = !DILocation(line: 18, column: 22, scope: !355, inlinedAt: !412)
!429 = !DILocation(line: 19, column: 23, scope: !355, inlinedAt: !412)
!430 = !DILocation(line: 21, column: 30, scope: !355, inlinedAt: !412)
!431 = !DILocation(line: 21, column: 37, scope: !355, inlinedAt: !412)
!432 = !DILocation(line: 22, column: 16, scope: !377, inlinedAt: !412)
!433 = !DILocation(line: 22, column: 16, scope: !355, inlinedAt: !412)
!434 = !DILocation(line: 23, column: 24, scope: !380, inlinedAt: !412)
!435 = !DILocation(line: 23, column: 47, scope: !380, inlinedAt: !412)
!436 = !DILocation(line: 24, column: 21, scope: !380, inlinedAt: !412)
!437 = !DILocation(line: 24, column: 44, scope: !380, inlinedAt: !412)
!438 = !DILocation(line: 23, column: 57, scope: !380, inlinedAt: !412)
!439 = !DILocation(line: 26, column: 40, scope: !380, inlinedAt: !412)
!440 = !DILocation(line: 25, column: 58, scope: !380, inlinedAt: !412)
!441 = !DILocation(line: 25, column: 26, scope: !380, inlinedAt: !412)
!442 = !DILocation(line: 27, column: 27, scope: !380, inlinedAt: !412)
!443 = !DILocation(line: 28, column: 13, scope: !380, inlinedAt: !412)
!444 = !DILocation(line: 9, column: 46, scope: !356, inlinedAt: !412)
!445 = !DILocation(line: 9, column: 32, scope: !356, inlinedAt: !412)
!446 = distinct !{!446, !415, !447, !394, !395}
!447 = !DILocation(line: 29, column: 9, scope: !353, inlinedAt: !412)
!448 = !DILocation(line: 8, column: 43, scope: !347, inlinedAt: !412)
!449 = !DILocation(line: 8, column: 52, scope: !347, inlinedAt: !412)
!450 = distinct !{!450, !414, !451, !394, !395}
!451 = !DILocation(line: 30, column: 5, scope: !348, inlinedAt: !412)
!452 = !DILocation(line: 11, column: 1, scope: !401)
!453 = distinct !DISubprogram(name: "input_to_data", scope: !189, file: !189, line: 24, type: !454, scopeLine: 24, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !456)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !207, !234}
!456 = !{!457, !458, !459, !460, !461}
!457 = !DILocalVariable(name: "fd", arg: 1, scope: !453, file: !189, line: 24, type: !207)
!458 = !DILocalVariable(name: "vdata", arg: 2, scope: !453, file: !189, line: 24, type: !234)
!459 = !DILocalVariable(name: "data", scope: !453, file: !189, line: 25, type: !191)
!460 = !DILocalVariable(name: "p", scope: !453, file: !189, line: 26, type: !233)
!461 = !DILocalVariable(name: "s", scope: !453, file: !189, line: 26, type: !233)
!462 = !DILocation(line: 0, scope: !453)
!463 = !DILocation(line: 28, column: 7, scope: !453)
!464 = !DILocalVariable(name: "s", arg: 1, scope: !465, file: !2, line: 56, type: !233)
!465 = distinct !DISubprogram(name: "find_section_start", scope: !2, file: !2, line: 56, type: !466, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !468)
!466 = !DISubroutineType(types: !467)
!467 = !{!233, !233, !207}
!468 = !{!464, !469, !470}
!469 = !DILocalVariable(name: "n", arg: 2, scope: !465, file: !2, line: 56, type: !207)
!470 = !DILocalVariable(name: "i", scope: !465, file: !2, line: 57, type: !207)
!471 = !DILocation(line: 0, scope: !465, inlinedAt: !472)
!472 = distinct !DILocation(line: 30, column: 7, scope: !453)
!473 = !DILocation(line: 64, column: 17, scope: !465, inlinedAt: !472)
!474 = !{!361, !361, i64 0}
!475 = !DILocation(line: 64, column: 3, scope: !465, inlinedAt: !472)
!476 = !DILocation(line: 66, column: 22, scope: !477, inlinedAt: !472)
!477 = distinct !DILexicalBlock(scope: !478, file: !2, line: 66, column: 9)
!478 = distinct !DILexicalBlock(scope: !465, file: !2, line: 64, column: 31)
!479 = !DILocation(line: 66, column: 26, scope: !477, inlinedAt: !472)
!480 = !DILocation(line: 66, column: 32, scope: !477, inlinedAt: !472)
!481 = !DILocation(line: 66, column: 35, scope: !477, inlinedAt: !472)
!482 = !DILocation(line: 66, column: 39, scope: !477, inlinedAt: !472)
!483 = !DILocation(line: 66, column: 9, scope: !478, inlinedAt: !472)
!484 = !DILocation(line: 69, column: 6, scope: !478, inlinedAt: !472)
!485 = !DILocation(line: 64, column: 10, scope: !465, inlinedAt: !472)
!486 = !DILocation(line: 64, column: 13, scope: !465, inlinedAt: !472)
!487 = distinct !{!487, !475, !488, !394, !395}
!488 = !DILocation(line: 70, column: 3, scope: !465, inlinedAt: !472)
!489 = !DILocation(line: 71, column: 6, scope: !490, inlinedAt: !472)
!490 = distinct !DILexicalBlock(scope: !465, file: !2, line: 71, column: 6)
!491 = !DILocation(line: 71, column: 8, scope: !490, inlinedAt: !472)
!492 = !DILocation(line: 71, column: 6, scope: !465, inlinedAt: !472)
!493 = !DILocation(line: 31, column: 3, scope: !453)
!494 = !DILocation(line: 0, scope: !465, inlinedAt: !495)
!495 = distinct !DILocation(line: 33, column: 7, scope: !453)
!496 = !DILocation(line: 64, column: 17, scope: !465, inlinedAt: !495)
!497 = !DILocation(line: 64, column: 3, scope: !465, inlinedAt: !495)
!498 = !DILocation(line: 66, column: 22, scope: !477, inlinedAt: !495)
!499 = !DILocation(line: 66, column: 26, scope: !477, inlinedAt: !495)
!500 = !DILocation(line: 66, column: 32, scope: !477, inlinedAt: !495)
!501 = !DILocation(line: 66, column: 35, scope: !477, inlinedAt: !495)
!502 = !DILocation(line: 66, column: 39, scope: !477, inlinedAt: !495)
!503 = !DILocation(line: 66, column: 9, scope: !478, inlinedAt: !495)
!504 = !DILocation(line: 69, column: 6, scope: !478, inlinedAt: !495)
!505 = !DILocation(line: 64, column: 10, scope: !465, inlinedAt: !495)
!506 = !DILocation(line: 64, column: 13, scope: !465, inlinedAt: !495)
!507 = distinct !{!507, !497, !508, !394, !395}
!508 = !DILocation(line: 70, column: 3, scope: !465, inlinedAt: !495)
!509 = !DILocation(line: 71, column: 6, scope: !490, inlinedAt: !495)
!510 = !DILocation(line: 71, column: 8, scope: !490, inlinedAt: !495)
!511 = !DILocation(line: 71, column: 6, scope: !465, inlinedAt: !495)
!512 = !DILocation(line: 34, column: 31, scope: !453)
!513 = !DILocation(line: 34, column: 3, scope: !453)
!514 = !DILocation(line: 0, scope: !465, inlinedAt: !515)
!515 = distinct !DILocation(line: 36, column: 7, scope: !453)
!516 = !DILocation(line: 64, column: 17, scope: !465, inlinedAt: !515)
!517 = !DILocation(line: 64, column: 3, scope: !465, inlinedAt: !515)
!518 = !DILocation(line: 66, column: 22, scope: !477, inlinedAt: !515)
!519 = !DILocation(line: 66, column: 26, scope: !477, inlinedAt: !515)
!520 = !DILocation(line: 66, column: 32, scope: !477, inlinedAt: !515)
!521 = !DILocation(line: 66, column: 35, scope: !477, inlinedAt: !515)
!522 = !DILocation(line: 66, column: 39, scope: !477, inlinedAt: !515)
!523 = !DILocation(line: 66, column: 9, scope: !478, inlinedAt: !515)
!524 = !DILocation(line: 69, column: 6, scope: !478, inlinedAt: !515)
!525 = !DILocation(line: 64, column: 10, scope: !465, inlinedAt: !515)
!526 = !DILocation(line: 64, column: 13, scope: !465, inlinedAt: !515)
!527 = distinct !{!527, !517, !528, !394, !395}
!528 = !DILocation(line: 70, column: 3, scope: !465, inlinedAt: !515)
!529 = !DILocation(line: 71, column: 6, scope: !490, inlinedAt: !515)
!530 = !DILocation(line: 71, column: 8, scope: !490, inlinedAt: !515)
!531 = !DILocation(line: 71, column: 6, scope: !465, inlinedAt: !515)
!532 = !DILocation(line: 37, column: 31, scope: !453)
!533 = !DILocation(line: 37, column: 3, scope: !453)
!534 = !DILocation(line: 0, scope: !465, inlinedAt: !535)
!535 = distinct !DILocation(line: 39, column: 7, scope: !453)
!536 = !DILocation(line: 64, column: 17, scope: !465, inlinedAt: !535)
!537 = !DILocation(line: 64, column: 3, scope: !465, inlinedAt: !535)
!538 = !DILocation(line: 66, column: 22, scope: !477, inlinedAt: !535)
!539 = !DILocation(line: 66, column: 26, scope: !477, inlinedAt: !535)
!540 = !DILocation(line: 66, column: 32, scope: !477, inlinedAt: !535)
!541 = !DILocation(line: 66, column: 35, scope: !477, inlinedAt: !535)
!542 = !DILocation(line: 66, column: 39, scope: !477, inlinedAt: !535)
!543 = !DILocation(line: 66, column: 9, scope: !478, inlinedAt: !535)
!544 = !DILocation(line: 69, column: 6, scope: !478, inlinedAt: !535)
!545 = !DILocation(line: 64, column: 10, scope: !465, inlinedAt: !535)
!546 = !DILocation(line: 64, column: 13, scope: !465, inlinedAt: !535)
!547 = distinct !{!547, !537, !548, !394, !395}
!548 = !DILocation(line: 70, column: 3, scope: !465, inlinedAt: !535)
!549 = !DILocation(line: 71, column: 6, scope: !490, inlinedAt: !535)
!550 = !DILocation(line: 71, column: 8, scope: !490, inlinedAt: !535)
!551 = !DILocation(line: 71, column: 6, scope: !465, inlinedAt: !535)
!552 = !DILocation(line: 40, column: 31, scope: !453)
!553 = !DILocation(line: 40, column: 3, scope: !453)
!554 = !DILocation(line: 41, column: 3, scope: !453)
!555 = !DILocation(line: 42, column: 1, scope: !453)
!556 = !DISubprogram(name: "free", scope: !557, file: !557, line: 687, type: !402, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!557 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdlib.h", directory: "")
!558 = distinct !DISubprogram(name: "data_to_input", scope: !189, file: !189, line: 44, type: !454, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !559)
!559 = !{!560, !561, !562}
!560 = !DILocalVariable(name: "fd", arg: 1, scope: !558, file: !189, line: 44, type: !207)
!561 = !DILocalVariable(name: "vdata", arg: 2, scope: !558, file: !189, line: 44, type: !234)
!562 = !DILocalVariable(name: "data", scope: !558, file: !189, line: 45, type: !191)
!563 = !DILocation(line: 0, scope: !558)
!564 = !DILocalVariable(name: "fd", arg: 1, scope: !565, file: !2, line: 189, type: !207)
!565 = distinct !DISubprogram(name: "write_section_header", scope: !2, file: !2, line: 189, type: !566, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !568)
!566 = !DISubroutineType(types: !567)
!567 = !{!207, !207}
!568 = !{!564}
!569 = !DILocation(line: 0, scope: !565, inlinedAt: !570)
!570 = distinct !DILocation(line: 47, column: 3, scope: !558)
!571 = !DILocation(line: 190, column: 3, scope: !572, inlinedAt: !570)
!572 = distinct !DILexicalBlock(scope: !573, file: !2, line: 190, column: 3)
!573 = distinct !DILexicalBlock(scope: !565, file: !2, line: 190, column: 3)
!574 = !DILocation(line: 191, column: 3, scope: !565, inlinedAt: !570)
!575 = !DILocalVariable(name: "fd", arg: 1, scope: !576, file: !2, line: 187, type: !207)
!576 = distinct !DISubprogram(name: "write_double_array", scope: !2, file: !2, line: 187, type: !577, scopeLine: 187, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !579)
!577 = !DISubroutineType(types: !578)
!578 = !{!207, !207, !332, !207}
!579 = !{!575, !580, !581, !582}
!580 = !DILocalVariable(name: "arr", arg: 2, scope: !576, file: !2, line: 187, type: !332)
!581 = !DILocalVariable(name: "n", arg: 3, scope: !576, file: !2, line: 187, type: !207)
!582 = !DILocalVariable(name: "i", scope: !576, file: !2, line: 187, type: !207)
!583 = !DILocation(line: 0, scope: !576, inlinedAt: !584)
!584 = distinct !DILocation(line: 48, column: 3, scope: !558)
!585 = !DILocation(line: 187, column: 1, scope: !586, inlinedAt: !584)
!586 = distinct !DILexicalBlock(scope: !576, file: !2, line: 187, column: 1)
!587 = !DILocation(line: 187, column: 1, scope: !588, inlinedAt: !584)
!588 = distinct !DILexicalBlock(scope: !589, file: !2, line: 187, column: 1)
!589 = distinct !DILexicalBlock(scope: !586, file: !2, line: 187, column: 1)
!590 = !DILocation(line: 187, column: 1, scope: !589, inlinedAt: !584)
!591 = distinct !{!591, !585, !585, !394, !395}
!592 = !DILocation(line: 0, scope: !565, inlinedAt: !593)
!593 = distinct !DILocation(line: 50, column: 3, scope: !558)
!594 = !DILocation(line: 191, column: 3, scope: !565, inlinedAt: !593)
!595 = !DILocation(line: 51, column: 32, scope: !558)
!596 = !DILocation(line: 0, scope: !576, inlinedAt: !597)
!597 = distinct !DILocation(line: 51, column: 3, scope: !558)
!598 = !DILocation(line: 187, column: 1, scope: !586, inlinedAt: !597)
!599 = !DILocation(line: 187, column: 1, scope: !588, inlinedAt: !597)
!600 = !DILocation(line: 187, column: 1, scope: !589, inlinedAt: !597)
!601 = distinct !{!601, !598, !598, !394, !395}
!602 = !DILocation(line: 0, scope: !565, inlinedAt: !603)
!603 = distinct !DILocation(line: 53, column: 3, scope: !558)
!604 = !DILocation(line: 191, column: 3, scope: !565, inlinedAt: !603)
!605 = !DILocation(line: 54, column: 32, scope: !558)
!606 = !DILocation(line: 0, scope: !576, inlinedAt: !607)
!607 = distinct !DILocation(line: 54, column: 3, scope: !558)
!608 = !DILocation(line: 187, column: 1, scope: !586, inlinedAt: !607)
!609 = !DILocation(line: 187, column: 1, scope: !588, inlinedAt: !607)
!610 = !DILocation(line: 187, column: 1, scope: !589, inlinedAt: !607)
!611 = distinct !{!611, !608, !608, !394, !395}
!612 = !DILocation(line: 0, scope: !565, inlinedAt: !613)
!613 = distinct !DILocation(line: 56, column: 3, scope: !558)
!614 = !DILocation(line: 191, column: 3, scope: !565, inlinedAt: !613)
!615 = !DILocation(line: 57, column: 32, scope: !558)
!616 = !DILocation(line: 0, scope: !576, inlinedAt: !617)
!617 = distinct !DILocation(line: 57, column: 3, scope: !558)
!618 = !DILocation(line: 187, column: 1, scope: !586, inlinedAt: !617)
!619 = !DILocation(line: 187, column: 1, scope: !588, inlinedAt: !617)
!620 = !DILocation(line: 187, column: 1, scope: !589, inlinedAt: !617)
!621 = distinct !{!621, !618, !618, !394, !395}
!622 = !DILocation(line: 58, column: 1, scope: !558)
!623 = distinct !DISubprogram(name: "output_to_data", scope: !189, file: !189, line: 67, type: !454, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !624)
!624 = !{!625, !626, !627, !628, !629}
!625 = !DILocalVariable(name: "fd", arg: 1, scope: !623, file: !189, line: 67, type: !207)
!626 = !DILocalVariable(name: "vdata", arg: 2, scope: !623, file: !189, line: 67, type: !234)
!627 = !DILocalVariable(name: "data", scope: !623, file: !189, line: 68, type: !191)
!628 = !DILocalVariable(name: "p", scope: !623, file: !189, line: 69, type: !233)
!629 = !DILocalVariable(name: "s", scope: !623, file: !189, line: 69, type: !233)
!630 = !DILocation(line: 0, scope: !623)
!631 = !DILocation(line: 71, column: 3, scope: !623)
!632 = !DILocation(line: 73, column: 7, scope: !623)
!633 = !DILocation(line: 0, scope: !465, inlinedAt: !634)
!634 = distinct !DILocation(line: 75, column: 7, scope: !623)
!635 = !DILocation(line: 64, column: 17, scope: !465, inlinedAt: !634)
!636 = !DILocation(line: 64, column: 3, scope: !465, inlinedAt: !634)
!637 = !DILocation(line: 66, column: 22, scope: !477, inlinedAt: !634)
!638 = !DILocation(line: 66, column: 26, scope: !477, inlinedAt: !634)
!639 = !DILocation(line: 66, column: 32, scope: !477, inlinedAt: !634)
!640 = !DILocation(line: 66, column: 35, scope: !477, inlinedAt: !634)
!641 = !DILocation(line: 66, column: 39, scope: !477, inlinedAt: !634)
!642 = !DILocation(line: 66, column: 9, scope: !478, inlinedAt: !634)
!643 = !DILocation(line: 69, column: 6, scope: !478, inlinedAt: !634)
!644 = !DILocation(line: 64, column: 10, scope: !465, inlinedAt: !634)
!645 = !DILocation(line: 64, column: 13, scope: !465, inlinedAt: !634)
!646 = distinct !{!646, !636, !647, !394, !395}
!647 = !DILocation(line: 70, column: 3, scope: !465, inlinedAt: !634)
!648 = !DILocation(line: 71, column: 6, scope: !490, inlinedAt: !634)
!649 = !DILocation(line: 71, column: 8, scope: !490, inlinedAt: !634)
!650 = !DILocation(line: 71, column: 6, scope: !465, inlinedAt: !634)
!651 = !DILocation(line: 76, column: 3, scope: !623)
!652 = !DILocation(line: 0, scope: !465, inlinedAt: !653)
!653 = distinct !DILocation(line: 78, column: 7, scope: !623)
!654 = !DILocation(line: 64, column: 17, scope: !465, inlinedAt: !653)
!655 = !DILocation(line: 64, column: 3, scope: !465, inlinedAt: !653)
!656 = !DILocation(line: 66, column: 22, scope: !477, inlinedAt: !653)
!657 = !DILocation(line: 66, column: 26, scope: !477, inlinedAt: !653)
!658 = !DILocation(line: 66, column: 32, scope: !477, inlinedAt: !653)
!659 = !DILocation(line: 66, column: 35, scope: !477, inlinedAt: !653)
!660 = !DILocation(line: 66, column: 39, scope: !477, inlinedAt: !653)
!661 = !DILocation(line: 66, column: 9, scope: !478, inlinedAt: !653)
!662 = !DILocation(line: 69, column: 6, scope: !478, inlinedAt: !653)
!663 = !DILocation(line: 64, column: 10, scope: !465, inlinedAt: !653)
!664 = !DILocation(line: 64, column: 13, scope: !465, inlinedAt: !653)
!665 = distinct !{!665, !655, !666, !394, !395}
!666 = !DILocation(line: 70, column: 3, scope: !465, inlinedAt: !653)
!667 = !DILocation(line: 71, column: 6, scope: !490, inlinedAt: !653)
!668 = !DILocation(line: 71, column: 8, scope: !490, inlinedAt: !653)
!669 = !DILocation(line: 71, column: 6, scope: !465, inlinedAt: !653)
!670 = !DILocation(line: 79, column: 31, scope: !623)
!671 = !DILocation(line: 79, column: 3, scope: !623)
!672 = !DILocation(line: 80, column: 3, scope: !623)
!673 = !DILocation(line: 81, column: 1, scope: !623)
!674 = distinct !DISubprogram(name: "data_to_output", scope: !189, file: !189, line: 83, type: !454, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !675)
!675 = !{!676, !677, !678}
!676 = !DILocalVariable(name: "fd", arg: 1, scope: !674, file: !189, line: 83, type: !207)
!677 = !DILocalVariable(name: "vdata", arg: 2, scope: !674, file: !189, line: 83, type: !234)
!678 = !DILocalVariable(name: "data", scope: !674, file: !189, line: 84, type: !191)
!679 = !DILocation(line: 0, scope: !674)
!680 = !DILocation(line: 0, scope: !565, inlinedAt: !681)
!681 = distinct !DILocation(line: 86, column: 3, scope: !674)
!682 = !DILocation(line: 190, column: 3, scope: !572, inlinedAt: !681)
!683 = !DILocation(line: 191, column: 3, scope: !565, inlinedAt: !681)
!684 = !DILocation(line: 0, scope: !576, inlinedAt: !685)
!685 = distinct !DILocation(line: 87, column: 3, scope: !674)
!686 = !DILocation(line: 187, column: 1, scope: !586, inlinedAt: !685)
!687 = !DILocation(line: 187, column: 1, scope: !588, inlinedAt: !685)
!688 = !DILocation(line: 187, column: 1, scope: !589, inlinedAt: !685)
!689 = distinct !{!689, !686, !686, !394, !395}
!690 = !DILocation(line: 0, scope: !565, inlinedAt: !691)
!691 = distinct !DILocation(line: 89, column: 3, scope: !674)
!692 = !DILocation(line: 191, column: 3, scope: !565, inlinedAt: !691)
!693 = !DILocation(line: 90, column: 32, scope: !674)
!694 = !DILocation(line: 0, scope: !576, inlinedAt: !695)
!695 = distinct !DILocation(line: 90, column: 3, scope: !674)
!696 = !DILocation(line: 187, column: 1, scope: !586, inlinedAt: !695)
!697 = !DILocation(line: 187, column: 1, scope: !588, inlinedAt: !695)
!698 = !DILocation(line: 187, column: 1, scope: !589, inlinedAt: !695)
!699 = distinct !{!699, !696, !696, !394, !395}
!700 = !DILocation(line: 91, column: 1, scope: !674)
!701 = distinct !DISubprogram(name: "check_data", scope: !189, file: !189, line: 93, type: !702, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !704)
!702 = !DISubroutineType(types: !703)
!703 = !{!207, !234, !234}
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712}
!705 = !DILocalVariable(name: "vdata", arg: 1, scope: !701, file: !189, line: 93, type: !234)
!706 = !DILocalVariable(name: "vref", arg: 2, scope: !701, file: !189, line: 93, type: !234)
!707 = !DILocalVariable(name: "data", scope: !701, file: !189, line: 94, type: !191)
!708 = !DILocalVariable(name: "ref", scope: !701, file: !189, line: 95, type: !191)
!709 = !DILocalVariable(name: "has_errors", scope: !701, file: !189, line: 96, type: !207)
!710 = !DILocalVariable(name: "i", scope: !701, file: !189, line: 97, type: !207)
!711 = !DILocalVariable(name: "real_diff", scope: !701, file: !189, line: 98, type: !197)
!712 = !DILocalVariable(name: "img_diff", scope: !701, file: !189, line: 98, type: !197)
!713 = !DILocation(line: 0, scope: !701)
!714 = !DILocation(line: 100, column: 3, scope: !715)
!715 = distinct !DILexicalBlock(scope: !701, file: !189, line: 100, column: 3)
!716 = !DILocation(line: 101, column: 17, scope: !717)
!717 = distinct !DILexicalBlock(scope: !718, file: !189, line: 100, column: 29)
!718 = distinct !DILexicalBlock(scope: !715, file: !189, line: 100, column: 3)
!719 = !DILocation(line: 101, column: 33, scope: !717)
!720 = !DILocation(line: 101, column: 31, scope: !717)
!721 = !DILocation(line: 102, column: 16, scope: !717)
!722 = !DILocation(line: 102, column: 31, scope: !717)
!723 = !DILocation(line: 102, column: 29, scope: !717)
!724 = !DILocation(line: 103, column: 40, scope: !717)
!725 = !DILocation(line: 106, column: 39, scope: !717)
!726 = !DILocation(line: 106, column: 16, scope: !717)
!727 = !DILocation(line: 100, column: 25, scope: !718)
!728 = !DILocation(line: 100, column: 13, scope: !718)
!729 = distinct !{!729, !714, !730, !394, !395}
!730 = !DILocation(line: 109, column: 3, scope: !715)
!731 = !DILocation(line: 112, column: 10, scope: !701)
!732 = !DILocation(line: 112, column: 3, scope: !701)
!733 = distinct !DISubprogram(name: "readfile", scope: !2, file: !2, line: 34, type: !734, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !736)
!734 = !DISubroutineType(types: !735)
!735 = !{!233, !207}
!736 = !{!737, !738, !739, !776, !779, !782}
!737 = !DILocalVariable(name: "fd", arg: 1, scope: !733, file: !2, line: 34, type: !207)
!738 = !DILocalVariable(name: "p", scope: !733, file: !2, line: 35, type: !233)
!739 = !DILocalVariable(name: "s", scope: !733, file: !2, line: 36, type: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !741, line: 44, size: 1024, elements: !742)
!741 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/struct_stat.h", directory: "")
!742 = !{!743, !745, !747, !749, !751, !753, !755, !756, !757, !759, !761, !762, !764, !772, !773, !774}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !740, file: !741, line: 46, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !238, line: 145, baseType: !248)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !740, file: !741, line: 47, baseType: !746, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !238, line: 148, baseType: !248)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !740, file: !741, line: 48, baseType: !748, size: 32, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !238, line: 150, baseType: !245)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !740, file: !741, line: 49, baseType: !750, size: 32, offset: 160)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !238, line: 151, baseType: !245)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !740, file: !741, line: 50, baseType: !752, size: 32, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !238, line: 146, baseType: !245)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !740, file: !741, line: 51, baseType: !754, size: 32, offset: 224)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !238, line: 147, baseType: !245)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !740, file: !741, line: 52, baseType: !744, size: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !740, file: !741, line: 53, baseType: !744, size: 64, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !740, file: !741, line: 54, baseType: !758, size: 64, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !238, line: 152, baseType: !260)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !740, file: !741, line: 55, baseType: !760, size: 32, offset: 448)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !238, line: 175, baseType: !207)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !740, file: !741, line: 56, baseType: !207, size: 32, offset: 480)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !740, file: !741, line: 57, baseType: !763, size: 64, offset: 512)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !238, line: 180, baseType: !260)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !740, file: !741, line: 65, baseType: !765, size: 128, offset: 576)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !766, line: 11, size: 128, elements: !767)
!766 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_timespec.h", directory: "")
!767 = !{!768, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !765, file: !766, line: 16, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !238, line: 160, baseType: !260)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !765, file: !766, line: 21, baseType: !771, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !238, line: 197, baseType: !260)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !740, file: !741, line: 66, baseType: !765, size: 128, offset: 704)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !740, file: !741, line: 67, baseType: !765, size: 128, offset: 832)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !740, file: !741, line: 79, baseType: !775, size: 64, offset: 960)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !55)
!776 = !DILocalVariable(name: "len", scope: !733, file: !2, line: 37, type: !777)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !778, line: 85, baseType: !758)
!778 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/types.h", directory: "")
!779 = !DILocalVariable(name: "bytes_read", scope: !733, file: !2, line: 38, type: !780)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !778, line: 108, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !238, line: 194, baseType: !260)
!782 = !DILocalVariable(name: "status", scope: !733, file: !2, line: 38, type: !780)
!783 = distinct !DIAssignID()
!784 = !DILocation(line: 0, scope: !733)
!785 = !DILocation(line: 36, column: 3, scope: !733)
!786 = !DILocation(line: 40, column: 3, scope: !787)
!787 = distinct !DILexicalBlock(scope: !788, file: !2, line: 40, column: 3)
!788 = distinct !DILexicalBlock(scope: !733, file: !2, line: 40, column: 3)
!789 = !DILocation(line: 41, column: 3, scope: !790)
!790 = distinct !DILexicalBlock(scope: !791, file: !2, line: 41, column: 3)
!791 = distinct !DILexicalBlock(scope: !733, file: !2, line: 41, column: 3)
!792 = !DILocation(line: 42, column: 11, scope: !733)
!793 = !DILocation(line: 43, column: 3, scope: !794)
!794 = distinct !DILexicalBlock(scope: !795, file: !2, line: 43, column: 3)
!795 = distinct !DILexicalBlock(scope: !733, file: !2, line: 43, column: 3)
!796 = !DILocation(line: 44, column: 25, scope: !733)
!797 = !DILocation(line: 44, column: 15, scope: !733)
!798 = !DILocation(line: 46, column: 3, scope: !733)
!799 = !DILocation(line: 49, column: 15, scope: !800)
!800 = distinct !DILexicalBlock(scope: !733, file: !2, line: 46, column: 27)
!801 = !DILocation(line: 46, column: 20, scope: !733)
!802 = distinct !{!802, !798, !803, !394, !395}
!803 = !DILocation(line: 50, column: 3, scope: !733)
!804 = !DILocation(line: 47, column: 24, scope: !800)
!805 = !DILocation(line: 47, column: 42, scope: !800)
!806 = !DILocation(line: 47, column: 14, scope: !800)
!807 = !DILocation(line: 48, column: 5, scope: !808)
!808 = distinct !DILexicalBlock(scope: !809, file: !2, line: 48, column: 5)
!809 = distinct !DILexicalBlock(scope: !800, file: !2, line: 48, column: 5)
!810 = !DILocation(line: 51, column: 3, scope: !733)
!811 = !DILocation(line: 51, column: 10, scope: !733)
!812 = !DILocation(line: 52, column: 3, scope: !733)
!813 = !DILocation(line: 54, column: 1, scope: !733)
!814 = !DILocation(line: 53, column: 3, scope: !733)
!815 = !DISubprogram(name: "__assert_fail", scope: !816, file: !816, line: 67, type: !817, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!816 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/assert.h", directory: "")
!817 = !DISubroutineType(types: !818)
!818 = !{null, !819, !819, !245, !819}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!820 = !DISubprogram(name: "fstat", scope: !821, file: !821, line: 210, type: !822, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!821 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/stat.h", directory: "")
!822 = !DISubroutineType(types: !823)
!823 = !{!207, !207, !824}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!825 = !DISubprogram(name: "malloc", scope: !557, file: !557, line: 672, type: !826, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!826 = !DISubroutineType(types: !827)
!827 = !{!234, !828}
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !829, line: 18, baseType: !248)
!829 = !DIFile(filename: "/opt/riscv/lib/clang/18/include/__stddef_size_t.h", directory: "")
!830 = !DISubprogram(name: "read", scope: !831, file: !831, line: 371, type: !832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!831 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/unistd.h", directory: "")
!832 = !DISubroutineType(types: !833)
!833 = !{!780, !207, !234, !828}
!834 = !DISubprogram(name: "close", scope: !831, file: !831, line: 358, type: !566, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!835 = !DILocation(line: 0, scope: !465)
!836 = !DILocation(line: 59, column: 3, scope: !837)
!837 = distinct !DILexicalBlock(scope: !838, file: !2, line: 59, column: 3)
!838 = distinct !DILexicalBlock(scope: !465, file: !2, line: 59, column: 3)
!839 = !DILocation(line: 60, column: 7, scope: !840)
!840 = distinct !DILexicalBlock(scope: !465, file: !2, line: 60, column: 6)
!841 = !DILocation(line: 60, column: 6, scope: !465)
!842 = !DILocation(line: 64, column: 17, scope: !465)
!843 = !DILocation(line: 64, column: 3, scope: !465)
!844 = !DILocation(line: 66, column: 22, scope: !477)
!845 = !DILocation(line: 66, column: 26, scope: !477)
!846 = !DILocation(line: 66, column: 32, scope: !477)
!847 = !DILocation(line: 66, column: 35, scope: !477)
!848 = !DILocation(line: 66, column: 39, scope: !477)
!849 = !DILocation(line: 66, column: 9, scope: !478)
!850 = !DILocation(line: 69, column: 6, scope: !478)
!851 = !DILocation(line: 64, column: 10, scope: !465)
!852 = !DILocation(line: 64, column: 13, scope: !465)
!853 = distinct !{!853, !843, !854, !394, !395}
!854 = !DILocation(line: 70, column: 3, scope: !465)
!855 = !DILocation(line: 71, column: 6, scope: !490)
!856 = !DILocation(line: 71, column: 8, scope: !490)
!857 = !DILocation(line: 71, column: 6, scope: !465)
!858 = !DILocation(line: 74, column: 1, scope: !465)
!859 = distinct !DISubprogram(name: "parse_string", scope: !2, file: !2, line: 77, type: !860, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !862)
!860 = !DISubroutineType(types: !861)
!861 = !{!207, !233, !233, !207}
!862 = !{!863, !864, !865, !866}
!863 = !DILocalVariable(name: "s", arg: 1, scope: !859, file: !2, line: 77, type: !233)
!864 = !DILocalVariable(name: "arr", arg: 2, scope: !859, file: !2, line: 77, type: !233)
!865 = !DILocalVariable(name: "n", arg: 3, scope: !859, file: !2, line: 77, type: !207)
!866 = !DILocalVariable(name: "k", scope: !859, file: !2, line: 78, type: !207)
!867 = !DILocation(line: 0, scope: !859)
!868 = !DILocation(line: 79, column: 3, scope: !869)
!869 = distinct !DILexicalBlock(scope: !870, file: !2, line: 79, column: 3)
!870 = distinct !DILexicalBlock(scope: !859, file: !2, line: 79, column: 3)
!871 = !DILocation(line: 81, column: 8, scope: !872)
!872 = distinct !DILexicalBlock(scope: !859, file: !2, line: 81, column: 7)
!873 = !DILocation(line: 81, column: 7, scope: !859)
!874 = !DILocation(line: 83, column: 12, scope: !875)
!875 = distinct !DILexicalBlock(scope: !872, file: !2, line: 81, column: 13)
!876 = !DILocation(line: 83, column: 5, scope: !875)
!877 = !DILocation(line: 91, column: 19, scope: !859)
!878 = !DILocation(line: 91, column: 3, scope: !859)
!879 = !DILocation(line: 92, column: 7, scope: !859)
!880 = !DILocation(line: 83, column: 16, scope: !875)
!881 = !DILocation(line: 83, column: 26, scope: !875)
!882 = !DILocation(line: 83, column: 32, scope: !875)
!883 = !DILocation(line: 83, column: 29, scope: !875)
!884 = !DILocation(line: 83, column: 35, scope: !875)
!885 = !DILocation(line: 83, column: 45, scope: !875)
!886 = !DILocation(line: 83, column: 48, scope: !875)
!887 = !DILocation(line: 83, column: 54, scope: !875)
!888 = !DILocation(line: 84, column: 9, scope: !875)
!889 = !DILocation(line: 84, column: 18, scope: !875)
!890 = !DILocation(line: 84, column: 26, scope: !875)
!891 = distinct !{!891, !876, !892, !394, !395}
!892 = !DILocation(line: 86, column: 5, scope: !875)
!893 = !DILocation(line: 93, column: 5, scope: !894)
!894 = distinct !DILexicalBlock(scope: !859, file: !2, line: 92, column: 7)
!895 = !DILocation(line: 93, column: 12, scope: !894)
!896 = !DILocation(line: 95, column: 3, scope: !859)
!897 = distinct !DISubprogram(name: "parse_uint8_t_array", scope: !2, file: !2, line: 132, type: !898, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !901)
!898 = !DISubroutineType(types: !899)
!899 = !{!207, !233, !900, !207}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DILocalVariable(name: "s", arg: 1, scope: !897, file: !2, line: 132, type: !233)
!903 = !DILocalVariable(name: "arr", arg: 2, scope: !897, file: !2, line: 132, type: !900)
!904 = !DILocalVariable(name: "n", arg: 3, scope: !897, file: !2, line: 132, type: !207)
!905 = !DILocalVariable(name: "line", scope: !897, file: !2, line: 132, type: !233)
!906 = !DILocalVariable(name: "endptr", scope: !897, file: !2, line: 132, type: !233)
!907 = !DILocalVariable(name: "i", scope: !897, file: !2, line: 132, type: !207)
!908 = !DILocalVariable(name: "v", scope: !897, file: !2, line: 132, type: !235)
!909 = distinct !DIAssignID()
!910 = !DILocation(line: 0, scope: !897)
!911 = !DILocation(line: 132, column: 1, scope: !897)
!912 = !DILocation(line: 132, column: 1, scope: !913)
!913 = distinct !DILexicalBlock(scope: !914, file: !2, line: 132, column: 1)
!914 = distinct !DILexicalBlock(scope: !897, file: !2, line: 132, column: 1)
!915 = !DILocation(line: 132, column: 1, scope: !916)
!916 = distinct !DILexicalBlock(scope: !897, file: !2, line: 132, column: 1)
!917 = !{!918, !918, i64 0}
!918 = !{!"any pointer", !361, i64 0}
!919 = distinct !DIAssignID()
!920 = !DILocation(line: 132, column: 1, scope: !921)
!921 = distinct !DILexicalBlock(scope: !916, file: !2, line: 132, column: 1)
!922 = !DILocation(line: 132, column: 1, scope: !923)
!923 = distinct !DILexicalBlock(scope: !921, file: !2, line: 132, column: 1)
!924 = distinct !{!924, !911, !911, !394, !395}
!925 = !DILocation(line: 132, column: 1, scope: !926)
!926 = distinct !DILexicalBlock(scope: !927, file: !2, line: 132, column: 1)
!927 = distinct !DILexicalBlock(scope: !897, file: !2, line: 132, column: 1)
!928 = !DISubprogram(name: "strtok", scope: !929, file: !929, line: 356, type: !930, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!929 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/string.h", directory: "")
!930 = !DISubroutineType(types: !931)
!931 = !{!233, !932, !933}
!932 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !233)
!933 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !819)
!934 = !DISubprogram(name: "strtol", scope: !557, file: !557, line: 177, type: !935, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!935 = !DISubroutineType(types: !936)
!936 = !{!260, !933, !937, !207}
!937 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!939 = !DISubprogram(name: "fprintf", scope: !940, file: !940, line: 357, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!940 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdio.h", directory: "")
!941 = !DISubroutineType(types: !942)
!942 = !{!207, !943, !933, null}
!943 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !946, line: 7, baseType: !947)
!946 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/FILE.h", directory: "")
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !948, line: 49, size: 1728, elements: !949)
!948 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_FILE.h", directory: "")
!949 = !{!950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !965, !967, !968, !969, !970, !971, !972, !976, !979, !981, !984, !987, !988, !989, !991, !992}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !947, file: !948, line: 51, baseType: !207, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !947, file: !948, line: 54, baseType: !233, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !947, file: !948, line: 55, baseType: !233, size: 64, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !947, file: !948, line: 56, baseType: !233, size: 64, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !947, file: !948, line: 57, baseType: !233, size: 64, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !947, file: !948, line: 58, baseType: !233, size: 64, offset: 320)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !947, file: !948, line: 59, baseType: !233, size: 64, offset: 384)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !947, file: !948, line: 60, baseType: !233, size: 64, offset: 448)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !947, file: !948, line: 61, baseType: !233, size: 64, offset: 512)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !947, file: !948, line: 64, baseType: !233, size: 64, offset: 576)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !947, file: !948, line: 65, baseType: !233, size: 64, offset: 640)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !947, file: !948, line: 66, baseType: !233, size: 64, offset: 704)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !947, file: !948, line: 68, baseType: !963, size: 64, offset: 768)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !948, line: 36, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !947, file: !948, line: 70, baseType: !966, size: 64, offset: 832)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !947, file: !948, line: 72, baseType: !207, size: 32, offset: 896)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !947, file: !948, line: 73, baseType: !207, size: 32, offset: 928)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !947, file: !948, line: 74, baseType: !758, size: 64, offset: 960)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !947, file: !948, line: 77, baseType: !242, size: 16, offset: 1024)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !947, file: !948, line: 78, baseType: !252, size: 8, offset: 1040)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !947, file: !948, line: 79, baseType: !973, size: 8, offset: 1048)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !974)
!974 = !{!975}
!975 = !DISubrange(count: 1)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !947, file: !948, line: 81, baseType: !977, size: 64, offset: 1088)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !948, line: 43, baseType: null)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !947, file: !948, line: 89, baseType: !980, size: 64, offset: 1152)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !238, line: 153, baseType: !260)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !947, file: !948, line: 91, baseType: !982, size: 64, offset: 1216)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !948, line: 37, flags: DIFlagFwdDecl)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !947, file: !948, line: 92, baseType: !985, size: 64, offset: 1280)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !948, line: 38, flags: DIFlagFwdDecl)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !947, file: !948, line: 93, baseType: !966, size: 64, offset: 1344)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !947, file: !948, line: 94, baseType: !234, size: 64, offset: 1408)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_prevchain", scope: !947, file: !948, line: 95, baseType: !990, size: 64, offset: 1472)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !947, file: !948, line: 96, baseType: !207, size: 32, offset: 1536)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !947, file: !948, line: 98, baseType: !993, size: 160, offset: 1568)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !16)
!994 = !DISubprogram(name: "strlen", scope: !929, file: !929, line: 407, type: !995, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!995 = !DISubroutineType(types: !996)
!996 = !{!248, !819}
!997 = distinct !DISubprogram(name: "parse_uint16_t_array", scope: !2, file: !2, line: 133, type: !998, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !1001)
!998 = !DISubroutineType(types: !999)
!999 = !{!207, !233, !1000, !207}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1008}
!1002 = !DILocalVariable(name: "s", arg: 1, scope: !997, file: !2, line: 133, type: !233)
!1003 = !DILocalVariable(name: "arr", arg: 2, scope: !997, file: !2, line: 133, type: !1000)
!1004 = !DILocalVariable(name: "n", arg: 3, scope: !997, file: !2, line: 133, type: !207)
!1005 = !DILocalVariable(name: "line", scope: !997, file: !2, line: 133, type: !233)
!1006 = !DILocalVariable(name: "endptr", scope: !997, file: !2, line: 133, type: !233)
!1007 = !DILocalVariable(name: "i", scope: !997, file: !2, line: 133, type: !207)
!1008 = !DILocalVariable(name: "v", scope: !997, file: !2, line: 133, type: !240)
!1009 = distinct !DIAssignID()
!1010 = !DILocation(line: 0, scope: !997)
!1011 = !DILocation(line: 133, column: 1, scope: !997)
!1012 = !DILocation(line: 133, column: 1, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !2, line: 133, column: 1)
!1014 = distinct !DILexicalBlock(scope: !997, file: !2, line: 133, column: 1)
!1015 = !DILocation(line: 133, column: 1, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !997, file: !2, line: 133, column: 1)
!1017 = distinct !DIAssignID()
!1018 = !DILocation(line: 133, column: 1, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1016, file: !2, line: 133, column: 1)
!1020 = !DILocation(line: 133, column: 1, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1019, file: !2, line: 133, column: 1)
!1022 = !{!1023, !1023, i64 0}
!1023 = !{!"short", !361, i64 0}
!1024 = distinct !{!1024, !1011, !1011, !394, !395}
!1025 = !DILocation(line: 133, column: 1, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 133, column: 1)
!1027 = distinct !DILexicalBlock(scope: !997, file: !2, line: 133, column: 1)
!1028 = distinct !DISubprogram(name: "parse_uint32_t_array", scope: !2, file: !2, line: 134, type: !1029, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !1032)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!207, !233, !1031, !207}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039}
!1033 = !DILocalVariable(name: "s", arg: 1, scope: !1028, file: !2, line: 134, type: !233)
!1034 = !DILocalVariable(name: "arr", arg: 2, scope: !1028, file: !2, line: 134, type: !1031)
!1035 = !DILocalVariable(name: "n", arg: 3, scope: !1028, file: !2, line: 134, type: !207)
!1036 = !DILocalVariable(name: "line", scope: !1028, file: !2, line: 134, type: !233)
!1037 = !DILocalVariable(name: "endptr", scope: !1028, file: !2, line: 134, type: !233)
!1038 = !DILocalVariable(name: "i", scope: !1028, file: !2, line: 134, type: !207)
!1039 = !DILocalVariable(name: "v", scope: !1028, file: !2, line: 134, type: !243)
!1040 = distinct !DIAssignID()
!1041 = !DILocation(line: 0, scope: !1028)
!1042 = !DILocation(line: 134, column: 1, scope: !1028)
!1043 = !DILocation(line: 134, column: 1, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !2, line: 134, column: 1)
!1045 = distinct !DILexicalBlock(scope: !1028, file: !2, line: 134, column: 1)
