; ModuleID = 'gemm/blocked/gemm_opt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "riscv64-unknown-linux-gnu"

%struct.bench_args_t = type { [4096 x double], [4096 x double], [4096 x double] }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str.1 = private unnamed_addr constant [34 x i8] c"fd>1 && \22Invalid file descriptor\22\00", align 1, !dbg !0
@.str.2 = private unnamed_addr constant [23 x i8] c"../../common/support.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.readfile = private unnamed_addr constant [20 x i8] c"char *readfile(int)\00", align 1, !dbg !12
@.str.4 = private unnamed_addr constant [51 x i8] c"0==fstat(fd, &s) && \22Couldn't determine file size\22\00", align 1, !dbg !18
@.str.6 = private unnamed_addr constant [25 x i8] c"len>0 && \22File is empty\22\00", align 1, !dbg !23
@.str.8 = private unnamed_addr constant [29 x i8] c"status>=0 && \22read() failed\22\00", align 1, !dbg !28
@.str.10 = private unnamed_addr constant [33 x i8] c"n>=0 && \22Invalid section number\22\00", align 1, !dbg !33
@__PRETTY_FUNCTION__.find_section_start = private unnamed_addr constant [38 x i8] c"char *find_section_start(char *, int)\00", align 1, !dbg !38
@.str.12 = private unnamed_addr constant [34 x i8] c"s!=NULL && \22Invalid input string\22\00", align 1, !dbg !43

!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 344, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 43)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !104, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 182, type: !99, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !99, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !99, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !118, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 328, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 41)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 7)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !123, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 240, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 30)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 6)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 90)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !40, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !65)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !171, isLocal: true, isDefinition: true)
!170 = !DIFile(filename: "../../common/harness.c", directory: "/home/kelvin/MachSuite/gemm/blocked")
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 57)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !9, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 184, elements: !10)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !170, line: 22, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 11)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !170, line: 24, type: !181, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "INPUT_SIZE", scope: !188, file: !189, line: 4, type: !203, isLocal: false, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C11, file: !189, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !190, globals: !202, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "local_support.c", directory: "/home/kelvin/MachSuite/gemm/blocked")
!190 = !{!191, !197}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bench_args_t", file: !193, line: 33, size: 786432, elements: !194)
!193 = !DIFile(filename: "./gemm.h", directory: "/home/kelvin/MachSuite/gemm/blocked")
!194 = !{!195, !200, !201}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "m1", scope: !192, file: !193, line: 34, baseType: !196, size: 262144)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 262144, elements: !198)
!197 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!198 = !{!199}
!199 = !DISubrange(count: 4096)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "m2", scope: !192, file: !193, line: 35, baseType: !196, size: 262144, offset: 262144)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "prod", scope: !192, file: !193, line: 36, baseType: !196, size: 262144, offset: 524288)
!202 = !{!186}
!203 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !151)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !124)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !170, line: 47, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 12)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !100)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !170, line: 58, type: !30, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !74)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !170, line: 67, type: !35, isLocal: true, isDefinition: true)
!225 = distinct !DICompileUnit(language: DW_LANG_C11, file: !226, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!226 = !DIFile(filename: "gemm.c", directory: "/home/kelvin/MachSuite/gemm/blocked")
!227 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !228, globals: !258, splitDebugInlining: false, nameTableKind: None)
!228 = !{!229, !4, !230, !231, !236, !239, !242, !245, !249, !252, !254, !257, !197}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !232, line: 24, baseType: !233)
!232 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-uintn.h", directory: "")
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !234, line: 38, baseType: !235)
!234 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types.h", directory: "")
!235 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !232, line: 25, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !234, line: 40, baseType: !238)
!238 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !232, line: 26, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !234, line: 42, baseType: !241)
!241 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !232, line: 27, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !234, line: 45, baseType: !244)
!244 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !246, line: 24, baseType: !247)
!246 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-intn.h", directory: "")
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !234, line: 37, baseType: !248)
!248 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !246, line: 25, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !234, line: 39, baseType: !251)
!251 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !246, line: 26, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !234, line: 41, baseType: !203)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !246, line: 27, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !234, line: 44, baseType: !256)
!256 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!257 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!258 = !{!259, !0, !7, !12, !264, !18, !266, !23, !271, !28, !273, !33, !38, !275, !43, !45, !47, !52, !57, !62, !67, !69, !71, !76, !78, !80, !82, !87, !89, !280, !92, !97, !102, !107, !112, !114, !116, !121, !126, !128, !130, !132, !134, !136, !141, !146, !148, !153, !285, !158, !163, !287, !165}
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !261, isLocal: true, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 24)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !30, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 14)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !268, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !9, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !277, isLocal: true, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 21)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !2, line: 154, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 13)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !20, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 27)
!292 = distinct !DICompileUnit(language: DW_LANG_C11, file: !170, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !293, globals: !294, splitDebugInlining: false, nameTableKind: None)
!293 = !{!230}
!294 = !{!295, !168, !174, !176, !179, !184, !297, !204, !299, !207, !210, !301, !215, !218, !306, !220, !223, !308}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !217, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !268, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !206, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 31)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !206, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !170, line: 74, type: !310, isLocal: true, isDefinition: true)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 10)
!313 = !{!"clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)"}
!314 = !{i32 7, !"Dwarf Version", i32 4}
!315 = !{i32 2, !"Debug Info Version", i32 3}
!316 = !{i32 1, !"wchar_size", i32 4}
!317 = !{i32 1, !"target-abi", !"lp64d"}
!318 = distinct !{i32 6, !"riscv-isa", !319}
!319 = distinct !{!"rv64i2p1_m2p0_a2p1_f2p2_d2p2_zicsr2p0_zifencei2p0"}
!320 = !{i32 8, !"PIC Level", i32 2}
!321 = !{i32 7, !"PIE Level", i32 2}
!322 = !{i32 7, !"uwtable", i32 2}
!323 = !{i32 8, !"SmallDataLimit", i32 8}
!324 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!325 = distinct !DISubprogram(name: "gemm", scope: !226, file: !226, line: 10, type: !326, scopeLine: 10, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !225, retainedNodes: !329)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !328, !328, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !347, !351, !355}
!330 = !DILocalVariable(name: "m1", arg: 1, scope: !325, file: !226, line: 10, type: !328)
!331 = !DILocalVariable(name: "m2", arg: 2, scope: !325, file: !226, line: 10, type: !328)
!332 = !DILocalVariable(name: "prod", arg: 3, scope: !325, file: !226, line: 10, type: !328)
!333 = !DILocalVariable(name: "i", scope: !325, file: !226, line: 11, type: !203)
!334 = !DILocalVariable(name: "k", scope: !325, file: !226, line: 11, type: !203)
!335 = !DILocalVariable(name: "j", scope: !325, file: !226, line: 11, type: !203)
!336 = !DILocalVariable(name: "jj", scope: !325, file: !226, line: 11, type: !203)
!337 = !DILocalVariable(name: "kk", scope: !325, file: !226, line: 11, type: !203)
!338 = !DILocalVariable(name: "i_row", scope: !325, file: !226, line: 12, type: !203)
!339 = !DILocalVariable(name: "k_row", scope: !325, file: !226, line: 12, type: !203)
!340 = !DILocalVariable(name: "temp_x", scope: !325, file: !226, line: 13, type: !197)
!341 = !DILocalVariable(name: "mul", scope: !325, file: !226, line: 13, type: !197)
!342 = !DILabel(scope: !325, name: "loopjj", file: !226, line: 15)
!343 = !DILabel(scope: !344, name: "loopkk", file: !226, line: 16)
!344 = distinct !DILexicalBlock(scope: !345, file: !226, line: 15, column: 57)
!345 = distinct !DILexicalBlock(scope: !346, file: !226, line: 15, column: 12)
!346 = distinct !DILexicalBlock(scope: !325, file: !226, line: 15, column: 12)
!347 = !DILabel(scope: !348, name: "loopi", file: !226, line: 17)
!348 = distinct !DILexicalBlock(scope: !349, file: !226, line: 16, column: 61)
!349 = distinct !DILexicalBlock(scope: !350, file: !226, line: 16, column: 16)
!350 = distinct !DILexicalBlock(scope: !344, file: !226, line: 16, column: 16)
!351 = !DILabel(scope: !352, name: "loopk", file: !226, line: 18)
!352 = distinct !DILexicalBlock(scope: !353, file: !226, line: 17, column: 50)
!353 = distinct !DILexicalBlock(scope: !354, file: !226, line: 17, column: 19)
!354 = distinct !DILexicalBlock(scope: !348, file: !226, line: 17, column: 19)
!355 = !DILabel(scope: !356, name: "loopj", file: !226, line: 22)
!356 = distinct !DILexicalBlock(scope: !357, file: !226, line: 18, column: 55)
!357 = distinct !DILexicalBlock(scope: !358, file: !226, line: 18, column: 23)
!358 = distinct !DILexicalBlock(scope: !352, file: !226, line: 18, column: 23)
!359 = !DILocation(line: 0, scope: !325)
!360 = !DILocation(line: 15, column: 5, scope: !325)
!361 = !DILocation(line: 15, column: 12, scope: !346)
!362 = !DILocation(line: 16, column: 16, scope: !350)
!363 = !DILocation(line: 17, column: 19, scope: !354)
!364 = !DILocation(line: 18, column: 23, scope: !358)
!365 = !DILocation(line: 20, column: 33, scope: !356)
!366 = !DILocation(line: 21, column: 43, scope: !356)
!367 = !DILocation(line: 21, column: 30, scope: !356)
!368 = !DILocation(line: 22, column: 21, scope: !356)
!369 = !DILocation(line: 22, column: 27, scope: !370)
!370 = distinct !DILexicalBlock(scope: !356, file: !226, line: 22, column: 27)
!371 = !DILocation(line: 23, column: 40, scope: !372)
!372 = distinct !DILexicalBlock(scope: !373, file: !226, line: 22, column: 59)
!373 = distinct !DILexicalBlock(scope: !370, file: !226, line: 22, column: 27)
!374 = !{!375, !375, i64 0}
!375 = !{!"double", !376, i64 0}
!376 = !{!"omnipotent char", !377, i64 0}
!377 = !{!"Simple C/C++ TBAA"}
!378 = !DILocation(line: 23, column: 38, scope: !372)
!379 = !DILocation(line: 24, column: 40, scope: !372)
!380 = !DILocation(line: 24, column: 25, scope: !372)
!381 = !DILocation(line: 24, column: 46, scope: !372)
!382 = !DILocation(line: 22, column: 55, scope: !373)
!383 = !DILocation(line: 22, column: 41, scope: !373)
!384 = distinct !{!384, !369, !385, !386, !387}
!385 = !DILocation(line: 25, column: 21, scope: !370)
!386 = !{!"llvm.loop.mustprogress"}
!387 = !{!"llvm.loop.unroll.disable"}
!388 = !DILocation(line: 18, column: 51, scope: !357)
!389 = !DILocation(line: 18, column: 37, scope: !357)
!390 = distinct !{!390, !364, !391, !386, !387}
!391 = !DILocation(line: 26, column: 17, scope: !358)
!392 = !DILocation(line: 17, column: 46, scope: !353)
!393 = !DILocation(line: 17, column: 34, scope: !353)
!394 = distinct !{!394, !363, !395, !386, !387}
!395 = !DILocation(line: 27, column: 13, scope: !354)
!396 = !DILocation(line: 16, column: 47, scope: !349)
!397 = !DILocation(line: 16, column: 32, scope: !349)
!398 = distinct !{!398, !362, !399, !386, !387}
!399 = !DILocation(line: 28, column: 9, scope: !350)
!400 = !DILocation(line: 15, column: 43, scope: !345)
!401 = !DILocation(line: 15, column: 28, scope: !345)
!402 = distinct !{!402, !361, !403, !386, !387}
!403 = !DILocation(line: 29, column: 5, scope: !346)
!404 = !DILocation(line: 30, column: 1, scope: !325)
!405 = distinct !DISubprogram(name: "run_benchmark", scope: !189, file: !189, line: 8, type: !406, scopeLine: 8, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !408)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !230}
!408 = !{!409, !410}
!409 = !DILocalVariable(name: "vargs", arg: 1, scope: !405, file: !189, line: 8, type: !230)
!410 = !DILocalVariable(name: "args", scope: !405, file: !189, line: 9, type: !191)
!411 = !DILocation(line: 0, scope: !405)
!412 = !DILocation(line: 10, column: 25, scope: !405)
!413 = !DILocation(line: 10, column: 35, scope: !405)
!414 = !DILocation(line: 0, scope: !325, inlinedAt: !415)
!415 = distinct !DILocation(line: 10, column: 3, scope: !405)
!416 = !DILocation(line: 15, column: 5, scope: !325, inlinedAt: !415)
!417 = !DILocation(line: 15, column: 12, scope: !346, inlinedAt: !415)
!418 = !DILocation(line: 16, column: 16, scope: !350, inlinedAt: !415)
!419 = !DILocation(line: 17, column: 19, scope: !354, inlinedAt: !415)
!420 = !DILocation(line: 18, column: 23, scope: !358, inlinedAt: !415)
!421 = !DILocation(line: 20, column: 33, scope: !356, inlinedAt: !415)
!422 = !DILocation(line: 21, column: 43, scope: !356, inlinedAt: !415)
!423 = !DILocation(line: 21, column: 30, scope: !356, inlinedAt: !415)
!424 = !DILocation(line: 22, column: 21, scope: !356, inlinedAt: !415)
!425 = !DILocation(line: 22, column: 27, scope: !370, inlinedAt: !415)
!426 = !DILocation(line: 23, column: 40, scope: !372, inlinedAt: !415)
!427 = !DILocation(line: 23, column: 38, scope: !372, inlinedAt: !415)
!428 = !DILocation(line: 24, column: 40, scope: !372, inlinedAt: !415)
!429 = !DILocation(line: 24, column: 25, scope: !372, inlinedAt: !415)
!430 = !DILocation(line: 24, column: 46, scope: !372, inlinedAt: !415)
!431 = !DILocation(line: 22, column: 55, scope: !373, inlinedAt: !415)
!432 = !DILocation(line: 22, column: 41, scope: !373, inlinedAt: !415)
!433 = distinct !{!433, !425, !434, !386, !387}
!434 = !DILocation(line: 25, column: 21, scope: !370, inlinedAt: !415)
!435 = !DILocation(line: 18, column: 51, scope: !357, inlinedAt: !415)
!436 = !DILocation(line: 18, column: 37, scope: !357, inlinedAt: !415)
!437 = distinct !{!437, !420, !438, !386, !387}
!438 = !DILocation(line: 26, column: 17, scope: !358, inlinedAt: !415)
!439 = !DILocation(line: 17, column: 46, scope: !353, inlinedAt: !415)
!440 = !DILocation(line: 17, column: 34, scope: !353, inlinedAt: !415)
!441 = distinct !{!441, !419, !442, !386, !387}
!442 = !DILocation(line: 27, column: 13, scope: !354, inlinedAt: !415)
!443 = !DILocation(line: 16, column: 47, scope: !349, inlinedAt: !415)
!444 = !DILocation(line: 16, column: 32, scope: !349, inlinedAt: !415)
!445 = distinct !{!445, !418, !446, !386, !387}
!446 = !DILocation(line: 28, column: 9, scope: !350, inlinedAt: !415)
!447 = !DILocation(line: 15, column: 43, scope: !345, inlinedAt: !415)
!448 = !DILocation(line: 15, column: 28, scope: !345, inlinedAt: !415)
!449 = distinct !{!449, !417, !450, !386, !387}
!450 = !DILocation(line: 29, column: 5, scope: !346, inlinedAt: !415)
!451 = !DILocation(line: 11, column: 1, scope: !405)
!452 = distinct !DISubprogram(name: "input_to_data", scope: !189, file: !189, line: 20, type: !453, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !455)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !203, !230}
!455 = !{!456, !457, !458, !459, !460}
!456 = !DILocalVariable(name: "fd", arg: 1, scope: !452, file: !189, line: 20, type: !203)
!457 = !DILocalVariable(name: "vdata", arg: 2, scope: !452, file: !189, line: 20, type: !230)
!458 = !DILocalVariable(name: "data", scope: !452, file: !189, line: 21, type: !191)
!459 = !DILocalVariable(name: "p", scope: !452, file: !189, line: 22, type: !229)
!460 = !DILocalVariable(name: "s", scope: !452, file: !189, line: 22, type: !229)
!461 = !DILocation(line: 0, scope: !452)
!462 = !DILocation(line: 24, column: 3, scope: !452)
!463 = !DILocation(line: 26, column: 7, scope: !452)
!464 = !DILocalVariable(name: "s", arg: 1, scope: !465, file: !2, line: 56, type: !229)
!465 = distinct !DISubprogram(name: "find_section_start", scope: !2, file: !2, line: 56, type: !466, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !227, retainedNodes: !468)
!466 = !DISubroutineType(types: !467)
!467 = !{!229, !229, !203}
!468 = !{!464, !469, !470}
!469 = !DILocalVariable(name: "n", arg: 2, scope: !465, file: !2, line: 56, type: !203)
!470 = !DILocalVariable(name: "i", scope: !465, file: !2, line: 57, type: !203)
!471 = !DILocation(line: 0, scope: !465, inlinedAt: !472)
!472 = distinct !DILocation(line: 28, column: 7, scope: !452)
!473 = !DILocation(line: 64, column: 17, scope: !465, inlinedAt: !472)
!474 = !{!376, !376, i64 0}
!475 = !DILocation(line: 64, column: 3, scope: !465, inlinedAt: !472)
!476 = !DILocation(line: 66, column: 22, scope: !477, inlinedAt: !472)
!477 = distinct !DILexicalBlock(scope: !478, file: !2, line: 66, column: 9)
!478 = distinct !DILexicalBlock(scope: !465, file: !2, line: 64, column: 31)
!479 = !DILocation(line: 66, column: 26, scope: !477, inlinedAt: !472)
!480 = !DILocation(line: 66, column: 32, scope: !477, inlinedAt: !472)
!481 = !DILocation(line: 66, column: 35, scope: !477, inlinedAt: !472)
!482 = !DILocation(line: 66, column: 39, scope: !477, inlinedAt: !472)
!483 = !DILocation(line: 66, column: 9, scope: !478, inlinedAt: !472)
!484 = !DILocation(line: 69, column: 6, scope: !478, inlinedAt: !472)
!485 = !DILocation(line: 64, column: 10, scope: !465, inlinedAt: !472)
!486 = !DILocation(line: 64, column: 13, scope: !465, inlinedAt: !472)
!487 = distinct !{!487, !475, !488, !386, !387}
!488 = !DILocation(line: 70, column: 3, scope: !465, inlinedAt: !472)
!489 = !DILocation(line: 71, column: 6, scope: !490, inlinedAt: !472)
!490 = distinct !DILexicalBlock(scope: !465, file: !2, line: 71, column: 6)
!491 = !DILocation(line: 71, column: 8, scope: !490, inlinedAt: !472)
!492 = !DILocation(line: 71, column: 6, scope: !465, inlinedAt: !472)
!493 = !DILocation(line: 29, column: 3, scope: !452)
!494 = !DILocation(line: 0, scope: !465, inlinedAt: !495)
!495 = distinct !DILocation(line: 31, column: 7, scope: !452)
!496 = !DILocation(line: 64, column: 17, scope: !465, inlinedAt: !495)
!497 = !DILocation(line: 64, column: 3, scope: !465, inlinedAt: !495)
!498 = !DILocation(line: 66, column: 22, scope: !477, inlinedAt: !495)
!499 = !DILocation(line: 66, column: 26, scope: !477, inlinedAt: !495)
!500 = !DILocation(line: 66, column: 32, scope: !477, inlinedAt: !495)
!501 = !DILocation(line: 66, column: 35, scope: !477, inlinedAt: !495)
!502 = !DILocation(line: 66, column: 39, scope: !477, inlinedAt: !495)
!503 = !DILocation(line: 66, column: 9, scope: !478, inlinedAt: !495)
!504 = !DILocation(line: 69, column: 6, scope: !478, inlinedAt: !495)
!505 = !DILocation(line: 64, column: 10, scope: !465, inlinedAt: !495)
!506 = !DILocation(line: 64, column: 13, scope: !465, inlinedAt: !495)
!507 = distinct !{!507, !497, !508, !386, !387}
!508 = !DILocation(line: 70, column: 3, scope: !465, inlinedAt: !495)
!509 = !DILocation(line: 71, column: 6, scope: !490, inlinedAt: !495)
!510 = !DILocation(line: 71, column: 8, scope: !490, inlinedAt: !495)
!511 = !DILocation(line: 71, column: 6, scope: !465, inlinedAt: !495)
!512 = !DILocation(line: 32, column: 37, scope: !452)
!513 = !DILocation(line: 32, column: 3, scope: !452)
!514 = !DILocation(line: 33, column: 3, scope: !452)
!515 = !DILocation(line: 34, column: 1, scope: !452)
!516 = !DISubprogram(name: "free", scope: !517, file: !517, line: 687, type: !406, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!517 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdlib.h", directory: "")
!518 = distinct !DISubprogram(name: "data_to_input", scope: !189, file: !189, line: 36, type: !453, scopeLine: 36, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !519)
!519 = !{!520, !521, !522}
!520 = !DILocalVariable(name: "fd", arg: 1, scope: !518, file: !189, line: 36, type: !203)
!521 = !DILocalVariable(name: "vdata", arg: 2, scope: !518, file: !189, line: 36, type: !230)
!522 = !DILocalVariable(name: "data", scope: !518, file: !189, line: 37, type: !191)
!523 = !DILocation(line: 0, scope: !518)
!524 = !DILocalVariable(name: "fd", arg: 1, scope: !525, file: !2, line: 189, type: !203)
!525 = distinct !DISubprogram(name: "write_section_header", scope: !2, file: !2, line: 189, type: !526, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !227, retainedNodes: !528)
!526 = !DISubroutineType(types: !527)
!527 = !{!203, !203}
!528 = !{!524}
!529 = !DILocation(line: 0, scope: !525, inlinedAt: !530)
!530 = distinct !DILocation(line: 39, column: 3, scope: !518)
!531 = !DILocation(line: 190, column: 3, scope: !532, inlinedAt: !530)
!532 = distinct !DILexicalBlock(scope: !533, file: !2, line: 190, column: 3)
!533 = distinct !DILexicalBlock(scope: !525, file: !2, line: 190, column: 3)
!534 = !DILocation(line: 191, column: 3, scope: !525, inlinedAt: !530)
!535 = !DILocalVariable(name: "fd", arg: 1, scope: !536, file: !2, line: 187, type: !203)
!536 = distinct !DISubprogram(name: "write_double_array", scope: !2, file: !2, line: 187, type: !537, scopeLine: 187, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !227, retainedNodes: !539)
!537 = !DISubroutineType(types: !538)
!538 = !{!203, !203, !328, !203}
!539 = !{!535, !540, !541, !542}
!540 = !DILocalVariable(name: "arr", arg: 2, scope: !536, file: !2, line: 187, type: !328)
!541 = !DILocalVariable(name: "n", arg: 3, scope: !536, file: !2, line: 187, type: !203)
!542 = !DILocalVariable(name: "i", scope: !536, file: !2, line: 187, type: !203)
!543 = !DILocation(line: 0, scope: !536, inlinedAt: !544)
!544 = distinct !DILocation(line: 40, column: 3, scope: !518)
!545 = !DILocation(line: 187, column: 1, scope: !546, inlinedAt: !544)
!546 = distinct !DILexicalBlock(scope: !536, file: !2, line: 187, column: 1)
!547 = !DILocation(line: 187, column: 1, scope: !548, inlinedAt: !544)
!548 = distinct !DILexicalBlock(scope: !549, file: !2, line: 187, column: 1)
!549 = distinct !DILexicalBlock(scope: !546, file: !2, line: 187, column: 1)
!550 = !DILocation(line: 187, column: 1, scope: !549, inlinedAt: !544)
!551 = distinct !{!551, !545, !545, !386, !387}
!552 = !DILocation(line: 0, scope: !525, inlinedAt: !553)
!553 = distinct !DILocation(line: 42, column: 3, scope: !518)
!554 = !DILocation(line: 191, column: 3, scope: !525, inlinedAt: !553)
!555 = !DILocation(line: 43, column: 38, scope: !518)
!556 = !DILocation(line: 0, scope: !536, inlinedAt: !557)
!557 = distinct !DILocation(line: 43, column: 3, scope: !518)
!558 = !DILocation(line: 187, column: 1, scope: !546, inlinedAt: !557)
!559 = !DILocation(line: 187, column: 1, scope: !548, inlinedAt: !557)
!560 = !DILocation(line: 187, column: 1, scope: !549, inlinedAt: !557)
!561 = distinct !{!561, !558, !558, !386, !387}
!562 = !DILocation(line: 44, column: 1, scope: !518)
!563 = distinct !DISubprogram(name: "output_to_data", scope: !189, file: !189, line: 51, type: !453, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !564)
!564 = !{!565, !566, !567, !568, !569}
!565 = !DILocalVariable(name: "fd", arg: 1, scope: !563, file: !189, line: 51, type: !203)
!566 = !DILocalVariable(name: "vdata", arg: 2, scope: !563, file: !189, line: 51, type: !230)
!567 = !DILocalVariable(name: "data", scope: !563, file: !189, line: 52, type: !191)
!568 = !DILocalVariable(name: "p", scope: !563, file: !189, line: 53, type: !229)
!569 = !DILocalVariable(name: "s", scope: !563, file: !189, line: 53, type: !229)
!570 = !DILocation(line: 0, scope: !563)
!571 = !DILocation(line: 55, column: 7, scope: !563)
!572 = !DILocation(line: 0, scope: !465, inlinedAt: !573)
!573 = distinct !DILocation(line: 57, column: 7, scope: !563)
!574 = !DILocation(line: 64, column: 17, scope: !465, inlinedAt: !573)
!575 = !DILocation(line: 64, column: 3, scope: !465, inlinedAt: !573)
!576 = !DILocation(line: 66, column: 22, scope: !477, inlinedAt: !573)
!577 = !DILocation(line: 66, column: 26, scope: !477, inlinedAt: !573)
!578 = !DILocation(line: 66, column: 32, scope: !477, inlinedAt: !573)
!579 = !DILocation(line: 66, column: 35, scope: !477, inlinedAt: !573)
!580 = !DILocation(line: 66, column: 39, scope: !477, inlinedAt: !573)
!581 = !DILocation(line: 66, column: 9, scope: !478, inlinedAt: !573)
!582 = !DILocation(line: 69, column: 6, scope: !478, inlinedAt: !573)
!583 = !DILocation(line: 64, column: 10, scope: !465, inlinedAt: !573)
!584 = !DILocation(line: 64, column: 13, scope: !465, inlinedAt: !573)
!585 = distinct !{!585, !575, !586, !386, !387}
!586 = !DILocation(line: 70, column: 3, scope: !465, inlinedAt: !573)
!587 = !DILocation(line: 71, column: 6, scope: !490, inlinedAt: !573)
!588 = !DILocation(line: 71, column: 8, scope: !490, inlinedAt: !573)
!589 = !DILocation(line: 71, column: 6, scope: !465, inlinedAt: !573)
!590 = !DILocation(line: 58, column: 37, scope: !563)
!591 = !DILocation(line: 58, column: 3, scope: !563)
!592 = !DILocation(line: 59, column: 3, scope: !563)
!593 = !DILocation(line: 60, column: 1, scope: !563)
!594 = distinct !DISubprogram(name: "data_to_output", scope: !189, file: !189, line: 62, type: !453, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !595)
!595 = !{!596, !597, !598}
!596 = !DILocalVariable(name: "fd", arg: 1, scope: !594, file: !189, line: 62, type: !203)
!597 = !DILocalVariable(name: "vdata", arg: 2, scope: !594, file: !189, line: 62, type: !230)
!598 = !DILocalVariable(name: "data", scope: !594, file: !189, line: 63, type: !191)
!599 = !DILocation(line: 0, scope: !594)
!600 = !DILocation(line: 0, scope: !525, inlinedAt: !601)
!601 = distinct !DILocation(line: 65, column: 3, scope: !594)
!602 = !DILocation(line: 190, column: 3, scope: !532, inlinedAt: !601)
!603 = !DILocation(line: 191, column: 3, scope: !525, inlinedAt: !601)
!604 = !DILocation(line: 66, column: 38, scope: !594)
!605 = !DILocation(line: 0, scope: !536, inlinedAt: !606)
!606 = distinct !DILocation(line: 66, column: 3, scope: !594)
!607 = !DILocation(line: 187, column: 1, scope: !546, inlinedAt: !606)
!608 = !DILocation(line: 187, column: 1, scope: !548, inlinedAt: !606)
!609 = !DILocation(line: 187, column: 1, scope: !549, inlinedAt: !606)
!610 = distinct !{!610, !607, !607, !386, !387}
!611 = !DILocation(line: 67, column: 1, scope: !594)
!612 = distinct !DISubprogram(name: "check_data", scope: !189, file: !189, line: 69, type: !613, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !615)
!613 = !DISubroutineType(types: !614)
!614 = !{!203, !230, !230}
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623}
!616 = !DILocalVariable(name: "vdata", arg: 1, scope: !612, file: !189, line: 69, type: !230)
!617 = !DILocalVariable(name: "vref", arg: 2, scope: !612, file: !189, line: 69, type: !230)
!618 = !DILocalVariable(name: "data", scope: !612, file: !189, line: 70, type: !191)
!619 = !DILocalVariable(name: "ref", scope: !612, file: !189, line: 71, type: !191)
!620 = !DILocalVariable(name: "has_errors", scope: !612, file: !189, line: 72, type: !203)
!621 = !DILocalVariable(name: "r", scope: !612, file: !189, line: 73, type: !203)
!622 = !DILocalVariable(name: "c", scope: !612, file: !189, line: 73, type: !203)
!623 = !DILocalVariable(name: "diff", scope: !612, file: !189, line: 74, type: !197)
!624 = !DILocation(line: 0, scope: !612)
!625 = !DILocation(line: 76, column: 3, scope: !626)
!626 = distinct !DILexicalBlock(scope: !612, file: !189, line: 76, column: 3)
!627 = !DILocation(line: 77, column: 5, scope: !628)
!628 = distinct !DILexicalBlock(scope: !629, file: !189, line: 77, column: 5)
!629 = distinct !DILexicalBlock(scope: !630, file: !189, line: 76, column: 31)
!630 = distinct !DILexicalBlock(scope: !626, file: !189, line: 76, column: 3)
!631 = !DILocation(line: 78, column: 36, scope: !632)
!632 = distinct !DILexicalBlock(scope: !633, file: !189, line: 77, column: 33)
!633 = distinct !DILexicalBlock(scope: !628, file: !189, line: 77, column: 5)
!634 = !DILocation(line: 78, column: 14, scope: !632)
!635 = !DILocation(line: 78, column: 43, scope: !632)
!636 = !DILocation(line: 78, column: 41, scope: !632)
!637 = !DILocation(line: 79, column: 37, scope: !632)
!638 = !DILocation(line: 79, column: 18, scope: !632)
!639 = !DILocation(line: 77, column: 28, scope: !633)
!640 = !DILocation(line: 77, column: 16, scope: !633)
!641 = distinct !{!641, !627, !642, !386, !387}
!642 = !DILocation(line: 80, column: 5, scope: !628)
!643 = !DILocation(line: 76, column: 26, scope: !630)
!644 = !DILocation(line: 76, column: 14, scope: !630)
!645 = distinct !{!645, !625, !646, !386, !387}
!646 = !DILocation(line: 81, column: 3, scope: !626)
!647 = !DILocation(line: 84, column: 10, scope: !612)
!648 = !DILocation(line: 84, column: 3, scope: !612)
!649 = distinct !DISubprogram(name: "readfile", scope: !2, file: !2, line: 34, type: !650, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !227, retainedNodes: !652)
!650 = !DISubroutineType(types: !651)
!651 = !{!229, !203}
!652 = !{!653, !654, !655, !692, !695, !698}
!653 = !DILocalVariable(name: "fd", arg: 1, scope: !649, file: !2, line: 34, type: !203)
!654 = !DILocalVariable(name: "p", scope: !649, file: !2, line: 35, type: !229)
!655 = !DILocalVariable(name: "s", scope: !649, file: !2, line: 36, type: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !657, line: 44, size: 1024, elements: !658)
!657 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/struct_stat.h", directory: "")
!658 = !{!659, !661, !663, !665, !667, !669, !671, !672, !673, !675, !677, !678, !680, !688, !689, !690}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !656, file: !657, line: 46, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !234, line: 145, baseType: !244)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !656, file: !657, line: 47, baseType: !662, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !234, line: 148, baseType: !244)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !656, file: !657, line: 48, baseType: !664, size: 32, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !234, line: 150, baseType: !241)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !656, file: !657, line: 49, baseType: !666, size: 32, offset: 160)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !234, line: 151, baseType: !241)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !656, file: !657, line: 50, baseType: !668, size: 32, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !234, line: 146, baseType: !241)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !656, file: !657, line: 51, baseType: !670, size: 32, offset: 224)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !234, line: 147, baseType: !241)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !656, file: !657, line: 52, baseType: !660, size: 64, offset: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !656, file: !657, line: 53, baseType: !660, size: 64, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !656, file: !657, line: 54, baseType: !674, size: 64, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !234, line: 152, baseType: !256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !656, file: !657, line: 55, baseType: !676, size: 32, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !234, line: 175, baseType: !203)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !656, file: !657, line: 56, baseType: !203, size: 32, offset: 480)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !656, file: !657, line: 57, baseType: !679, size: 64, offset: 512)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !234, line: 180, baseType: !256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !656, file: !657, line: 65, baseType: !681, size: 128, offset: 576)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !682, line: 11, size: 128, elements: !683)
!682 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_timespec.h", directory: "")
!683 = !{!684, !686}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !681, file: !682, line: 16, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !234, line: 160, baseType: !256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !681, file: !682, line: 21, baseType: !687, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !234, line: 197, baseType: !256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !656, file: !657, line: 66, baseType: !681, size: 128, offset: 704)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !656, file: !657, line: 67, baseType: !681, size: 128, offset: 832)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !656, file: !657, line: 79, baseType: !691, size: 64, offset: 960)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 64, elements: !55)
!692 = !DILocalVariable(name: "len", scope: !649, file: !2, line: 37, type: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !694, line: 85, baseType: !674)
!694 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/types.h", directory: "")
!695 = !DILocalVariable(name: "bytes_read", scope: !649, file: !2, line: 38, type: !696)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !694, line: 108, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !234, line: 194, baseType: !256)
!698 = !DILocalVariable(name: "status", scope: !649, file: !2, line: 38, type: !696)
!699 = distinct !DIAssignID()
!700 = !DILocation(line: 0, scope: !649)
!701 = !DILocation(line: 36, column: 3, scope: !649)
!702 = !DILocation(line: 40, column: 3, scope: !703)
!703 = distinct !DILexicalBlock(scope: !704, file: !2, line: 40, column: 3)
!704 = distinct !DILexicalBlock(scope: !649, file: !2, line: 40, column: 3)
!705 = !DILocation(line: 41, column: 3, scope: !706)
!706 = distinct !DILexicalBlock(scope: !707, file: !2, line: 41, column: 3)
!707 = distinct !DILexicalBlock(scope: !649, file: !2, line: 41, column: 3)
!708 = !DILocation(line: 42, column: 11, scope: !649)
!709 = !DILocation(line: 43, column: 3, scope: !710)
!710 = distinct !DILexicalBlock(scope: !711, file: !2, line: 43, column: 3)
!711 = distinct !DILexicalBlock(scope: !649, file: !2, line: 43, column: 3)
!712 = !DILocation(line: 44, column: 25, scope: !649)
!713 = !DILocation(line: 44, column: 15, scope: !649)
!714 = !DILocation(line: 46, column: 3, scope: !649)
!715 = !DILocation(line: 49, column: 15, scope: !716)
!716 = distinct !DILexicalBlock(scope: !649, file: !2, line: 46, column: 27)
!717 = !DILocation(line: 46, column: 20, scope: !649)
!718 = distinct !{!718, !714, !719, !386, !387}
!719 = !DILocation(line: 50, column: 3, scope: !649)
!720 = !DILocation(line: 47, column: 24, scope: !716)
!721 = !DILocation(line: 47, column: 42, scope: !716)
!722 = !DILocation(line: 47, column: 14, scope: !716)
!723 = !DILocation(line: 48, column: 5, scope: !724)
!724 = distinct !DILexicalBlock(scope: !725, file: !2, line: 48, column: 5)
!725 = distinct !DILexicalBlock(scope: !716, file: !2, line: 48, column: 5)
!726 = !DILocation(line: 51, column: 3, scope: !649)
!727 = !DILocation(line: 51, column: 10, scope: !649)
!728 = !DILocation(line: 52, column: 3, scope: !649)
!729 = !DILocation(line: 54, column: 1, scope: !649)
!730 = !DILocation(line: 53, column: 3, scope: !649)
!731 = !DISubprogram(name: "__assert_fail", scope: !732, file: !732, line: 67, type: !733, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!732 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/assert.h", directory: "")
!733 = !DISubroutineType(types: !734)
!734 = !{null, !735, !735, !241, !735}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!736 = !DISubprogram(name: "fstat", scope: !737, file: !737, line: 210, type: !738, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!737 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/stat.h", directory: "")
!738 = !DISubroutineType(types: !739)
!739 = !{!203, !203, !740}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!741 = !DISubprogram(name: "malloc", scope: !517, file: !517, line: 672, type: !742, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!742 = !DISubroutineType(types: !743)
!743 = !{!230, !744}
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !745, line: 18, baseType: !244)
!745 = !DIFile(filename: "/opt/riscv/lib/clang/18/include/__stddef_size_t.h", directory: "")
!746 = !DISubprogram(name: "read", scope: !747, file: !747, line: 371, type: !748, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!747 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/unistd.h", directory: "")
!748 = !DISubroutineType(types: !749)
!749 = !{!696, !203, !230, !744}
!750 = !DISubprogram(name: "close", scope: !747, file: !747, line: 358, type: !526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!751 = !DILocation(line: 0, scope: !465)
!752 = !DILocation(line: 59, column: 3, scope: !753)
!753 = distinct !DILexicalBlock(scope: !754, file: !2, line: 59, column: 3)
!754 = distinct !DILexicalBlock(scope: !465, file: !2, line: 59, column: 3)
!755 = !DILocation(line: 60, column: 7, scope: !756)
!756 = distinct !DILexicalBlock(scope: !465, file: !2, line: 60, column: 6)
!757 = !DILocation(line: 60, column: 6, scope: !465)
!758 = !DILocation(line: 64, column: 17, scope: !465)
!759 = !DILocation(line: 64, column: 3, scope: !465)
!760 = !DILocation(line: 66, column: 22, scope: !477)
!761 = !DILocation(line: 66, column: 26, scope: !477)
!762 = !DILocation(line: 66, column: 32, scope: !477)
!763 = !DILocation(line: 66, column: 35, scope: !477)
!764 = !DILocation(line: 66, column: 39, scope: !477)
!765 = !DILocation(line: 66, column: 9, scope: !478)
!766 = !DILocation(line: 69, column: 6, scope: !478)
!767 = !DILocation(line: 64, column: 10, scope: !465)
!768 = !DILocation(line: 64, column: 13, scope: !465)
!769 = distinct !{!769, !759, !770, !386, !387}
!770 = !DILocation(line: 70, column: 3, scope: !465)
!771 = !DILocation(line: 71, column: 6, scope: !490)
!772 = !DILocation(line: 71, column: 8, scope: !490)
!773 = !DILocation(line: 71, column: 6, scope: !465)
!774 = !DILocation(line: 74, column: 1, scope: !465)
!775 = distinct !DISubprogram(name: "parse_string", scope: !2, file: !2, line: 77, type: !776, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !227, retainedNodes: !778)
!776 = !DISubroutineType(types: !777)
!777 = !{!203, !229, !229, !203}
!778 = !{!779, !780, !781, !782}
!779 = !DILocalVariable(name: "s", arg: 1, scope: !775, file: !2, line: 77, type: !229)
!780 = !DILocalVariable(name: "arr", arg: 2, scope: !775, file: !2, line: 77, type: !229)
!781 = !DILocalVariable(name: "n", arg: 3, scope: !775, file: !2, line: 77, type: !203)
!782 = !DILocalVariable(name: "k", scope: !775, file: !2, line: 78, type: !203)
!783 = !DILocation(line: 0, scope: !775)
!784 = !DILocation(line: 79, column: 3, scope: !785)
!785 = distinct !DILexicalBlock(scope: !786, file: !2, line: 79, column: 3)
!786 = distinct !DILexicalBlock(scope: !775, file: !2, line: 79, column: 3)
!787 = !DILocation(line: 81, column: 8, scope: !788)
!788 = distinct !DILexicalBlock(scope: !775, file: !2, line: 81, column: 7)
!789 = !DILocation(line: 81, column: 7, scope: !775)
!790 = !DILocation(line: 83, column: 12, scope: !791)
!791 = distinct !DILexicalBlock(scope: !788, file: !2, line: 81, column: 13)
!792 = !DILocation(line: 83, column: 5, scope: !791)
!793 = !DILocation(line: 91, column: 19, scope: !775)
!794 = !DILocation(line: 91, column: 3, scope: !775)
!795 = !DILocation(line: 92, column: 7, scope: !775)
!796 = !DILocation(line: 83, column: 16, scope: !791)
!797 = !DILocation(line: 83, column: 26, scope: !791)
!798 = !DILocation(line: 83, column: 32, scope: !791)
!799 = !DILocation(line: 83, column: 29, scope: !791)
!800 = !DILocation(line: 83, column: 35, scope: !791)
!801 = !DILocation(line: 83, column: 45, scope: !791)
!802 = !DILocation(line: 83, column: 48, scope: !791)
!803 = !DILocation(line: 83, column: 54, scope: !791)
!804 = !DILocation(line: 84, column: 9, scope: !791)
!805 = !DILocation(line: 84, column: 18, scope: !791)
!806 = !DILocation(line: 84, column: 26, scope: !791)
!807 = distinct !{!807, !792, !808, !386, !387}
!808 = !DILocation(line: 86, column: 5, scope: !791)
!809 = !DILocation(line: 93, column: 5, scope: !810)
!810 = distinct !DILexicalBlock(scope: !775, file: !2, line: 92, column: 7)
!811 = !DILocation(line: 93, column: 12, scope: !810)
!812 = !DILocation(line: 95, column: 3, scope: !775)
!813 = distinct !DISubprogram(name: "parse_uint8_t_array", scope: !2, file: !2, line: 132, type: !814, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !227, retainedNodes: !817)
!814 = !DISubroutineType(types: !815)
!815 = !{!203, !229, !816, !203}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!817 = !{!818, !819, !820, !821, !822, !823, !824}
!818 = !DILocalVariable(name: "s", arg: 1, scope: !813, file: !2, line: 132, type: !229)
!819 = !DILocalVariable(name: "arr", arg: 2, scope: !813, file: !2, line: 132, type: !816)
!820 = !DILocalVariable(name: "n", arg: 3, scope: !813, file: !2, line: 132, type: !203)
!821 = !DILocalVariable(name: "line", scope: !813, file: !2, line: 132, type: !229)
!822 = !DILocalVariable(name: "endptr", scope: !813, file: !2, line: 132, type: !229)
!823 = !DILocalVariable(name: "i", scope: !813, file: !2, line: 132, type: !203)
!824 = !DILocalVariable(name: "v", scope: !813, file: !2, line: 132, type: !231)
!825 = distinct !DIAssignID()
!826 = !DILocation(line: 0, scope: !813)
!827 = !DILocation(line: 132, column: 1, scope: !813)
!828 = !DILocation(line: 132, column: 1, scope: !829)
!829 = distinct !DILexicalBlock(scope: !830, file: !2, line: 132, column: 1)
!830 = distinct !DILexicalBlock(scope: !813, file: !2, line: 132, column: 1)
!831 = !DILocation(line: 132, column: 1, scope: !832)
!832 = distinct !DILexicalBlock(scope: !813, file: !2, line: 132, column: 1)
!833 = !{!834, !834, i64 0}
!834 = !{!"any pointer", !376, i64 0}
!835 = distinct !DIAssignID()
!836 = !DILocation(line: 132, column: 1, scope: !837)
!837 = distinct !DILexicalBlock(scope: !832, file: !2, line: 132, column: 1)
!838 = !DILocation(line: 132, column: 1, scope: !839)
!839 = distinct !DILexicalBlock(scope: !837, file: !2, line: 132, column: 1)
!840 = distinct !{!840, !827, !827, !386, !387}
!841 = !DILocation(line: 132, column: 1, scope: !842)
!842 = distinct !DILexicalBlock(scope: !843, file: !2, line: 132, column: 1)
!843 = distinct !DILexicalBlock(scope: !813, file: !2, line: 132, column: 1)
!844 = !DISubprogram(name: "strtok", scope: !845, file: !845, line: 356, type: !846, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!845 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/string.h", directory: "")
!846 = !DISubroutineType(types: !847)
!847 = !{!229, !848, !849}
!848 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !229)
!849 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !735)
!850 = !DISubprogram(name: "strtol", scope: !517, file: !517, line: 177, type: !851, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!851 = !DISubroutineType(types: !852)
!852 = !{!256, !849, !853, !203}
!853 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!855 = !DISubprogram(name: "fprintf", scope: !856, file: !856, line: 357, type: !857, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!856 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdio.h", directory: "")
!857 = !DISubroutineType(types: !858)
!858 = !{!203, !859, !849, null}
!859 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !862, line: 7, baseType: !863)
!862 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/FILE.h", directory: "")
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !864, line: 49, size: 1728, elements: !865)
!864 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_FILE.h", directory: "")
!865 = !{!866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !881, !883, !884, !885, !886, !887, !888, !892, !895, !897, !900, !903, !904, !905, !907, !908}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !863, file: !864, line: 51, baseType: !203, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !863, file: !864, line: 54, baseType: !229, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !863, file: !864, line: 55, baseType: !229, size: 64, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !863, file: !864, line: 56, baseType: !229, size: 64, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !863, file: !864, line: 57, baseType: !229, size: 64, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !863, file: !864, line: 58, baseType: !229, size: 64, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !863, file: !864, line: 59, baseType: !229, size: 64, offset: 384)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !863, file: !864, line: 60, baseType: !229, size: 64, offset: 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !863, file: !864, line: 61, baseType: !229, size: 64, offset: 512)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !863, file: !864, line: 64, baseType: !229, size: 64, offset: 576)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !863, file: !864, line: 65, baseType: !229, size: 64, offset: 640)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !863, file: !864, line: 66, baseType: !229, size: 64, offset: 704)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !863, file: !864, line: 68, baseType: !879, size: 64, offset: 768)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !864, line: 36, flags: DIFlagFwdDecl)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !863, file: !864, line: 70, baseType: !882, size: 64, offset: 832)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !863, file: !864, line: 72, baseType: !203, size: 32, offset: 896)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !863, file: !864, line: 73, baseType: !203, size: 32, offset: 928)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !863, file: !864, line: 74, baseType: !674, size: 64, offset: 960)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !863, file: !864, line: 77, baseType: !238, size: 16, offset: 1024)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !863, file: !864, line: 78, baseType: !248, size: 8, offset: 1040)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !863, file: !864, line: 79, baseType: !889, size: 8, offset: 1048)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 1)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !863, file: !864, line: 81, baseType: !893, size: 64, offset: 1088)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !864, line: 43, baseType: null)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !863, file: !864, line: 89, baseType: !896, size: 64, offset: 1152)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !234, line: 153, baseType: !256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !863, file: !864, line: 91, baseType: !898, size: 64, offset: 1216)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !864, line: 37, flags: DIFlagFwdDecl)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !863, file: !864, line: 92, baseType: !901, size: 64, offset: 1280)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !864, line: 38, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !863, file: !864, line: 93, baseType: !882, size: 64, offset: 1344)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !863, file: !864, line: 94, baseType: !230, size: 64, offset: 1408)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_prevchain", scope: !863, file: !864, line: 95, baseType: !906, size: 64, offset: 1472)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !863, file: !864, line: 96, baseType: !203, size: 32, offset: 1536)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !863, file: !864, line: 98, baseType: !909, size: 160, offset: 1568)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !16)
!910 = !DISubprogram(name: "strlen", scope: !845, file: !845, line: 407, type: !911, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!911 = !DISubroutineType(types: !912)
!912 = !{!244, !735}
!913 = distinct !DISubprogram(name: "parse_uint16_t_array", scope: !2, file: !2, line: 133, type: !914, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !227, retainedNodes: !917)
!914 = !DISubroutineType(types: !915)
!915 = !{!203, !229, !916, !203}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!917 = !{!918, !919, !920, !921, !922, !923, !924}
!918 = !DILocalVariable(name: "s", arg: 1, scope: !913, file: !2, line: 133, type: !229)
!919 = !DILocalVariable(name: "arr", arg: 2, scope: !913, file: !2, line: 133, type: !916)
!920 = !DILocalVariable(name: "n", arg: 3, scope: !913, file: !2, line: 133, type: !203)
!921 = !DILocalVariable(name: "line", scope: !913, file: !2, line: 133, type: !229)
!922 = !DILocalVariable(name: "endptr", scope: !913, file: !2, line: 133, type: !229)
!923 = !DILocalVariable(name: "i", scope: !913, file: !2, line: 133, type: !203)
!924 = !DILocalVariable(name: "v", scope: !913, file: !2, line: 133, type: !236)
!925 = distinct !DIAssignID()
!926 = !DILocation(line: 0, scope: !913)
!927 = !DILocation(line: 133, column: 1, scope: !913)
!928 = !DILocation(line: 133, column: 1, scope: !929)
!929 = distinct !DILexicalBlock(scope: !930, file: !2, line: 133, column: 1)
!930 = distinct !DILexicalBlock(scope: !913, file: !2, line: 133, column: 1)
!931 = !DILocation(line: 133, column: 1, scope: !932)
!932 = distinct !DILexicalBlock(scope: !913, file: !2, line: 133, column: 1)
!933 = distinct !DIAssignID()
!934 = !DILocation(line: 133, column: 1, scope: !935)
!935 = distinct !DILexicalBlock(scope: !932, file: !2, line: 133, column: 1)
!936 = !DILocation(line: 133, column: 1, scope: !937)
!937 = distinct !DILexicalBlock(scope: !935, file: !2, line: 133, column: 1)
!938 = !{!939, !939, i64 0}
!939 = !{!"short", !376, i64 0}
!940 = distinct !{!940, !927, !927, !386, !387}
!941 = !DILocation(line: 133, column: 1, scope: !942)
!942 = distinct !DILexicalBlock(scope: !943, file: !2, line: 133, column: 1)
!943 = distinct !DILexicalBlock(scope: !913, file: !2, line: 133, column: 1)
!944 = distinct !DISubprogram(name: "parse_uint32_t_array", scope: !2, file: !2, line: 134, type: !945, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !227, retainedNodes: !948)
!945 = !DISubroutineType(types: !946)
!946 = !{!203, !229, !947, !203}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!948 = !{!949, !950, !951, !952, !953, !954, !955}
!949 = !DILocalVariable(name: "s", arg: 1, scope: !944, file: !2, line: 134, type: !229)
!950 = !DILocalVariable(name: "arr", arg: 2, scope: !944, file: !2, line: 134, type: !947)
!951 = !DILocalVariable(name: "n", arg: 3, scope: !944, file: !2, line: 134, type: !203)
!952 = !DILocalVariable(name: "line", scope: !944, file: !2, line: 134, type: !229)
!953 = !DILocalVariable(name: "endptr", scope: !944, file: !2, line: 134, type: !229)
!954 = !DILocalVariable(name: "i", scope: !944, file: !2, line: 134, type: !203)
!955 = !DILocalVariable(name: "v", scope: !944, file: !2, line: 134, type: !239)
!956 = distinct !DIAssignID()
!957 = !DILocation(line: 0, scope: !944)
!958 = !DILocation(line: 134, column: 1, scope: !944)
!959 = !DILocation(line: 134, column: 1, scope: !960)
!960 = distinct !DILexicalBlock(scope: !961, file: !2, line: 134, column: 1)
!961 = distinct !DILexicalBlock(scope: !944, file: !2, line: 134, column: 1)
!962 = !DILocation(line: 134, column: 1, scope: !963)
