; ModuleID = 'kmp/kmp/kmp_opt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "riscv64-unknown-linux-gnu"

%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str.1 = private unnamed_addr constant [34 x i8] c"fd>1 && \22Invalid file descriptor\22\00", align 1, !dbg !0
@.str.2 = private unnamed_addr constant [23 x i8] c"../../common/support.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.readfile = private unnamed_addr constant [20 x i8] c"char *readfile(int)\00", align 1, !dbg !12
@.str.4 = private unnamed_addr constant [51 x i8] c"0==fstat(fd, &s) && \22Couldn't determine file size\22\00", align 1, !dbg !18
@.str.6 = private unnamed_addr constant [25 x i8] c"len>0 && \22File is empty\22\00", align 1, !dbg !23
@.str.8 = private unnamed_addr constant [29 x i8] c"status>=0 && \22read() failed\22\00", align 1, !dbg !28
@.str.10 = private unnamed_addr constant [33 x i8] c"n>=0 && \22Invalid section number\22\00", align 1, !dbg !33
@__PRETTY_FUNCTION__.find_section_start = private unnamed_addr constant [38 x i8] c"char *find_section_start(char *, int)\00", align 1, !dbg !38
@.str.12 = private unnamed_addr constant [34 x i8] c"s!=NULL && \22Invalid input string\22\00", align 1, !dbg !43

!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 5)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 344, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 43)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !104, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 182, type: !99, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !99, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !99, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !118, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 328, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 41)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 7)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !123, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 240, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 30)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 6)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 90)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !40, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !65)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !171, isLocal: true, isDefinition: true)
!170 = !DIFile(filename: "../../common/harness.c", directory: "/home/kelvin/MachSuite/kmp/kmp")
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 57)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !9, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 184, elements: !10)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !170, line: 22, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 11)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !170, line: 24, type: !181, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "INPUT_SIZE", scope: !188, file: !189, line: 4, type: !206, isLocal: false, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C11, file: !189, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !190, globals: !211, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "local_support.c", directory: "/home/kelvin/MachSuite/kmp/kmp")
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bench_args_t", file: !193, line: 17, size: 259488, elements: !194)
!193 = !DIFile(filename: "./kmp.h", directory: "/home/kelvin/MachSuite/kmp/kmp")
!194 = !{!195, !196, !200, !207}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !192, file: !193, line: 18, baseType: !104, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !192, file: !193, line: 19, baseType: !197, size: 259288, offset: 32)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 259288, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 32411)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "kmpNext", scope: !192, file: !193, line: 20, baseType: !201, size: 128, offset: 259328)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 128, elements: !105)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !203, line: 26, baseType: !204)
!203 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-intn.h", directory: "")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !205, line: 41, baseType: !206)
!205 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types.h", directory: "")
!206 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "n_matches", scope: !192, file: !193, line: 21, baseType: !208, size: 32, offset: 259456)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 32, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 1)
!211 = !{!186}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !151)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !124)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !170, line: 47, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 12)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !100)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !170, line: 58, type: !30, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !74)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !170, line: 67, type: !35, isLocal: true, isDefinition: true)
!233 = distinct !DICompileUnit(language: DW_LANG_C11, file: !234, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!234 = !DIFile(filename: "kmp.c", directory: "/home/kelvin/MachSuite/kmp/kmp")
!235 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !236, globals: !263, splitDebugInlining: false, nameTableKind: None)
!236 = !{!237, !4, !238, !239, !243, !246, !249, !252, !255, !202, !258, !261, !262}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !240, line: 24, baseType: !241)
!240 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-uintn.h", directory: "")
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !205, line: 38, baseType: !242)
!242 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !240, line: 25, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !205, line: 40, baseType: !245)
!245 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !240, line: 26, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !205, line: 42, baseType: !248)
!248 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !240, line: 27, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !205, line: 45, baseType: !251)
!251 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !203, line: 24, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !205, line: 37, baseType: !254)
!254 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !203, line: 25, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !205, line: 39, baseType: !257)
!257 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !203, line: 27, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !205, line: 44, baseType: !260)
!260 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!261 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!262 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!263 = !{!264, !0, !7, !12, !269, !18, !271, !23, !276, !28, !278, !33, !38, !280, !43, !45, !47, !52, !57, !62, !67, !69, !71, !76, !78, !80, !82, !87, !89, !285, !92, !97, !102, !107, !112, !114, !116, !121, !126, !128, !130, !132, !134, !136, !141, !146, !148, !153, !290, !158, !163, !292, !165}
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !266, isLocal: true, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 24)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !30, isLocal: true, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 14)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !273, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !9, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 21)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !2, line: 154, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 13)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !20, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 27)
!297 = distinct !DICompileUnit(language: DW_LANG_C11, file: !170, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !298, globals: !299, splitDebugInlining: false, nameTableKind: None)
!298 = !{!238}
!299 = !{!300, !168, !174, !176, !179, !184, !302, !212, !304, !215, !218, !306, !223, !226, !311, !228, !231, !313}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !225, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !273, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !214, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !308, isLocal: true, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 31)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !214, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !170, line: 74, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 10)
!318 = !{!"clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)"}
!319 = !{i32 7, !"Dwarf Version", i32 4}
!320 = !{i32 2, !"Debug Info Version", i32 3}
!321 = !{i32 1, !"wchar_size", i32 4}
!322 = !{i32 1, !"target-abi", !"lp64d"}
!323 = distinct !{i32 6, !"riscv-isa", !324}
!324 = distinct !{!"rv64i2p1_m2p0_a2p1_f2p2_d2p2_zicsr2p0_zifencei2p0"}
!325 = !{i32 8, !"PIC Level", i32 2}
!326 = !{i32 7, !"PIE Level", i32 2}
!327 = !{i32 7, !"uwtable", i32 2}
!328 = !{i32 8, !"SmallDataLimit", i32 8}
!329 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!330 = distinct !DISubprogram(name: "CPF", scope: !234, file: !234, line: 7, type: !331, scopeLine: 7, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !334)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !237, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!334 = !{!335, !336, !337, !338, !339, !340}
!335 = !DILocalVariable(name: "pattern", arg: 1, scope: !330, file: !234, line: 7, type: !237)
!336 = !DILocalVariable(name: "kmpNext", arg: 2, scope: !330, file: !234, line: 7, type: !333)
!337 = !DILocalVariable(name: "k", scope: !330, file: !234, line: 8, type: !202)
!338 = !DILocalVariable(name: "q", scope: !330, file: !234, line: 8, type: !202)
!339 = !DILabel(scope: !330, name: "c1", file: !234, line: 12)
!340 = !DILabel(scope: !341, name: "c2", file: !234, line: 13)
!341 = distinct !DILexicalBlock(scope: !342, file: !234, line: 12, column: 43)
!342 = distinct !DILexicalBlock(scope: !343, file: !234, line: 12, column: 10)
!343 = distinct !DILexicalBlock(scope: !330, file: !234, line: 12, column: 10)
!344 = !DILocation(line: 0, scope: !330)
!345 = !DILocation(line: 10, column: 16, scope: !330)
!346 = !{!347, !347, i64 0}
!347 = !{!"int", !348, i64 0}
!348 = !{!"omnipotent char", !349, i64 0}
!349 = !{!"Simple C/C++ TBAA"}
!350 = !DILocation(line: 12, column: 5, scope: !330)
!351 = !DILocation(line: 12, column: 10, scope: !343)
!352 = !DILocation(line: 13, column: 22, scope: !341)
!353 = !DILocation(line: 13, column: 26, scope: !341)
!354 = !DILocation(line: 13, column: 29, scope: !341)
!355 = !{!348, !348, i64 0}
!356 = !DILocation(line: 13, column: 40, scope: !341)
!357 = !DILocation(line: 13, column: 14, scope: !341)
!358 = !DILocation(line: 14, column: 17, scope: !359)
!359 = distinct !DILexicalBlock(scope: !341, file: !234, line: 13, column: 54)
!360 = distinct !{!360, !357, !361, !362, !363}
!361 = !DILocation(line: 15, column: 9, scope: !341)
!362 = !{!"llvm.loop.mustprogress"}
!363 = !{!"llvm.loop.unroll.disable"}
!364 = !DILocation(line: 16, column: 12, scope: !365)
!365 = distinct !DILexicalBlock(scope: !341, file: !234, line: 16, column: 12)
!366 = !DILocation(line: 16, column: 23, scope: !365)
!367 = !DILocation(line: 16, column: 12, scope: !341)
!368 = !DILocation(line: 19, column: 9, scope: !341)
!369 = !DILocation(line: 19, column: 20, scope: !341)
!370 = !DILocation(line: 12, column: 40, scope: !342)
!371 = !DILocation(line: 12, column: 23, scope: !342)
!372 = distinct !{!372, !351, !373, !362, !363}
!373 = !DILocation(line: 20, column: 5, scope: !343)
!374 = !DILocation(line: 21, column: 1, scope: !330)
!375 = distinct !DISubprogram(name: "kmp", scope: !234, file: !234, line: 24, type: !376, scopeLine: 24, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !378)
!376 = !DISubroutineType(types: !377)
!377 = !{!206, !237, !237, !333, !333}
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386}
!379 = !DILocalVariable(name: "pattern", arg: 1, scope: !375, file: !234, line: 24, type: !237)
!380 = !DILocalVariable(name: "input", arg: 2, scope: !375, file: !234, line: 24, type: !237)
!381 = !DILocalVariable(name: "kmpNext", arg: 3, scope: !375, file: !234, line: 24, type: !333)
!382 = !DILocalVariable(name: "n_matches", arg: 4, scope: !375, file: !234, line: 24, type: !333)
!383 = !DILocalVariable(name: "i", scope: !375, file: !234, line: 25, type: !202)
!384 = !DILocalVariable(name: "q", scope: !375, file: !234, line: 25, type: !202)
!385 = !DILabel(scope: !375, name: "k1", file: !234, line: 31)
!386 = !DILabel(scope: !387, name: "k2", file: !234, line: 32)
!387 = distinct !DILexicalBlock(scope: !388, file: !234, line: 31, column: 42)
!388 = distinct !DILexicalBlock(scope: !389, file: !234, line: 31, column: 10)
!389 = distinct !DILexicalBlock(scope: !375, file: !234, line: 31, column: 10)
!390 = !DILocation(line: 0, scope: !375)
!391 = !DILocation(line: 26, column: 18, scope: !375)
!392 = !DILocation(line: 0, scope: !330, inlinedAt: !393)
!393 = distinct !DILocation(line: 28, column: 5, scope: !375)
!394 = !DILocation(line: 10, column: 16, scope: !330, inlinedAt: !393)
!395 = !DILocation(line: 12, column: 5, scope: !330, inlinedAt: !393)
!396 = !DILocation(line: 12, column: 10, scope: !343, inlinedAt: !393)
!397 = !DILocation(line: 13, column: 22, scope: !341, inlinedAt: !393)
!398 = !DILocation(line: 13, column: 26, scope: !341, inlinedAt: !393)
!399 = !DILocation(line: 13, column: 29, scope: !341, inlinedAt: !393)
!400 = !DILocation(line: 13, column: 40, scope: !341, inlinedAt: !393)
!401 = !DILocation(line: 13, column: 14, scope: !341, inlinedAt: !393)
!402 = !DILocation(line: 14, column: 17, scope: !359, inlinedAt: !393)
!403 = distinct !{!403, !401, !404, !362, !363}
!404 = !DILocation(line: 15, column: 9, scope: !341, inlinedAt: !393)
!405 = !DILocation(line: 16, column: 12, scope: !365, inlinedAt: !393)
!406 = !DILocation(line: 16, column: 23, scope: !365, inlinedAt: !393)
!407 = !DILocation(line: 16, column: 12, scope: !341, inlinedAt: !393)
!408 = !DILocation(line: 19, column: 9, scope: !341, inlinedAt: !393)
!409 = !DILocation(line: 19, column: 20, scope: !341, inlinedAt: !393)
!410 = !DILocation(line: 12, column: 40, scope: !342, inlinedAt: !393)
!411 = !DILocation(line: 12, column: 23, scope: !342, inlinedAt: !393)
!412 = distinct !{!412, !396, !413, !362, !363}
!413 = !DILocation(line: 20, column: 5, scope: !343, inlinedAt: !393)
!414 = !DILocation(line: 31, column: 10, scope: !389)
!415 = !DILocation(line: 32, column: 23, scope: !387)
!416 = !DILocation(line: 32, column: 27, scope: !387)
!417 = !DILocation(line: 32, column: 30, scope: !387)
!418 = !DILocation(line: 32, column: 41, scope: !387)
!419 = !DILocation(line: 32, column: 14, scope: !387)
!420 = !DILocation(line: 33, column: 17, scope: !421)
!421 = distinct !DILexicalBlock(scope: !387, file: !234, line: 32, column: 53)
!422 = distinct !{!422, !419, !423, !362, !363}
!423 = !DILocation(line: 34, column: 9, scope: !387)
!424 = !DILocation(line: 35, column: 13, scope: !425)
!425 = distinct !DILexicalBlock(scope: !387, file: !234, line: 35, column: 13)
!426 = !DILocation(line: 35, column: 24, scope: !425)
!427 = !DILocation(line: 35, column: 13, scope: !387)
!428 = !DILocation(line: 38, column: 15, scope: !429)
!429 = distinct !DILexicalBlock(scope: !387, file: !234, line: 38, column: 13)
!430 = !DILocation(line: 38, column: 13, scope: !387)
!431 = !DILocation(line: 39, column: 25, scope: !432)
!432 = distinct !DILexicalBlock(scope: !429, file: !234, line: 38, column: 31)
!433 = !DILocation(line: 40, column: 17, scope: !432)
!434 = !DILocation(line: 41, column: 9, scope: !432)
!435 = !DILocation(line: 31, column: 39, scope: !388)
!436 = !DILocation(line: 31, column: 23, scope: !388)
!437 = distinct !{!437, !414, !438, !362, !363}
!438 = !DILocation(line: 42, column: 5, scope: !389)
!439 = !DILocation(line: 43, column: 5, scope: !375)
!440 = distinct !DISubprogram(name: "run_benchmark", scope: !189, file: !189, line: 6, type: !441, scopeLine: 6, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !443)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !238}
!443 = !{!444, !445}
!444 = !DILocalVariable(name: "vargs", arg: 1, scope: !440, file: !189, line: 6, type: !238)
!445 = !DILocalVariable(name: "args", scope: !440, file: !189, line: 7, type: !191)
!446 = !DILocation(line: 0, scope: !440)
!447 = !DILocation(line: 8, column: 42, scope: !440)
!448 = !DILocation(line: 8, column: 57, scope: !440)
!449 = !DILocation(line: 0, scope: !375, inlinedAt: !450)
!450 = distinct !DILocation(line: 8, column: 3, scope: !440)
!451 = !DILocation(line: 26, column: 18, scope: !375, inlinedAt: !450)
!452 = !DILocation(line: 0, scope: !330, inlinedAt: !453)
!453 = distinct !DILocation(line: 28, column: 5, scope: !375, inlinedAt: !450)
!454 = !DILocation(line: 10, column: 16, scope: !330, inlinedAt: !453)
!455 = !DILocation(line: 12, column: 5, scope: !330, inlinedAt: !453)
!456 = !DILocation(line: 12, column: 10, scope: !343, inlinedAt: !453)
!457 = !DILocation(line: 13, column: 22, scope: !341, inlinedAt: !453)
!458 = !DILocation(line: 13, column: 26, scope: !341, inlinedAt: !453)
!459 = !DILocation(line: 13, column: 29, scope: !341, inlinedAt: !453)
!460 = !DILocation(line: 13, column: 40, scope: !341, inlinedAt: !453)
!461 = !DILocation(line: 13, column: 14, scope: !341, inlinedAt: !453)
!462 = !DILocation(line: 14, column: 17, scope: !359, inlinedAt: !453)
!463 = distinct !{!463, !461, !464, !362, !363}
!464 = !DILocation(line: 15, column: 9, scope: !341, inlinedAt: !453)
!465 = !DILocation(line: 16, column: 12, scope: !365, inlinedAt: !453)
!466 = !DILocation(line: 16, column: 23, scope: !365, inlinedAt: !453)
!467 = !DILocation(line: 16, column: 12, scope: !341, inlinedAt: !453)
!468 = !DILocation(line: 19, column: 9, scope: !341, inlinedAt: !453)
!469 = !DILocation(line: 19, column: 20, scope: !341, inlinedAt: !453)
!470 = !DILocation(line: 12, column: 40, scope: !342, inlinedAt: !453)
!471 = !DILocation(line: 12, column: 23, scope: !342, inlinedAt: !453)
!472 = distinct !{!472, !456, !473, !362, !363}
!473 = !DILocation(line: 20, column: 5, scope: !343, inlinedAt: !453)
!474 = !DILocation(line: 8, column: 29, scope: !440)
!475 = !DILocation(line: 31, column: 10, scope: !389, inlinedAt: !450)
!476 = !DILocation(line: 32, column: 23, scope: !387, inlinedAt: !450)
!477 = !DILocation(line: 32, column: 27, scope: !387, inlinedAt: !450)
!478 = !DILocation(line: 32, column: 30, scope: !387, inlinedAt: !450)
!479 = !DILocation(line: 32, column: 41, scope: !387, inlinedAt: !450)
!480 = !DILocation(line: 32, column: 14, scope: !387, inlinedAt: !450)
!481 = !DILocation(line: 33, column: 17, scope: !421, inlinedAt: !450)
!482 = distinct !{!482, !480, !483, !362, !363}
!483 = !DILocation(line: 34, column: 9, scope: !387, inlinedAt: !450)
!484 = !DILocation(line: 35, column: 13, scope: !425, inlinedAt: !450)
!485 = !DILocation(line: 35, column: 24, scope: !425, inlinedAt: !450)
!486 = !DILocation(line: 35, column: 13, scope: !387, inlinedAt: !450)
!487 = !DILocation(line: 38, column: 15, scope: !429, inlinedAt: !450)
!488 = !DILocation(line: 38, column: 13, scope: !387, inlinedAt: !450)
!489 = !DILocation(line: 39, column: 25, scope: !432, inlinedAt: !450)
!490 = !DILocation(line: 40, column: 17, scope: !432, inlinedAt: !450)
!491 = !DILocation(line: 41, column: 9, scope: !432, inlinedAt: !450)
!492 = !DILocation(line: 31, column: 39, scope: !388, inlinedAt: !450)
!493 = !DILocation(line: 31, column: 23, scope: !388, inlinedAt: !450)
!494 = distinct !{!494, !475, !495, !362, !363}
!495 = !DILocation(line: 42, column: 5, scope: !389, inlinedAt: !450)
!496 = !DILocation(line: 9, column: 1, scope: !440)
!497 = distinct !DISubprogram(name: "input_to_data", scope: !189, file: !189, line: 18, type: !498, scopeLine: 18, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !500)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !206, !238}
!500 = !{!501, !502, !503, !504, !505}
!501 = !DILocalVariable(name: "fd", arg: 1, scope: !497, file: !189, line: 18, type: !206)
!502 = !DILocalVariable(name: "vdata", arg: 2, scope: !497, file: !189, line: 18, type: !238)
!503 = !DILocalVariable(name: "data", scope: !497, file: !189, line: 19, type: !191)
!504 = !DILocalVariable(name: "p", scope: !497, file: !189, line: 20, type: !237)
!505 = !DILocalVariable(name: "s", scope: !497, file: !189, line: 20, type: !237)
!506 = !DILocation(line: 0, scope: !497)
!507 = !DILocation(line: 22, column: 3, scope: !497)
!508 = !DILocation(line: 24, column: 7, scope: !497)
!509 = !DILocalVariable(name: "s", arg: 1, scope: !510, file: !2, line: 56, type: !237)
!510 = distinct !DISubprogram(name: "find_section_start", scope: !2, file: !2, line: 56, type: !511, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !235, retainedNodes: !513)
!511 = !DISubroutineType(types: !512)
!512 = !{!237, !237, !206}
!513 = !{!509, !514, !515}
!514 = !DILocalVariable(name: "n", arg: 2, scope: !510, file: !2, line: 56, type: !206)
!515 = !DILocalVariable(name: "i", scope: !510, file: !2, line: 57, type: !206)
!516 = !DILocation(line: 0, scope: !510, inlinedAt: !517)
!517 = distinct !DILocation(line: 26, column: 7, scope: !497)
!518 = !DILocation(line: 64, column: 17, scope: !510, inlinedAt: !517)
!519 = !DILocation(line: 64, column: 3, scope: !510, inlinedAt: !517)
!520 = !DILocation(line: 66, column: 22, scope: !521, inlinedAt: !517)
!521 = distinct !DILexicalBlock(scope: !522, file: !2, line: 66, column: 9)
!522 = distinct !DILexicalBlock(scope: !510, file: !2, line: 64, column: 31)
!523 = !DILocation(line: 66, column: 26, scope: !521, inlinedAt: !517)
!524 = !DILocation(line: 66, column: 32, scope: !521, inlinedAt: !517)
!525 = !DILocation(line: 66, column: 35, scope: !521, inlinedAt: !517)
!526 = !DILocation(line: 66, column: 39, scope: !521, inlinedAt: !517)
!527 = !DILocation(line: 66, column: 9, scope: !522, inlinedAt: !517)
!528 = !DILocation(line: 69, column: 6, scope: !522, inlinedAt: !517)
!529 = !DILocation(line: 64, column: 10, scope: !510, inlinedAt: !517)
!530 = !DILocation(line: 64, column: 13, scope: !510, inlinedAt: !517)
!531 = distinct !{!531, !519, !532, !362, !363}
!532 = !DILocation(line: 70, column: 3, scope: !510, inlinedAt: !517)
!533 = !DILocation(line: 71, column: 6, scope: !534, inlinedAt: !517)
!534 = distinct !DILexicalBlock(scope: !510, file: !2, line: 71, column: 6)
!535 = !DILocation(line: 71, column: 8, scope: !534, inlinedAt: !517)
!536 = !DILocation(line: 71, column: 6, scope: !510, inlinedAt: !517)
!537 = !DILocalVariable(name: "s", arg: 1, scope: !538, file: !2, line: 77, type: !237)
!538 = distinct !DISubprogram(name: "parse_string", scope: !2, file: !2, line: 77, type: !539, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !235, retainedNodes: !541)
!539 = !DISubroutineType(types: !540)
!540 = !{!206, !237, !237, !206}
!541 = !{!537, !542, !543, !544}
!542 = !DILocalVariable(name: "arr", arg: 2, scope: !538, file: !2, line: 77, type: !237)
!543 = !DILocalVariable(name: "n", arg: 3, scope: !538, file: !2, line: 77, type: !206)
!544 = !DILocalVariable(name: "k", scope: !538, file: !2, line: 78, type: !206)
!545 = !DILocation(line: 0, scope: !538, inlinedAt: !546)
!546 = distinct !DILocation(line: 27, column: 3, scope: !497)
!547 = !DILocation(line: 91, column: 3, scope: !538, inlinedAt: !546)
!548 = !DILocation(line: 0, scope: !510, inlinedAt: !549)
!549 = distinct !DILocation(line: 29, column: 7, scope: !497)
!550 = !DILocation(line: 64, column: 17, scope: !510, inlinedAt: !549)
!551 = !DILocation(line: 64, column: 3, scope: !510, inlinedAt: !549)
!552 = !DILocation(line: 66, column: 22, scope: !521, inlinedAt: !549)
!553 = !DILocation(line: 66, column: 26, scope: !521, inlinedAt: !549)
!554 = !DILocation(line: 66, column: 32, scope: !521, inlinedAt: !549)
!555 = !DILocation(line: 66, column: 35, scope: !521, inlinedAt: !549)
!556 = !DILocation(line: 66, column: 39, scope: !521, inlinedAt: !549)
!557 = !DILocation(line: 66, column: 9, scope: !522, inlinedAt: !549)
!558 = !DILocation(line: 69, column: 6, scope: !522, inlinedAt: !549)
!559 = !DILocation(line: 64, column: 10, scope: !510, inlinedAt: !549)
!560 = !DILocation(line: 64, column: 13, scope: !510, inlinedAt: !549)
!561 = distinct !{!561, !551, !562, !362, !363}
!562 = !DILocation(line: 70, column: 3, scope: !510, inlinedAt: !549)
!563 = !DILocation(line: 71, column: 6, scope: !534, inlinedAt: !549)
!564 = !DILocation(line: 71, column: 8, scope: !534, inlinedAt: !549)
!565 = !DILocation(line: 71, column: 6, scope: !510, inlinedAt: !549)
!566 = !DILocation(line: 30, column: 25, scope: !497)
!567 = !DILocation(line: 0, scope: !538, inlinedAt: !568)
!568 = distinct !DILocation(line: 30, column: 3, scope: !497)
!569 = !DILocation(line: 91, column: 3, scope: !538, inlinedAt: !568)
!570 = !DILocation(line: 31, column: 3, scope: !497)
!571 = !DILocation(line: 32, column: 1, scope: !497)
!572 = !DISubprogram(name: "free", scope: !573, file: !573, line: 687, type: !441, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!573 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdlib.h", directory: "")
!574 = distinct !DISubprogram(name: "data_to_input", scope: !189, file: !189, line: 34, type: !498, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !575)
!575 = !{!576, !577, !578}
!576 = !DILocalVariable(name: "fd", arg: 1, scope: !574, file: !189, line: 34, type: !206)
!577 = !DILocalVariable(name: "vdata", arg: 2, scope: !574, file: !189, line: 34, type: !238)
!578 = !DILocalVariable(name: "data", scope: !574, file: !189, line: 35, type: !191)
!579 = !DILocation(line: 0, scope: !574)
!580 = !DILocalVariable(name: "fd", arg: 1, scope: !581, file: !2, line: 189, type: !206)
!581 = distinct !DISubprogram(name: "write_section_header", scope: !2, file: !2, line: 189, type: !582, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !235, retainedNodes: !584)
!582 = !DISubroutineType(types: !583)
!583 = !{!206, !206}
!584 = !{!580}
!585 = !DILocation(line: 0, scope: !581, inlinedAt: !586)
!586 = distinct !DILocation(line: 37, column: 3, scope: !574)
!587 = !DILocation(line: 190, column: 3, scope: !588, inlinedAt: !586)
!588 = distinct !DILexicalBlock(scope: !589, file: !2, line: 190, column: 3)
!589 = distinct !DILexicalBlock(scope: !581, file: !2, line: 190, column: 3)
!590 = !DILocation(line: 191, column: 3, scope: !581, inlinedAt: !586)
!591 = !DILocation(line: 38, column: 3, scope: !574)
!592 = !DILocation(line: 0, scope: !581, inlinedAt: !593)
!593 = distinct !DILocation(line: 40, column: 3, scope: !574)
!594 = !DILocation(line: 191, column: 3, scope: !581, inlinedAt: !593)
!595 = !DILocation(line: 41, column: 26, scope: !574)
!596 = !DILocation(line: 41, column: 3, scope: !574)
!597 = !DILocation(line: 42, column: 1, scope: !574)
!598 = distinct !DISubprogram(name: "output_to_data", scope: !189, file: !189, line: 49, type: !498, scopeLine: 49, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !599)
!599 = !{!600, !601, !602, !603, !604}
!600 = !DILocalVariable(name: "fd", arg: 1, scope: !598, file: !189, line: 49, type: !206)
!601 = !DILocalVariable(name: "vdata", arg: 2, scope: !598, file: !189, line: 49, type: !238)
!602 = !DILocalVariable(name: "data", scope: !598, file: !189, line: 50, type: !191)
!603 = !DILocalVariable(name: "p", scope: !598, file: !189, line: 51, type: !237)
!604 = !DILocalVariable(name: "s", scope: !598, file: !189, line: 51, type: !237)
!605 = !DILocation(line: 0, scope: !598)
!606 = !DILocation(line: 53, column: 3, scope: !598)
!607 = !DILocation(line: 55, column: 7, scope: !598)
!608 = !DILocation(line: 0, scope: !510, inlinedAt: !609)
!609 = distinct !DILocation(line: 57, column: 7, scope: !598)
!610 = !DILocation(line: 64, column: 17, scope: !510, inlinedAt: !609)
!611 = !DILocation(line: 64, column: 3, scope: !510, inlinedAt: !609)
!612 = !DILocation(line: 66, column: 22, scope: !521, inlinedAt: !609)
!613 = !DILocation(line: 66, column: 26, scope: !521, inlinedAt: !609)
!614 = !DILocation(line: 66, column: 32, scope: !521, inlinedAt: !609)
!615 = !DILocation(line: 66, column: 35, scope: !521, inlinedAt: !609)
!616 = !DILocation(line: 66, column: 39, scope: !521, inlinedAt: !609)
!617 = !DILocation(line: 66, column: 9, scope: !522, inlinedAt: !609)
!618 = !DILocation(line: 69, column: 6, scope: !522, inlinedAt: !609)
!619 = !DILocation(line: 64, column: 10, scope: !510, inlinedAt: !609)
!620 = !DILocation(line: 64, column: 13, scope: !510, inlinedAt: !609)
!621 = distinct !{!621, !611, !622, !362, !363}
!622 = !DILocation(line: 70, column: 3, scope: !510, inlinedAt: !609)
!623 = !DILocation(line: 71, column: 6, scope: !534, inlinedAt: !609)
!624 = !DILocation(line: 71, column: 8, scope: !534, inlinedAt: !609)
!625 = !DILocation(line: 71, column: 6, scope: !510, inlinedAt: !609)
!626 = !DILocation(line: 58, column: 32, scope: !598)
!627 = !DILocation(line: 58, column: 3, scope: !598)
!628 = !DILocation(line: 59, column: 3, scope: !598)
!629 = !DILocation(line: 60, column: 1, scope: !598)
!630 = distinct !DISubprogram(name: "data_to_output", scope: !189, file: !189, line: 62, type: !498, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !631)
!631 = !{!632, !633, !634}
!632 = !DILocalVariable(name: "fd", arg: 1, scope: !630, file: !189, line: 62, type: !206)
!633 = !DILocalVariable(name: "vdata", arg: 2, scope: !630, file: !189, line: 62, type: !238)
!634 = !DILocalVariable(name: "data", scope: !630, file: !189, line: 63, type: !191)
!635 = !DILocation(line: 0, scope: !630)
!636 = !DILocation(line: 0, scope: !581, inlinedAt: !637)
!637 = distinct !DILocation(line: 65, column: 3, scope: !630)
!638 = !DILocation(line: 190, column: 3, scope: !588, inlinedAt: !637)
!639 = !DILocation(line: 191, column: 3, scope: !581, inlinedAt: !637)
!640 = !DILocation(line: 66, column: 33, scope: !630)
!641 = !DILocalVariable(name: "fd", arg: 1, scope: !642, file: !2, line: 183, type: !206)
!642 = distinct !DISubprogram(name: "write_int32_t_array", scope: !2, file: !2, line: 183, type: !643, scopeLine: 183, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !235, retainedNodes: !645)
!643 = !DISubroutineType(types: !644)
!644 = !{!206, !206, !333, !206}
!645 = !{!641, !646, !647, !648}
!646 = !DILocalVariable(name: "arr", arg: 2, scope: !642, file: !2, line: 183, type: !333)
!647 = !DILocalVariable(name: "n", arg: 3, scope: !642, file: !2, line: 183, type: !206)
!648 = !DILocalVariable(name: "i", scope: !642, file: !2, line: 183, type: !206)
!649 = !DILocation(line: 0, scope: !642, inlinedAt: !650)
!650 = distinct !DILocation(line: 66, column: 3, scope: !630)
!651 = !DILocation(line: 183, column: 1, scope: !652, inlinedAt: !650)
!652 = distinct !DILexicalBlock(scope: !653, file: !2, line: 183, column: 1)
!653 = distinct !DILexicalBlock(scope: !654, file: !2, line: 183, column: 1)
!654 = distinct !DILexicalBlock(scope: !642, file: !2, line: 183, column: 1)
!655 = !DILocation(line: 67, column: 1, scope: !630)
!656 = distinct !DISubprogram(name: "check_data", scope: !189, file: !189, line: 69, type: !657, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !659)
!657 = !DISubroutineType(types: !658)
!658 = !{!206, !238, !238}
!659 = !{!660, !661, !662, !663, !664}
!660 = !DILocalVariable(name: "vdata", arg: 1, scope: !656, file: !189, line: 69, type: !238)
!661 = !DILocalVariable(name: "vref", arg: 2, scope: !656, file: !189, line: 69, type: !238)
!662 = !DILocalVariable(name: "data", scope: !656, file: !189, line: 70, type: !191)
!663 = !DILocalVariable(name: "ref", scope: !656, file: !189, line: 71, type: !191)
!664 = !DILocalVariable(name: "has_errors", scope: !656, file: !189, line: 72, type: !206)
!665 = !DILocation(line: 0, scope: !656)
!666 = !DILocation(line: 74, column: 24, scope: !656)
!667 = !DILocation(line: 74, column: 18, scope: !656)
!668 = !DILocation(line: 74, column: 45, scope: !656)
!669 = !DILocation(line: 74, column: 40, scope: !656)
!670 = !DILocation(line: 74, column: 37, scope: !656)
!671 = !DILocation(line: 77, column: 10, scope: !656)
!672 = !DILocation(line: 77, column: 3, scope: !656)
!673 = distinct !DISubprogram(name: "readfile", scope: !2, file: !2, line: 34, type: !674, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !235, retainedNodes: !676)
!674 = !DISubroutineType(types: !675)
!675 = !{!237, !206}
!676 = !{!677, !678, !679, !716, !719, !722}
!677 = !DILocalVariable(name: "fd", arg: 1, scope: !673, file: !2, line: 34, type: !206)
!678 = !DILocalVariable(name: "p", scope: !673, file: !2, line: 35, type: !237)
!679 = !DILocalVariable(name: "s", scope: !673, file: !2, line: 36, type: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !681, line: 44, size: 1024, elements: !682)
!681 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/struct_stat.h", directory: "")
!682 = !{!683, !685, !687, !689, !691, !693, !695, !696, !697, !699, !701, !702, !704, !712, !713, !714}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !680, file: !681, line: 46, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !205, line: 145, baseType: !251)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !680, file: !681, line: 47, baseType: !686, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !205, line: 148, baseType: !251)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !680, file: !681, line: 48, baseType: !688, size: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !205, line: 150, baseType: !248)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !680, file: !681, line: 49, baseType: !690, size: 32, offset: 160)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !205, line: 151, baseType: !248)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !680, file: !681, line: 50, baseType: !692, size: 32, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !205, line: 146, baseType: !248)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !680, file: !681, line: 51, baseType: !694, size: 32, offset: 224)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !205, line: 147, baseType: !248)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !680, file: !681, line: 52, baseType: !684, size: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !680, file: !681, line: 53, baseType: !684, size: 64, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !680, file: !681, line: 54, baseType: !698, size: 64, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !205, line: 152, baseType: !260)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !680, file: !681, line: 55, baseType: !700, size: 32, offset: 448)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !205, line: 175, baseType: !206)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !680, file: !681, line: 56, baseType: !206, size: 32, offset: 480)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !680, file: !681, line: 57, baseType: !703, size: 64, offset: 512)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !205, line: 180, baseType: !260)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !680, file: !681, line: 65, baseType: !705, size: 128, offset: 576)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !706, line: 11, size: 128, elements: !707)
!706 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_timespec.h", directory: "")
!707 = !{!708, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !705, file: !706, line: 16, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !205, line: 160, baseType: !260)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !705, file: !706, line: 21, baseType: !711, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !205, line: 197, baseType: !260)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !680, file: !681, line: 66, baseType: !705, size: 128, offset: 704)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !680, file: !681, line: 67, baseType: !705, size: 128, offset: 832)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !680, file: !681, line: 79, baseType: !715, size: 64, offset: 960)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 64, elements: !55)
!716 = !DILocalVariable(name: "len", scope: !673, file: !2, line: 37, type: !717)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !718, line: 85, baseType: !698)
!718 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/types.h", directory: "")
!719 = !DILocalVariable(name: "bytes_read", scope: !673, file: !2, line: 38, type: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !718, line: 108, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !205, line: 194, baseType: !260)
!722 = !DILocalVariable(name: "status", scope: !673, file: !2, line: 38, type: !720)
!723 = distinct !DIAssignID()
!724 = !DILocation(line: 0, scope: !673)
!725 = !DILocation(line: 36, column: 3, scope: !673)
!726 = !DILocation(line: 40, column: 3, scope: !727)
!727 = distinct !DILexicalBlock(scope: !728, file: !2, line: 40, column: 3)
!728 = distinct !DILexicalBlock(scope: !673, file: !2, line: 40, column: 3)
!729 = !DILocation(line: 41, column: 3, scope: !730)
!730 = distinct !DILexicalBlock(scope: !731, file: !2, line: 41, column: 3)
!731 = distinct !DILexicalBlock(scope: !673, file: !2, line: 41, column: 3)
!732 = !DILocation(line: 42, column: 11, scope: !673)
!733 = !DILocation(line: 43, column: 3, scope: !734)
!734 = distinct !DILexicalBlock(scope: !735, file: !2, line: 43, column: 3)
!735 = distinct !DILexicalBlock(scope: !673, file: !2, line: 43, column: 3)
!736 = !DILocation(line: 44, column: 25, scope: !673)
!737 = !DILocation(line: 44, column: 15, scope: !673)
!738 = !DILocation(line: 46, column: 3, scope: !673)
!739 = !DILocation(line: 49, column: 15, scope: !740)
!740 = distinct !DILexicalBlock(scope: !673, file: !2, line: 46, column: 27)
!741 = !DILocation(line: 46, column: 20, scope: !673)
!742 = distinct !{!742, !738, !743, !362, !363}
!743 = !DILocation(line: 50, column: 3, scope: !673)
!744 = !DILocation(line: 47, column: 24, scope: !740)
!745 = !DILocation(line: 47, column: 42, scope: !740)
!746 = !DILocation(line: 47, column: 14, scope: !740)
!747 = !DILocation(line: 48, column: 5, scope: !748)
!748 = distinct !DILexicalBlock(scope: !749, file: !2, line: 48, column: 5)
!749 = distinct !DILexicalBlock(scope: !740, file: !2, line: 48, column: 5)
!750 = !DILocation(line: 51, column: 3, scope: !673)
!751 = !DILocation(line: 51, column: 10, scope: !673)
!752 = !DILocation(line: 52, column: 3, scope: !673)
!753 = !DILocation(line: 54, column: 1, scope: !673)
!754 = !DILocation(line: 53, column: 3, scope: !673)
!755 = !DISubprogram(name: "__assert_fail", scope: !756, file: !756, line: 67, type: !757, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!756 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/assert.h", directory: "")
!757 = !DISubroutineType(types: !758)
!758 = !{null, !759, !759, !248, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!760 = !DISubprogram(name: "fstat", scope: !761, file: !761, line: 210, type: !762, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!761 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/stat.h", directory: "")
!762 = !DISubroutineType(types: !763)
!763 = !{!206, !206, !764}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!765 = !DISubprogram(name: "malloc", scope: !573, file: !573, line: 672, type: !766, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!766 = !DISubroutineType(types: !767)
!767 = !{!238, !768}
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !769, line: 18, baseType: !251)
!769 = !DIFile(filename: "/opt/riscv/lib/clang/18/include/__stddef_size_t.h", directory: "")
!770 = !DISubprogram(name: "read", scope: !771, file: !771, line: 371, type: !772, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!771 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/unistd.h", directory: "")
!772 = !DISubroutineType(types: !773)
!773 = !{!720, !206, !238, !768}
!774 = !DISubprogram(name: "close", scope: !771, file: !771, line: 358, type: !582, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!775 = !DILocation(line: 0, scope: !510)
!776 = !DILocation(line: 59, column: 3, scope: !777)
!777 = distinct !DILexicalBlock(scope: !778, file: !2, line: 59, column: 3)
!778 = distinct !DILexicalBlock(scope: !510, file: !2, line: 59, column: 3)
!779 = !DILocation(line: 60, column: 7, scope: !780)
!780 = distinct !DILexicalBlock(scope: !510, file: !2, line: 60, column: 6)
!781 = !DILocation(line: 60, column: 6, scope: !510)
!782 = !DILocation(line: 64, column: 17, scope: !510)
!783 = !DILocation(line: 64, column: 3, scope: !510)
!784 = !DILocation(line: 66, column: 22, scope: !521)
!785 = !DILocation(line: 66, column: 26, scope: !521)
!786 = !DILocation(line: 66, column: 32, scope: !521)
!787 = !DILocation(line: 66, column: 35, scope: !521)
!788 = !DILocation(line: 66, column: 39, scope: !521)
!789 = !DILocation(line: 66, column: 9, scope: !522)
!790 = !DILocation(line: 69, column: 6, scope: !522)
!791 = !DILocation(line: 64, column: 10, scope: !510)
!792 = !DILocation(line: 64, column: 13, scope: !510)
!793 = distinct !{!793, !783, !794, !362, !363}
!794 = !DILocation(line: 70, column: 3, scope: !510)
!795 = !DILocation(line: 71, column: 6, scope: !534)
!796 = !DILocation(line: 71, column: 8, scope: !534)
!797 = !DILocation(line: 71, column: 6, scope: !510)
!798 = !DILocation(line: 74, column: 1, scope: !510)
!799 = !DILocation(line: 0, scope: !538)
!800 = !DILocation(line: 79, column: 3, scope: !801)
!801 = distinct !DILexicalBlock(scope: !802, file: !2, line: 79, column: 3)
!802 = distinct !DILexicalBlock(scope: !538, file: !2, line: 79, column: 3)
!803 = !DILocation(line: 81, column: 8, scope: !804)
!804 = distinct !DILexicalBlock(scope: !538, file: !2, line: 81, column: 7)
!805 = !DILocation(line: 81, column: 7, scope: !538)
!806 = !DILocation(line: 83, column: 12, scope: !807)
!807 = distinct !DILexicalBlock(scope: !804, file: !2, line: 81, column: 13)
!808 = !DILocation(line: 83, column: 5, scope: !807)
!809 = !DILocation(line: 91, column: 19, scope: !538)
!810 = !DILocation(line: 91, column: 3, scope: !538)
!811 = !DILocation(line: 92, column: 7, scope: !538)
!812 = !DILocation(line: 83, column: 16, scope: !807)
!813 = !DILocation(line: 83, column: 26, scope: !807)
!814 = !DILocation(line: 83, column: 32, scope: !807)
!815 = !DILocation(line: 83, column: 29, scope: !807)
!816 = !DILocation(line: 83, column: 35, scope: !807)
!817 = !DILocation(line: 83, column: 45, scope: !807)
!818 = !DILocation(line: 83, column: 48, scope: !807)
!819 = !DILocation(line: 83, column: 54, scope: !807)
!820 = !DILocation(line: 84, column: 9, scope: !807)
!821 = !DILocation(line: 84, column: 18, scope: !807)
!822 = !DILocation(line: 84, column: 26, scope: !807)
!823 = distinct !{!823, !808, !824, !362, !363}
!824 = !DILocation(line: 86, column: 5, scope: !807)
!825 = !DILocation(line: 93, column: 5, scope: !826)
!826 = distinct !DILexicalBlock(scope: !538, file: !2, line: 92, column: 7)
!827 = !DILocation(line: 93, column: 12, scope: !826)
!828 = !DILocation(line: 95, column: 3, scope: !538)
!829 = distinct !DISubprogram(name: "parse_uint8_t_array", scope: !2, file: !2, line: 132, type: !830, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !235, retainedNodes: !833)
!830 = !DISubroutineType(types: !831)
!831 = !{!206, !237, !832, !206}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!833 = !{!834, !835, !836, !837, !838, !839, !840}
!834 = !DILocalVariable(name: "s", arg: 1, scope: !829, file: !2, line: 132, type: !237)
!835 = !DILocalVariable(name: "arr", arg: 2, scope: !829, file: !2, line: 132, type: !832)
!836 = !DILocalVariable(name: "n", arg: 3, scope: !829, file: !2, line: 132, type: !206)
!837 = !DILocalVariable(name: "line", scope: !829, file: !2, line: 132, type: !237)
!838 = !DILocalVariable(name: "endptr", scope: !829, file: !2, line: 132, type: !237)
!839 = !DILocalVariable(name: "i", scope: !829, file: !2, line: 132, type: !206)
!840 = !DILocalVariable(name: "v", scope: !829, file: !2, line: 132, type: !239)
!841 = distinct !DIAssignID()
!842 = !DILocation(line: 0, scope: !829)
!843 = !DILocation(line: 132, column: 1, scope: !829)
!844 = !DILocation(line: 132, column: 1, scope: !845)
!845 = distinct !DILexicalBlock(scope: !846, file: !2, line: 132, column: 1)
!846 = distinct !DILexicalBlock(scope: !829, file: !2, line: 132, column: 1)
!847 = !DILocation(line: 132, column: 1, scope: !848)
!848 = distinct !DILexicalBlock(scope: !829, file: !2, line: 132, column: 1)
!849 = !{!850, !850, i64 0}
!850 = !{!"any pointer", !348, i64 0}
!851 = distinct !DIAssignID()
!852 = !DILocation(line: 132, column: 1, scope: !853)
!853 = distinct !DILexicalBlock(scope: !848, file: !2, line: 132, column: 1)
!854 = !DILocation(line: 132, column: 1, scope: !855)
!855 = distinct !DILexicalBlock(scope: !853, file: !2, line: 132, column: 1)
!856 = distinct !{!856, !843, !843, !362, !363}
!857 = !DILocation(line: 132, column: 1, scope: !858)
!858 = distinct !DILexicalBlock(scope: !859, file: !2, line: 132, column: 1)
!859 = distinct !DILexicalBlock(scope: !829, file: !2, line: 132, column: 1)
!860 = !DISubprogram(name: "strtok", scope: !861, file: !861, line: 356, type: !862, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!861 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/string.h", directory: "")
!862 = !DISubroutineType(types: !863)
!863 = !{!237, !864, !865}
!864 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !237)
!865 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !759)
!866 = !DISubprogram(name: "strtol", scope: !573, file: !573, line: 177, type: !867, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!867 = !DISubroutineType(types: !868)
!868 = !{!260, !865, !869, !206}
!869 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!871 = !DISubprogram(name: "fprintf", scope: !872, file: !872, line: 357, type: !873, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!872 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdio.h", directory: "")
!873 = !DISubroutineType(types: !874)
!874 = !{!206, !875, !865, null}
!875 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !878, line: 7, baseType: !879)
!878 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/FILE.h", directory: "")
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !880, line: 49, size: 1728, elements: !881)
!880 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_FILE.h", directory: "")
!881 = !{!882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !897, !899, !900, !901, !902, !903, !904, !906, !909, !911, !914, !917, !918, !919, !921, !922}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !879, file: !880, line: 51, baseType: !206, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !879, file: !880, line: 54, baseType: !237, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !879, file: !880, line: 55, baseType: !237, size: 64, offset: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !879, file: !880, line: 56, baseType: !237, size: 64, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !879, file: !880, line: 57, baseType: !237, size: 64, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !879, file: !880, line: 58, baseType: !237, size: 64, offset: 320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !879, file: !880, line: 59, baseType: !237, size: 64, offset: 384)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !879, file: !880, line: 60, baseType: !237, size: 64, offset: 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !879, file: !880, line: 61, baseType: !237, size: 64, offset: 512)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !879, file: !880, line: 64, baseType: !237, size: 64, offset: 576)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !879, file: !880, line: 65, baseType: !237, size: 64, offset: 640)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !879, file: !880, line: 66, baseType: !237, size: 64, offset: 704)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !879, file: !880, line: 68, baseType: !895, size: 64, offset: 768)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !880, line: 36, flags: DIFlagFwdDecl)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !879, file: !880, line: 70, baseType: !898, size: 64, offset: 832)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !879, file: !880, line: 72, baseType: !206, size: 32, offset: 896)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !879, file: !880, line: 73, baseType: !206, size: 32, offset: 928)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !879, file: !880, line: 74, baseType: !698, size: 64, offset: 960)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !879, file: !880, line: 77, baseType: !245, size: 16, offset: 1024)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !879, file: !880, line: 78, baseType: !254, size: 8, offset: 1040)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !879, file: !880, line: 79, baseType: !905, size: 8, offset: 1048)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !209)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !879, file: !880, line: 81, baseType: !907, size: 64, offset: 1088)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !880, line: 43, baseType: null)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !879, file: !880, line: 89, baseType: !910, size: 64, offset: 1152)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !205, line: 153, baseType: !260)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !879, file: !880, line: 91, baseType: !912, size: 64, offset: 1216)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !880, line: 37, flags: DIFlagFwdDecl)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !879, file: !880, line: 92, baseType: !915, size: 64, offset: 1280)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !880, line: 38, flags: DIFlagFwdDecl)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !879, file: !880, line: 93, baseType: !898, size: 64, offset: 1344)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !879, file: !880, line: 94, baseType: !238, size: 64, offset: 1408)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_prevchain", scope: !879, file: !880, line: 95, baseType: !920, size: 64, offset: 1472)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !879, file: !880, line: 96, baseType: !206, size: 32, offset: 1536)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !879, file: !880, line: 98, baseType: !923, size: 160, offset: 1568)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !16)
!924 = !DISubprogram(name: "strlen", scope: !861, file: !861, line: 407, type: !925, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!925 = !DISubroutineType(types: !926)
!926 = !{!251, !759}
!927 = distinct !DISubprogram(name: "parse_uint16_t_array", scope: !2, file: !2, line: 133, type: !928, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !235, retainedNodes: !931)
!928 = !DISubroutineType(types: !929)
!929 = !{!206, !237, !930, !206}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!931 = !{!932, !933, !934, !935, !936, !937, !938}
!932 = !DILocalVariable(name: "s", arg: 1, scope: !927, file: !2, line: 133, type: !237)
!933 = !DILocalVariable(name: "arr", arg: 2, scope: !927, file: !2, line: 133, type: !930)
!934 = !DILocalVariable(name: "n", arg: 3, scope: !927, file: !2, line: 133, type: !206)
!935 = !DILocalVariable(name: "line", scope: !927, file: !2, line: 133, type: !237)
!936 = !DILocalVariable(name: "endptr", scope: !927, file: !2, line: 133, type: !237)
!937 = !DILocalVariable(name: "i", scope: !927, file: !2, line: 133, type: !206)
!938 = !DILocalVariable(name: "v", scope: !927, file: !2, line: 133, type: !243)
!939 = distinct !DIAssignID()
!940 = !DILocation(line: 0, scope: !927)
!941 = !DILocation(line: 133, column: 1, scope: !927)
!942 = !DILocation(line: 133, column: 1, scope: !943)
!943 = distinct !DILexicalBlock(scope: !944, file: !2, line: 133, column: 1)
!944 = distinct !DILexicalBlock(scope: !927, file: !2, line: 133, column: 1)
!945 = !DILocation(line: 133, column: 1, scope: !946)
!946 = distinct !DILexicalBlock(scope: !927, file: !2, line: 133, column: 1)
!947 = distinct !DIAssignID()
!948 = !DILocation(line: 133, column: 1, scope: !949)
!949 = distinct !DILexicalBlock(scope: !946, file: !2, line: 133, column: 1)
!950 = !DILocation(line: 133, column: 1, scope: !951)
!951 = distinct !DILexicalBlock(scope: !949, file: !2, line: 133, column: 1)
!952 = !{!953, !953, i64 0}
!953 = !{!"short", !348, i64 0}
!954 = distinct !{!954, !941, !941, !362, !363}
!955 = !DILocation(line: 133, column: 1, scope: !956)
!956 = distinct !DILexicalBlock(scope: !957, file: !2, line: 133, column: 1)
!957 = distinct !DILexicalBlock(scope: !927, file: !2, line: 133, column: 1)
!958 = distinct !DISubprogram(name: "parse_uint32_t_array", scope: !2, file: !2, line: 134, type: !959, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !235, retainedNodes: !962)
!959 = !DISubroutineType(types: !960)
!960 = !{!206, !237, !961, !206}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!962 = !{!963, !964, !965, !966, !967, !968, !969}
!963 = !DILocalVariable(name: "s", arg: 1, scope: !958, file: !2, line: 134, type: !237)
!964 = !DILocalVariable(name: "arr", arg: 2, scope: !958, file: !2, line: 134, type: !961)
!965 = !DILocalVariable(name: "n", arg: 3, scope: !958, file: !2, line: 134, type: !206)
!966 = !DILocalVariable(name: "line", scope: !958, file: !2, line: 134, type: !237)
!967 = !DILocalVariable(name: "endptr", scope: !958, file: !2, line: 134, type: !237)
!968 = !DILocalVariable(name: "i", scope: !958, file: !2, line: 134, type: !206)
!969 = !DILocalVariable(name: "v", scope: !958, file: !2, line: 134, type: !246)
!970 = distinct !DIAssignID()
!971 = !DILocation(line: 0, scope: !958)
!972 = !DILocation(line: 134, column: 1, scope: !958)
!973 = !DILocation(line: 134, column: 1, scope: !974)
!974 = distinct !DILexicalBlock(scope: !975, file: !2, line: 134, column: 1)
!975 = distinct !DILexicalBlock(scope: !958, file: !2, line: 134, column: 1)
!976 = !DILocation(line: 134, column: 1, scope: !977)
