; ModuleID = 'md/grid/md_opt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "riscv64-unknown-linux-gnu"

%struct.dvector_t = type { double, double, double }
%struct.bench_args_t = type { [4 x [4 x [4 x i32]]], [4 x [4 x [4 x [10 x %struct.dvector_t]]]], [4 x [4 x [4 x [10 x %struct.dvector_t]]]] }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str.1 = private unnamed_addr constant [34 x i8] c"fd>1 && \22Invalid file descriptor\22\00", align 1, !dbg !0
@.str.2 = private unnamed_addr constant [23 x i8] c"../../common/support.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.readfile = private unnamed_addr constant [20 x i8] c"char *readfile(int)\00", align 1, !dbg !12
@.str.4 = private unnamed_addr constant [51 x i8] c"0==fstat(fd, &s) && \22Couldn't determine file size\22\00", align 1, !dbg !18
@.str.6 = private unnamed_addr constant [25 x i8] c"len>0 && \22File is empty\22\00", align 1, !dbg !23
@.str.8 = private unnamed_addr constant [29 x i8] c"status>=0 && \22read() failed\22\00", align 1, !dbg !28
@.str.10 = private unnamed_addr constant [33 x i8] c"n>=0 && \22Invalid section number\22\00", align 1, !dbg !33
@__PRETTY_FUNCTION__.find_section_start = private unnamed_addr constant [38 x i8] c"char *find_section_start(char *, int)\00", align 1, !dbg !38

!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 182, type: !99, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !99, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !99, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !118, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 328, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 41)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 7)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !123, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 240, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 30)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 6)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 90)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !40, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !65)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !171, isLocal: true, isDefinition: true)
!170 = !DIFile(filename: "../../common/harness.c", directory: "/home/kelvin/MachSuite/md/grid")
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 57)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !9, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 184, elements: !10)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !170, line: 22, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 11)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !170, line: 24, type: !181, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "INPUT_SIZE", scope: !188, file: !189, line: 4, type: !201, isLocal: false, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C11, file: !189, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !190, globals: !217, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "local_support.c", directory: "/home/kelvin/MachSuite/md/grid")
!190 = !{!191, !215, !216, !209}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bench_args_t", file: !193, line: 37, size: 247808, elements: !194)
!193 = !DIFile(filename: "./md.h", directory: "/home/kelvin/MachSuite/md/grid")
!194 = !{!195, !203, !214}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "n_points", scope: !192, file: !193, line: 38, baseType: !196, size: 2048)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 2048, elements: !202)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !198, line: 26, baseType: !199)
!198 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-intn.h", directory: "")
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !200, line: 41, baseType: !201)
!200 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types.h", directory: "")
!201 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!202 = !{!106, !106, !106}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !192, file: !193, line: 39, baseType: !204, size: 122880, offset: 2048)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 122880, elements: !212)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "dvector_t", file: !193, line: 25, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !193, line: 23, size: 192, elements: !207)
!207 = !{!208, !210, !211}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !206, file: !193, line: 24, baseType: !209, size: 64)
!209 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !206, file: !193, line: 24, baseType: !209, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !206, file: !193, line: 24, baseType: !209, size: 64, offset: 128)
!212 = !{!106, !106, !106, !213}
!213 = !DISubrange(count: 10)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !192, file: !193, line: 40, baseType: !204, size: 122880, offset: 124928)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!217 = !{!186}
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !151)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !223, isLocal: true, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !124)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !170, line: 47, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 12)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !100)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !170, line: 58, type: !30, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !74)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !170, line: 67, type: !35, isLocal: true, isDefinition: true)
!239 = distinct !DICompileUnit(language: DW_LANG_C11, file: !240, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!240 = !DIFile(filename: "md.c", directory: "/home/kelvin/MachSuite/md/grid")
!241 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !242, globals: !268, splitDebugInlining: false, nameTableKind: None)
!242 = !{!243, !4, !244, !245, !249, !252, !255, !258, !261, !197, !264, !267, !209}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !246, line: 24, baseType: !247)
!246 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-uintn.h", directory: "")
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !200, line: 38, baseType: !248)
!248 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !246, line: 25, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !200, line: 40, baseType: !251)
!251 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !246, line: 26, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !200, line: 42, baseType: !254)
!254 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !246, line: 27, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !200, line: 45, baseType: !257)
!257 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !198, line: 24, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !200, line: 37, baseType: !260)
!260 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !198, line: 25, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !200, line: 39, baseType: !263)
!263 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !198, line: 27, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !200, line: 44, baseType: !266)
!266 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!267 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!268 = !{!269, !0, !7, !12, !274, !18, !276, !23, !281, !28, !283, !33, !38, !285, !43, !45, !47, !52, !57, !62, !67, !69, !71, !76, !78, !80, !82, !87, !89, !290, !92, !97, !102, !107, !112, !114, !116, !121, !126, !128, !130, !132, !134, !136, !141, !146, !148, !153, !295, !158, !163, !297, !165}
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !271, isLocal: true, isDefinition: true)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 24)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !30, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !278, isLocal: true, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 14)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !278, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !9, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 21)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !2, line: 154, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 13)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !20, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 27)
!302 = distinct !DICompileUnit(language: DW_LANG_C11, file: !170, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !303, globals: !304, splitDebugInlining: false, nameTableKind: None)
!303 = !{!244}
!304 = !{!305, !168, !174, !176, !179, !184, !307, !218, !309, !221, !224, !311, !229, !232, !316, !234, !237, !318}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !231, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !278, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !220, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 31)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !220, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !170, line: 74, type: !320, isLocal: true, isDefinition: true)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !321)
!321 = !{!213}
!322 = !{!"clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)"}
!323 = !{i32 7, !"Dwarf Version", i32 4}
!324 = !{i32 2, !"Debug Info Version", i32 3}
!325 = !{i32 1, !"wchar_size", i32 4}
!326 = !{i32 1, !"target-abi", !"lp64d"}
!327 = distinct !{i32 6, !"riscv-isa", !328}
!328 = distinct !{!"rv64i2p1_m2p0_a2p1_f2p2_d2p2_zicsr2p0_zifencei2p0"}
!329 = !{i32 8, !"PIC Level", i32 2}
!330 = !{i32 7, !"PIE Level", i32 2}
!331 = !{i32 7, !"uwtable", i32 2}
!332 = !{i32 8, !"SmallDataLimit", i32 8}
!333 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!334 = distinct !DISubprogram(name: "md", scope: !240, file: !240, line: 6, type: !335, scopeLine: 9, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !239, retainedNodes: !349)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !337, !340, !340}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 512, elements: !339)
!339 = !{!106, !106}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 30720, elements: !348)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "dvector_t", file: !193, line: 25, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !193, line: 23, size: 192, elements: !344)
!344 = !{!345, !346, !347}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !343, file: !193, line: 24, baseType: !209, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !343, file: !193, line: 24, baseType: !209, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !343, file: !193, line: 24, baseType: !209, size: 64, offset: 128)
!348 = !{!106, !106, !213}
!349 = !{!350, !351, !352, !353, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !377, !381, !385, !389, !393, !398, !399, !400, !404, !405, !406}
!350 = !DILocalVariable(name: "n_points", arg: 1, scope: !334, file: !240, line: 6, type: !337)
!351 = !DILocalVariable(name: "force", arg: 2, scope: !334, file: !240, line: 7, type: !340)
!352 = !DILocalVariable(name: "position", arg: 3, scope: !334, file: !240, line: 8, type: !340)
!353 = !DILocalVariable(name: "b0", scope: !334, file: !240, line: 10, type: !354)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivector_t", file: !193, line: 28, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !193, line: 26, size: 96, elements: !356)
!356 = !{!357, !358, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !355, file: !193, line: 27, baseType: !197, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !355, file: !193, line: 27, baseType: !197, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !355, file: !193, line: 27, baseType: !197, size: 32, offset: 64)
!360 = !DILocalVariable(name: "b1", scope: !334, file: !240, line: 10, type: !354)
!361 = !DILocalVariable(name: "p", scope: !334, file: !240, line: 11, type: !342)
!362 = !DILocalVariable(name: "q", scope: !334, file: !240, line: 11, type: !342)
!363 = !DILocalVariable(name: "p_idx", scope: !334, file: !240, line: 12, type: !197)
!364 = !DILocalVariable(name: "q_idx", scope: !334, file: !240, line: 12, type: !197)
!365 = !DILocalVariable(name: "dx", scope: !334, file: !240, line: 13, type: !209)
!366 = !DILocalVariable(name: "dy", scope: !334, file: !240, line: 13, type: !209)
!367 = !DILocalVariable(name: "dz", scope: !334, file: !240, line: 13, type: !209)
!368 = !DILocalVariable(name: "r2inv", scope: !334, file: !240, line: 13, type: !209)
!369 = !DILocalVariable(name: "r6inv", scope: !334, file: !240, line: 13, type: !209)
!370 = !DILocalVariable(name: "potential", scope: !334, file: !240, line: 13, type: !209)
!371 = !DILocalVariable(name: "f", scope: !334, file: !240, line: 13, type: !209)
!372 = !DILabel(scope: !334, name: "loop_grid0_x", file: !240, line: 16)
!373 = !DILabel(scope: !374, name: "loop_grid0_y", file: !240, line: 17)
!374 = distinct !DILexicalBlock(scope: !375, file: !240, line: 16, column: 55)
!375 = distinct !DILexicalBlock(scope: !376, file: !240, line: 16, column: 17)
!376 = distinct !DILexicalBlock(scope: !334, file: !240, line: 16, column: 17)
!377 = !DILabel(scope: !378, name: "loop_grid0_z", file: !240, line: 18)
!378 = distinct !DILexicalBlock(scope: !379, file: !240, line: 17, column: 55)
!379 = distinct !DILexicalBlock(scope: !380, file: !240, line: 17, column: 17)
!380 = distinct !DILexicalBlock(scope: !374, file: !240, line: 17, column: 17)
!381 = !DILabel(scope: !382, name: "loop_grid1_x", file: !240, line: 20)
!382 = distinct !DILexicalBlock(scope: !383, file: !240, line: 18, column: 55)
!383 = distinct !DILexicalBlock(scope: !384, file: !240, line: 18, column: 17)
!384 = distinct !DILexicalBlock(scope: !378, file: !240, line: 18, column: 17)
!385 = !DILabel(scope: !386, name: "loop_grid1_y", file: !240, line: 21)
!386 = distinct !DILexicalBlock(scope: !387, file: !240, line: 20, column: 79)
!387 = distinct !DILexicalBlock(scope: !388, file: !240, line: 20, column: 17)
!388 = distinct !DILexicalBlock(scope: !382, file: !240, line: 20, column: 17)
!389 = !DILabel(scope: !390, name: "loop_grid1_z", file: !240, line: 22)
!390 = distinct !DILexicalBlock(scope: !391, file: !240, line: 21, column: 79)
!391 = distinct !DILexicalBlock(scope: !392, file: !240, line: 21, column: 17)
!392 = distinct !DILexicalBlock(scope: !386, file: !240, line: 21, column: 17)
!393 = !DILocalVariable(name: "base_q", scope: !394, file: !240, line: 24, type: !397)
!394 = distinct !DILexicalBlock(scope: !395, file: !240, line: 22, column: 79)
!395 = distinct !DILexicalBlock(scope: !396, file: !240, line: 22, column: 17)
!396 = distinct !DILexicalBlock(scope: !390, file: !240, line: 22, column: 17)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!398 = !DILocalVariable(name: "q_idx_range", scope: !394, file: !240, line: 25, type: !201)
!399 = !DILabel(scope: !394, name: "loop_p", file: !240, line: 26)
!400 = !DILocalVariable(name: "sum_x", scope: !401, file: !240, line: 28, type: !209)
!401 = distinct !DILexicalBlock(scope: !402, file: !240, line: 26, column: 71)
!402 = distinct !DILexicalBlock(scope: !403, file: !240, line: 26, column: 13)
!403 = distinct !DILexicalBlock(scope: !394, file: !240, line: 26, column: 13)
!404 = !DILocalVariable(name: "sum_y", scope: !401, file: !240, line: 29, type: !209)
!405 = !DILocalVariable(name: "sum_z", scope: !401, file: !240, line: 30, type: !209)
!406 = !DILabel(scope: !401, name: "loop_q", file: !240, line: 32)
!407 = !DILocation(line: 0, scope: !334)
!408 = !DILocation(line: 16, column: 3, scope: !334)
!409 = !DILocation(line: 16, column: 17, scope: !376)
!410 = !DILocation(line: 17, column: 17, scope: !380)
!411 = !DILocation(line: 18, column: 17, scope: !384)
!412 = !DILocation(line: 20, column: 3, scope: !382)
!413 = !DILocation(line: 20, column: 17, scope: !388)
!414 = !{!415, !415, i64 0}
!415 = !{!"int", !416, i64 0}
!416 = !{!"omnipotent char", !417, i64 0}
!417 = !{!"Simple C/C++ TBAA"}
!418 = !DILocation(line: 21, column: 3, scope: !386)
!419 = !DILocation(line: 21, column: 17, scope: !392)
!420 = !DILocation(line: 22, column: 3, scope: !390)
!421 = !DILocation(line: 22, column: 17, scope: !396)
!422 = !DILocation(line: 24, column: 25, scope: !394)
!423 = !DILocation(line: 0, scope: !394)
!424 = !DILocation(line: 26, column: 5, scope: !394)
!425 = !DILocation(line: 25, column: 23, scope: !394)
!426 = !DILocation(line: 22, column: 74, scope: !395)
!427 = !DILocation(line: 22, column: 46, scope: !395)
!428 = distinct !{!428, !421, !429, !430, !431}
!429 = !DILocation(line: 55, column: 3, scope: !396)
!430 = !{!"llvm.loop.mustprogress"}
!431 = !{!"llvm.loop.unroll.disable"}
!432 = !DILocation(line: 27, column: 11, scope: !401)
!433 = !DILocation(line: 28, column: 20, scope: !401)
!434 = !DILocation(line: 28, column: 51, scope: !401)
!435 = !DILocation(line: 0, scope: !401)
!436 = !DILocation(line: 29, column: 51, scope: !401)
!437 = !DILocation(line: 30, column: 51, scope: !401)
!438 = !DILocation(line: 32, column: 7, scope: !401)
!439 = !DILocation(line: 32, column: 15, scope: !440)
!440 = distinct !DILexicalBlock(scope: !401, file: !240, line: 32, column: 15)
!441 = !DILocation(line: 33, column: 22, scope: !442)
!442 = distinct !DILexicalBlock(scope: !443, file: !240, line: 32, column: 60)
!443 = distinct !DILexicalBlock(scope: !440, file: !240, line: 32, column: 15)
!444 = !DILocation(line: 33, column: 13, scope: !442)
!445 = !DILocation(line: 36, column: 16, scope: !446)
!446 = distinct !DILexicalBlock(scope: !442, file: !240, line: 36, column: 13)
!447 = !DILocation(line: 36, column: 22, scope: !446)
!448 = !DILocation(line: 38, column: 20, scope: !449)
!449 = distinct !DILexicalBlock(scope: !446, file: !240, line: 36, column: 48)
!450 = !DILocation(line: 39, column: 20, scope: !449)
!451 = !DILocation(line: 40, column: 20, scope: !449)
!452 = !DILocation(line: 41, column: 35, scope: !449)
!453 = !DILocation(line: 41, column: 31, scope: !449)
!454 = !DILocation(line: 41, column: 39, scope: !449)
!455 = !DILocation(line: 41, column: 22, scope: !449)
!456 = !DILocation(line: 42, column: 24, scope: !449)
!457 = !DILocation(line: 42, column: 30, scope: !449)
!458 = !DILocation(line: 43, column: 40, scope: !449)
!459 = !DILocation(line: 43, column: 28, scope: !449)
!460 = !DILocation(line: 45, column: 20, scope: !449)
!461 = !DILocation(line: 46, column: 17, scope: !449)
!462 = !DILocation(line: 47, column: 17, scope: !449)
!463 = !DILocation(line: 48, column: 17, scope: !449)
!464 = !DILocation(line: 49, column: 9, scope: !449)
!465 = !DILocation(line: 32, column: 55, scope: !443)
!466 = !DILocation(line: 32, column: 34, scope: !443)
!467 = distinct !{!467, !439, !468, !430, !431}
!468 = !DILocation(line: 50, column: 7, scope: !440)
!469 = !DILocation(line: 51, column: 40, scope: !401)
!470 = !{!471, !472, i64 0}
!471 = !{!"", !472, i64 0, !472, i64 8, !472, i64 16}
!472 = !{!"double", !416, i64 0}
!473 = !DILocation(line: 52, column: 40, scope: !401)
!474 = !{!471, !472, i64 8}
!475 = !DILocation(line: 53, column: 40, scope: !401)
!476 = !{!471, !472, i64 16}
!477 = !DILocation(line: 26, column: 66, scope: !402)
!478 = !DILocation(line: 26, column: 32, scope: !402)
!479 = !DILocation(line: 26, column: 13, scope: !403)
!480 = distinct !{!480, !479, !481, !430, !431}
!481 = !DILocation(line: 54, column: 5, scope: !403)
!482 = !DILocation(line: 21, column: 74, scope: !391)
!483 = !DILocation(line: 21, column: 46, scope: !391)
!484 = distinct !{!484, !419, !485, !430, !431}
!485 = !DILocation(line: 55, column: 4, scope: !392)
!486 = !DILocation(line: 20, column: 74, scope: !387)
!487 = !DILocation(line: 20, column: 46, scope: !387)
!488 = distinct !{!488, !413, !489, !430, !431}
!489 = !DILocation(line: 55, column: 5, scope: !388)
!490 = !DILocation(line: 18, column: 50, scope: !383)
!491 = !DILocation(line: 18, column: 34, scope: !383)
!492 = distinct !{!492, !411, !493, !430, !431}
!493 = !DILocation(line: 56, column: 3, scope: !384)
!494 = !DILocation(line: 17, column: 50, scope: !379)
!495 = !DILocation(line: 17, column: 34, scope: !379)
!496 = distinct !{!496, !410, !497, !430, !431}
!497 = !DILocation(line: 56, column: 4, scope: !380)
!498 = !DILocation(line: 16, column: 50, scope: !375)
!499 = !DILocation(line: 16, column: 34, scope: !375)
!500 = distinct !{!500, !409, !501, !430, !431}
!501 = !DILocation(line: 56, column: 5, scope: !376)
!502 = !DILocation(line: 57, column: 1, scope: !334)
!503 = distinct !DISubprogram(name: "run_benchmark", scope: !189, file: !189, line: 8, type: !504, scopeLine: 8, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !506)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !244}
!506 = !{!507, !508}
!507 = !DILocalVariable(name: "vargs", arg: 1, scope: !503, file: !189, line: 8, type: !244)
!508 = !DILocalVariable(name: "args", scope: !503, file: !189, line: 9, type: !191)
!509 = !DILocation(line: 0, scope: !503)
!510 = !DILocation(line: 10, column: 29, scope: !503)
!511 = !DILocation(line: 10, column: 42, scope: !503)
!512 = !DILocation(line: 10, column: 3, scope: !503)
!513 = !DILocation(line: 11, column: 1, scope: !503)
!514 = distinct !DISubprogram(name: "input_to_data", scope: !189, file: !189, line: 20, type: !515, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !517)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !201, !244}
!517 = !{!518, !519, !520, !521, !522}
!518 = !DILocalVariable(name: "fd", arg: 1, scope: !514, file: !189, line: 20, type: !201)
!519 = !DILocalVariable(name: "vdata", arg: 2, scope: !514, file: !189, line: 20, type: !244)
!520 = !DILocalVariable(name: "data", scope: !514, file: !189, line: 21, type: !191)
!521 = !DILocalVariable(name: "p", scope: !514, file: !189, line: 22, type: !243)
!522 = !DILocalVariable(name: "s", scope: !514, file: !189, line: 22, type: !243)
!523 = !DILocation(line: 0, scope: !514)
!524 = !DILocation(line: 24, column: 3, scope: !514)
!525 = !DILocation(line: 26, column: 7, scope: !514)
!526 = !DILocalVariable(name: "s", arg: 1, scope: !527, file: !2, line: 56, type: !243)
!527 = distinct !DISubprogram(name: "find_section_start", scope: !2, file: !2, line: 56, type: !528, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !241, retainedNodes: !530)
!528 = !DISubroutineType(types: !529)
!529 = !{!243, !243, !201}
!530 = !{!526, !531, !532}
!531 = !DILocalVariable(name: "n", arg: 2, scope: !527, file: !2, line: 56, type: !201)
!532 = !DILocalVariable(name: "i", scope: !527, file: !2, line: 57, type: !201)
!533 = !DILocation(line: 0, scope: !527, inlinedAt: !534)
!534 = distinct !DILocation(line: 28, column: 7, scope: !514)
!535 = !DILocation(line: 64, column: 17, scope: !527, inlinedAt: !534)
!536 = !{!416, !416, i64 0}
!537 = !DILocation(line: 64, column: 3, scope: !527, inlinedAt: !534)
!538 = !DILocation(line: 66, column: 22, scope: !539, inlinedAt: !534)
!539 = distinct !DILexicalBlock(scope: !540, file: !2, line: 66, column: 9)
!540 = distinct !DILexicalBlock(scope: !527, file: !2, line: 64, column: 31)
!541 = !DILocation(line: 66, column: 26, scope: !539, inlinedAt: !534)
!542 = !DILocation(line: 66, column: 32, scope: !539, inlinedAt: !534)
!543 = !DILocation(line: 66, column: 35, scope: !539, inlinedAt: !534)
!544 = !DILocation(line: 66, column: 39, scope: !539, inlinedAt: !534)
!545 = !DILocation(line: 66, column: 9, scope: !540, inlinedAt: !534)
!546 = !DILocation(line: 69, column: 6, scope: !540, inlinedAt: !534)
!547 = !DILocation(line: 64, column: 10, scope: !527, inlinedAt: !534)
!548 = !DILocation(line: 64, column: 13, scope: !527, inlinedAt: !534)
!549 = distinct !{!549, !537, !550, !430, !431}
!550 = !DILocation(line: 70, column: 3, scope: !527, inlinedAt: !534)
!551 = !DILocation(line: 71, column: 6, scope: !552, inlinedAt: !534)
!552 = distinct !DILexicalBlock(scope: !527, file: !2, line: 71, column: 6)
!553 = !DILocation(line: 71, column: 8, scope: !552, inlinedAt: !534)
!554 = !DILocation(line: 71, column: 6, scope: !527, inlinedAt: !534)
!555 = !DILocation(line: 29, column: 3, scope: !514)
!556 = !DILocation(line: 0, scope: !527, inlinedAt: !557)
!557 = distinct !DILocation(line: 31, column: 7, scope: !514)
!558 = !DILocation(line: 64, column: 17, scope: !527, inlinedAt: !557)
!559 = !DILocation(line: 64, column: 3, scope: !527, inlinedAt: !557)
!560 = !DILocation(line: 66, column: 22, scope: !539, inlinedAt: !557)
!561 = !DILocation(line: 66, column: 26, scope: !539, inlinedAt: !557)
!562 = !DILocation(line: 66, column: 32, scope: !539, inlinedAt: !557)
!563 = !DILocation(line: 66, column: 35, scope: !539, inlinedAt: !557)
!564 = !DILocation(line: 66, column: 39, scope: !539, inlinedAt: !557)
!565 = !DILocation(line: 66, column: 9, scope: !540, inlinedAt: !557)
!566 = !DILocation(line: 69, column: 6, scope: !540, inlinedAt: !557)
!567 = !DILocation(line: 64, column: 10, scope: !527, inlinedAt: !557)
!568 = !DILocation(line: 64, column: 13, scope: !527, inlinedAt: !557)
!569 = distinct !{!569, !559, !570, !430, !431}
!570 = !DILocation(line: 70, column: 3, scope: !527, inlinedAt: !557)
!571 = !DILocation(line: 71, column: 6, scope: !552, inlinedAt: !557)
!572 = !DILocation(line: 71, column: 8, scope: !552, inlinedAt: !557)
!573 = !DILocation(line: 71, column: 6, scope: !527, inlinedAt: !557)
!574 = !DILocation(line: 32, column: 48, scope: !514)
!575 = !DILocation(line: 32, column: 3, scope: !514)
!576 = !DILocation(line: 33, column: 3, scope: !514)
!577 = !DILocation(line: 34, column: 1, scope: !514)
!578 = !DISubprogram(name: "free", scope: !579, file: !579, line: 687, type: !504, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!579 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdlib.h", directory: "")
!580 = distinct !DISubprogram(name: "data_to_input", scope: !189, file: !189, line: 36, type: !515, scopeLine: 36, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !581)
!581 = !{!582, !583, !584}
!582 = !DILocalVariable(name: "fd", arg: 1, scope: !580, file: !189, line: 36, type: !201)
!583 = !DILocalVariable(name: "vdata", arg: 2, scope: !580, file: !189, line: 36, type: !244)
!584 = !DILocalVariable(name: "data", scope: !580, file: !189, line: 37, type: !191)
!585 = !DILocation(line: 0, scope: !580)
!586 = !DILocalVariable(name: "fd", arg: 1, scope: !587, file: !2, line: 189, type: !201)
!587 = distinct !DISubprogram(name: "write_section_header", scope: !2, file: !2, line: 189, type: !588, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !241, retainedNodes: !590)
!588 = !DISubroutineType(types: !589)
!589 = !{!201, !201}
!590 = !{!586}
!591 = !DILocation(line: 0, scope: !587, inlinedAt: !592)
!592 = distinct !DILocation(line: 39, column: 3, scope: !580)
!593 = !DILocation(line: 190, column: 3, scope: !594, inlinedAt: !592)
!594 = distinct !DILexicalBlock(scope: !595, file: !2, line: 190, column: 3)
!595 = distinct !DILexicalBlock(scope: !587, file: !2, line: 190, column: 3)
!596 = !DILocation(line: 191, column: 3, scope: !587, inlinedAt: !592)
!597 = !DILocalVariable(name: "fd", arg: 1, scope: !598, file: !2, line: 183, type: !201)
!598 = distinct !DISubprogram(name: "write_int32_t_array", scope: !2, file: !2, line: 183, type: !599, scopeLine: 183, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !241, retainedNodes: !601)
!599 = !DISubroutineType(types: !600)
!600 = !{!201, !201, !215, !201}
!601 = !{!597, !602, !603, !604}
!602 = !DILocalVariable(name: "arr", arg: 2, scope: !598, file: !2, line: 183, type: !215)
!603 = !DILocalVariable(name: "n", arg: 3, scope: !598, file: !2, line: 183, type: !201)
!604 = !DILocalVariable(name: "i", scope: !598, file: !2, line: 183, type: !201)
!605 = !DILocation(line: 0, scope: !598, inlinedAt: !606)
!606 = distinct !DILocation(line: 40, column: 3, scope: !580)
!607 = !DILocation(line: 183, column: 1, scope: !608, inlinedAt: !606)
!608 = distinct !DILexicalBlock(scope: !598, file: !2, line: 183, column: 1)
!609 = !DILocation(line: 183, column: 1, scope: !610, inlinedAt: !606)
!610 = distinct !DILexicalBlock(scope: !611, file: !2, line: 183, column: 1)
!611 = distinct !DILexicalBlock(scope: !608, file: !2, line: 183, column: 1)
!612 = !DILocation(line: 183, column: 1, scope: !611, inlinedAt: !606)
!613 = distinct !{!613, !607, !607, !430, !431}
!614 = !DILocation(line: 0, scope: !587, inlinedAt: !615)
!615 = distinct !DILocation(line: 42, column: 3, scope: !580)
!616 = !DILocation(line: 191, column: 3, scope: !587, inlinedAt: !615)
!617 = !DILocation(line: 43, column: 49, scope: !580)
!618 = !DILocalVariable(name: "fd", arg: 1, scope: !619, file: !2, line: 187, type: !201)
!619 = distinct !DISubprogram(name: "write_double_array", scope: !2, file: !2, line: 187, type: !620, scopeLine: 187, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !241, retainedNodes: !622)
!620 = !DISubroutineType(types: !621)
!621 = !{!201, !201, !216, !201}
!622 = !{!618, !623, !624, !625}
!623 = !DILocalVariable(name: "arr", arg: 2, scope: !619, file: !2, line: 187, type: !216)
!624 = !DILocalVariable(name: "n", arg: 3, scope: !619, file: !2, line: 187, type: !201)
!625 = !DILocalVariable(name: "i", scope: !619, file: !2, line: 187, type: !201)
!626 = !DILocation(line: 0, scope: !619, inlinedAt: !627)
!627 = distinct !DILocation(line: 43, column: 3, scope: !580)
!628 = !DILocation(line: 187, column: 1, scope: !629, inlinedAt: !627)
!629 = distinct !DILexicalBlock(scope: !619, file: !2, line: 187, column: 1)
!630 = !DILocation(line: 187, column: 1, scope: !631, inlinedAt: !627)
!631 = distinct !DILexicalBlock(scope: !632, file: !2, line: 187, column: 1)
!632 = distinct !DILexicalBlock(scope: !629, file: !2, line: 187, column: 1)
!633 = !{!472, !472, i64 0}
!634 = !DILocation(line: 187, column: 1, scope: !632, inlinedAt: !627)
!635 = distinct !{!635, !628, !628, !430, !431}
!636 = !DILocation(line: 45, column: 1, scope: !580)
!637 = distinct !DISubprogram(name: "output_to_data", scope: !189, file: !189, line: 52, type: !515, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !638)
!638 = !{!639, !640, !641, !642, !643}
!639 = !DILocalVariable(name: "fd", arg: 1, scope: !637, file: !189, line: 52, type: !201)
!640 = !DILocalVariable(name: "vdata", arg: 2, scope: !637, file: !189, line: 52, type: !244)
!641 = !DILocalVariable(name: "data", scope: !637, file: !189, line: 53, type: !191)
!642 = !DILocalVariable(name: "p", scope: !637, file: !189, line: 54, type: !243)
!643 = !DILocalVariable(name: "s", scope: !637, file: !189, line: 54, type: !243)
!644 = !DILocation(line: 0, scope: !637)
!645 = !DILocation(line: 56, column: 3, scope: !637)
!646 = !DILocation(line: 58, column: 7, scope: !637)
!647 = !DILocation(line: 0, scope: !527, inlinedAt: !648)
!648 = distinct !DILocation(line: 60, column: 7, scope: !637)
!649 = !DILocation(line: 64, column: 17, scope: !527, inlinedAt: !648)
!650 = !DILocation(line: 64, column: 3, scope: !527, inlinedAt: !648)
!651 = !DILocation(line: 66, column: 22, scope: !539, inlinedAt: !648)
!652 = !DILocation(line: 66, column: 26, scope: !539, inlinedAt: !648)
!653 = !DILocation(line: 66, column: 32, scope: !539, inlinedAt: !648)
!654 = !DILocation(line: 66, column: 35, scope: !539, inlinedAt: !648)
!655 = !DILocation(line: 66, column: 39, scope: !539, inlinedAt: !648)
!656 = !DILocation(line: 66, column: 9, scope: !540, inlinedAt: !648)
!657 = !DILocation(line: 69, column: 6, scope: !540, inlinedAt: !648)
!658 = !DILocation(line: 64, column: 10, scope: !527, inlinedAt: !648)
!659 = !DILocation(line: 64, column: 13, scope: !527, inlinedAt: !648)
!660 = distinct !{!660, !650, !661, !430, !431}
!661 = !DILocation(line: 70, column: 3, scope: !527, inlinedAt: !648)
!662 = !DILocation(line: 71, column: 6, scope: !552, inlinedAt: !648)
!663 = !DILocation(line: 71, column: 8, scope: !552, inlinedAt: !648)
!664 = !DILocation(line: 71, column: 6, scope: !527, inlinedAt: !648)
!665 = !DILocation(line: 61, column: 47, scope: !637)
!666 = !DILocation(line: 61, column: 3, scope: !637)
!667 = !DILocation(line: 62, column: 3, scope: !637)
!668 = !DILocation(line: 63, column: 1, scope: !637)
!669 = distinct !DISubprogram(name: "data_to_output", scope: !189, file: !189, line: 65, type: !515, scopeLine: 65, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !670)
!670 = !{!671, !672, !673}
!671 = !DILocalVariable(name: "fd", arg: 1, scope: !669, file: !189, line: 65, type: !201)
!672 = !DILocalVariable(name: "vdata", arg: 2, scope: !669, file: !189, line: 65, type: !244)
!673 = !DILocalVariable(name: "data", scope: !669, file: !189, line: 66, type: !191)
!674 = !DILocation(line: 0, scope: !669)
!675 = !DILocation(line: 0, scope: !587, inlinedAt: !676)
!676 = distinct !DILocation(line: 68, column: 3, scope: !669)
!677 = !DILocation(line: 190, column: 3, scope: !594, inlinedAt: !676)
!678 = !DILocation(line: 191, column: 3, scope: !587, inlinedAt: !676)
!679 = !DILocation(line: 69, column: 48, scope: !669)
!680 = !DILocation(line: 0, scope: !619, inlinedAt: !681)
!681 = distinct !DILocation(line: 69, column: 3, scope: !669)
!682 = !DILocation(line: 187, column: 1, scope: !629, inlinedAt: !681)
!683 = !DILocation(line: 187, column: 1, scope: !631, inlinedAt: !681)
!684 = !DILocation(line: 187, column: 1, scope: !632, inlinedAt: !681)
!685 = distinct !{!685, !682, !682, !430, !431}
!686 = !DILocation(line: 70, column: 1, scope: !669)
!687 = distinct !DISubprogram(name: "check_data", scope: !189, file: !189, line: 72, type: !688, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !690)
!688 = !DISubroutineType(types: !689)
!689 = !{!201, !244, !244}
!690 = !{!691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702}
!691 = !DILocalVariable(name: "vdata", arg: 1, scope: !687, file: !189, line: 72, type: !244)
!692 = !DILocalVariable(name: "vref", arg: 2, scope: !687, file: !189, line: 72, type: !244)
!693 = !DILocalVariable(name: "data", scope: !687, file: !189, line: 73, type: !191)
!694 = !DILocalVariable(name: "ref", scope: !687, file: !189, line: 74, type: !191)
!695 = !DILocalVariable(name: "has_errors", scope: !687, file: !189, line: 75, type: !201)
!696 = !DILocalVariable(name: "i", scope: !687, file: !189, line: 76, type: !201)
!697 = !DILocalVariable(name: "j", scope: !687, file: !189, line: 76, type: !201)
!698 = !DILocalVariable(name: "k", scope: !687, file: !189, line: 76, type: !201)
!699 = !DILocalVariable(name: "d", scope: !687, file: !189, line: 76, type: !201)
!700 = !DILocalVariable(name: "diff_x", scope: !687, file: !189, line: 77, type: !209)
!701 = !DILocalVariable(name: "diff_y", scope: !687, file: !189, line: 77, type: !209)
!702 = !DILocalVariable(name: "diff_z", scope: !687, file: !189, line: 77, type: !209)
!703 = !DILocation(line: 0, scope: !687)
!704 = !DILocation(line: 79, column: 3, scope: !705)
!705 = distinct !DILexicalBlock(scope: !687, file: !189, line: 79, column: 3)
!706 = !DILocation(line: 80, column: 5, scope: !707)
!707 = distinct !DILexicalBlock(scope: !708, file: !189, line: 80, column: 5)
!708 = distinct !DILexicalBlock(scope: !709, file: !189, line: 79, column: 30)
!709 = distinct !DILexicalBlock(scope: !705, file: !189, line: 79, column: 3)
!710 = !DILocation(line: 81, column: 7, scope: !711)
!711 = distinct !DILexicalBlock(scope: !712, file: !189, line: 81, column: 7)
!712 = distinct !DILexicalBlock(scope: !713, file: !189, line: 80, column: 32)
!713 = distinct !DILexicalBlock(scope: !707, file: !189, line: 80, column: 5)
!714 = !DILocation(line: 82, column: 9, scope: !715)
!715 = distinct !DILexicalBlock(scope: !716, file: !189, line: 82, column: 9)
!716 = distinct !DILexicalBlock(scope: !717, file: !189, line: 81, column: 34)
!717 = distinct !DILexicalBlock(scope: !711, file: !189, line: 81, column: 7)
!718 = !DILocation(line: 83, column: 20, scope: !719)
!719 = distinct !DILexicalBlock(scope: !720, file: !189, line: 82, column: 40)
!720 = distinct !DILexicalBlock(scope: !715, file: !189, line: 82, column: 9)
!721 = !DILocation(line: 83, column: 44, scope: !719)
!722 = !DILocation(line: 83, column: 48, scope: !719)
!723 = !DILocation(line: 83, column: 71, scope: !719)
!724 = !DILocation(line: 83, column: 46, scope: !719)
!725 = !DILocation(line: 84, column: 44, scope: !719)
!726 = !DILocation(line: 84, column: 71, scope: !719)
!727 = !DILocation(line: 84, column: 46, scope: !719)
!728 = !DILocation(line: 85, column: 44, scope: !719)
!729 = !DILocation(line: 85, column: 71, scope: !719)
!730 = !DILocation(line: 85, column: 46, scope: !719)
!731 = !DILocation(line: 86, column: 43, scope: !719)
!732 = !DILocation(line: 87, column: 43, scope: !719)
!733 = !DILocation(line: 87, column: 22, scope: !719)
!734 = !DILocation(line: 88, column: 43, scope: !719)
!735 = !DILocation(line: 88, column: 22, scope: !719)
!736 = !DILocation(line: 82, column: 36, scope: !720)
!737 = !DILocation(line: 82, column: 19, scope: !720)
!738 = distinct !{!738, !714, !739, !430, !431}
!739 = !DILocation(line: 89, column: 9, scope: !715)
!740 = !DILocation(line: 81, column: 30, scope: !717)
!741 = !DILocation(line: 81, column: 17, scope: !717)
!742 = distinct !{!742, !710, !743, !430, !431}
!743 = !DILocation(line: 90, column: 7, scope: !711)
!744 = !DILocation(line: 80, column: 28, scope: !713)
!745 = !DILocation(line: 80, column: 15, scope: !713)
!746 = distinct !{!746, !706, !747, !430, !431}
!747 = !DILocation(line: 91, column: 5, scope: !707)
!748 = !DILocation(line: 79, column: 26, scope: !709)
!749 = !DILocation(line: 79, column: 13, scope: !709)
!750 = distinct !{!750, !704, !751, !430, !431}
!751 = !DILocation(line: 92, column: 3, scope: !705)
!752 = !DILocation(line: 95, column: 10, scope: !687)
!753 = !DILocation(line: 95, column: 3, scope: !687)
!754 = distinct !DISubprogram(name: "readfile", scope: !2, file: !2, line: 34, type: !755, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !241, retainedNodes: !757)
!755 = !DISubroutineType(types: !756)
!756 = !{!243, !201}
!757 = !{!758, !759, !760, !797, !800, !803}
!758 = !DILocalVariable(name: "fd", arg: 1, scope: !754, file: !2, line: 34, type: !201)
!759 = !DILocalVariable(name: "p", scope: !754, file: !2, line: 35, type: !243)
!760 = !DILocalVariable(name: "s", scope: !754, file: !2, line: 36, type: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !762, line: 44, size: 1024, elements: !763)
!762 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/struct_stat.h", directory: "")
!763 = !{!764, !766, !768, !770, !772, !774, !776, !777, !778, !780, !782, !783, !785, !793, !794, !795}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !761, file: !762, line: 46, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !200, line: 145, baseType: !257)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !761, file: !762, line: 47, baseType: !767, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !200, line: 148, baseType: !257)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !761, file: !762, line: 48, baseType: !769, size: 32, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !200, line: 150, baseType: !254)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !761, file: !762, line: 49, baseType: !771, size: 32, offset: 160)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !200, line: 151, baseType: !254)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !761, file: !762, line: 50, baseType: !773, size: 32, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !200, line: 146, baseType: !254)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !761, file: !762, line: 51, baseType: !775, size: 32, offset: 224)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !200, line: 147, baseType: !254)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !761, file: !762, line: 52, baseType: !765, size: 64, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !761, file: !762, line: 53, baseType: !765, size: 64, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !761, file: !762, line: 54, baseType: !779, size: 64, offset: 384)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !200, line: 152, baseType: !266)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !761, file: !762, line: 55, baseType: !781, size: 32, offset: 448)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !200, line: 175, baseType: !201)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !761, file: !762, line: 56, baseType: !201, size: 32, offset: 480)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !761, file: !762, line: 57, baseType: !784, size: 64, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !200, line: 180, baseType: !266)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !761, file: !762, line: 65, baseType: !786, size: 128, offset: 576)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !787, line: 11, size: 128, elements: !788)
!787 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_timespec.h", directory: "")
!788 = !{!789, !791}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !786, file: !787, line: 16, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !200, line: 160, baseType: !266)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !786, file: !787, line: 21, baseType: !792, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !200, line: 197, baseType: !266)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !761, file: !762, line: 66, baseType: !786, size: 128, offset: 704)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !761, file: !762, line: 67, baseType: !786, size: 128, offset: 832)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !761, file: !762, line: 79, baseType: !796, size: 64, offset: 960)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 64, elements: !55)
!797 = !DILocalVariable(name: "len", scope: !754, file: !2, line: 37, type: !798)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !799, line: 85, baseType: !779)
!799 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/types.h", directory: "")
!800 = !DILocalVariable(name: "bytes_read", scope: !754, file: !2, line: 38, type: !801)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !799, line: 108, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !200, line: 194, baseType: !266)
!803 = !DILocalVariable(name: "status", scope: !754, file: !2, line: 38, type: !801)
!804 = distinct !DIAssignID()
!805 = !DILocation(line: 0, scope: !754)
!806 = !DILocation(line: 36, column: 3, scope: !754)
!807 = !DILocation(line: 40, column: 3, scope: !808)
!808 = distinct !DILexicalBlock(scope: !809, file: !2, line: 40, column: 3)
!809 = distinct !DILexicalBlock(scope: !754, file: !2, line: 40, column: 3)
!810 = !DILocation(line: 41, column: 3, scope: !811)
!811 = distinct !DILexicalBlock(scope: !812, file: !2, line: 41, column: 3)
!812 = distinct !DILexicalBlock(scope: !754, file: !2, line: 41, column: 3)
!813 = !DILocation(line: 42, column: 11, scope: !754)
!814 = !DILocation(line: 43, column: 3, scope: !815)
!815 = distinct !DILexicalBlock(scope: !816, file: !2, line: 43, column: 3)
!816 = distinct !DILexicalBlock(scope: !754, file: !2, line: 43, column: 3)
!817 = !DILocation(line: 44, column: 25, scope: !754)
!818 = !DILocation(line: 44, column: 15, scope: !754)
!819 = !DILocation(line: 46, column: 3, scope: !754)
!820 = !DILocation(line: 49, column: 15, scope: !821)
!821 = distinct !DILexicalBlock(scope: !754, file: !2, line: 46, column: 27)
!822 = !DILocation(line: 46, column: 20, scope: !754)
!823 = distinct !{!823, !819, !824, !430, !431}
!824 = !DILocation(line: 50, column: 3, scope: !754)
!825 = !DILocation(line: 47, column: 24, scope: !821)
!826 = !DILocation(line: 47, column: 42, scope: !821)
!827 = !DILocation(line: 47, column: 14, scope: !821)
!828 = !DILocation(line: 48, column: 5, scope: !829)
!829 = distinct !DILexicalBlock(scope: !830, file: !2, line: 48, column: 5)
!830 = distinct !DILexicalBlock(scope: !821, file: !2, line: 48, column: 5)
!831 = !DILocation(line: 51, column: 3, scope: !754)
!832 = !DILocation(line: 51, column: 10, scope: !754)
!833 = !DILocation(line: 52, column: 3, scope: !754)
!834 = !DILocation(line: 54, column: 1, scope: !754)
!835 = !DILocation(line: 53, column: 3, scope: !754)
!836 = !DISubprogram(name: "__assert_fail", scope: !837, file: !837, line: 67, type: !838, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!837 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/assert.h", directory: "")
!838 = !DISubroutineType(types: !839)
!839 = !{null, !840, !840, !254, !840}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!841 = !DISubprogram(name: "fstat", scope: !842, file: !842, line: 210, type: !843, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!842 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/stat.h", directory: "")
!843 = !DISubroutineType(types: !844)
!844 = !{!201, !201, !845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!846 = !DISubprogram(name: "malloc", scope: !579, file: !579, line: 672, type: !847, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!847 = !DISubroutineType(types: !848)
!848 = !{!244, !849}
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !850, line: 18, baseType: !257)
!850 = !DIFile(filename: "/opt/riscv/lib/clang/18/include/__stddef_size_t.h", directory: "")
!851 = !DISubprogram(name: "read", scope: !852, file: !852, line: 371, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!852 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/unistd.h", directory: "")
!853 = !DISubroutineType(types: !854)
!854 = !{!801, !201, !244, !849}
!855 = !DISubprogram(name: "close", scope: !852, file: !852, line: 358, type: !588, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!856 = !DILocation(line: 0, scope: !527)
!857 = !DILocation(line: 59, column: 3, scope: !858)
!858 = distinct !DILexicalBlock(scope: !859, file: !2, line: 59, column: 3)
!859 = distinct !DILexicalBlock(scope: !527, file: !2, line: 59, column: 3)
!860 = !DILocation(line: 60, column: 7, scope: !861)
!861 = distinct !DILexicalBlock(scope: !527, file: !2, line: 60, column: 6)
!862 = !DILocation(line: 60, column: 6, scope: !527)
!863 = !DILocation(line: 64, column: 17, scope: !527)
!864 = !DILocation(line: 64, column: 3, scope: !527)
!865 = !DILocation(line: 66, column: 22, scope: !539)
!866 = !DILocation(line: 66, column: 26, scope: !539)
!867 = !DILocation(line: 66, column: 32, scope: !539)
!868 = !DILocation(line: 66, column: 35, scope: !539)
!869 = !DILocation(line: 66, column: 39, scope: !539)
!870 = !DILocation(line: 66, column: 9, scope: !540)
!871 = !DILocation(line: 69, column: 6, scope: !540)
!872 = !DILocation(line: 64, column: 10, scope: !527)
!873 = !DILocation(line: 64, column: 13, scope: !527)
!874 = distinct !{!874, !864, !875, !430, !431}
!875 = !DILocation(line: 70, column: 3, scope: !527)
!876 = !DILocation(line: 71, column: 6, scope: !552)
!877 = !DILocation(line: 71, column: 8, scope: !552)
!878 = !DILocation(line: 71, column: 6, scope: !527)
!879 = !DILocation(line: 74, column: 1, scope: !527)
!880 = distinct !DISubprogram(name: "parse_string", scope: !2, file: !2, line: 77, type: !881, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !241, retainedNodes: !883)
!881 = !DISubroutineType(types: !882)
!882 = !{!201, !243, !243, !201}
!883 = !{!884, !885, !886, !887}
!884 = !DILocalVariable(name: "s", arg: 1, scope: !880, file: !2, line: 77, type: !243)
!885 = !DILocalVariable(name: "arr", arg: 2, scope: !880, file: !2, line: 77, type: !243)
!886 = !DILocalVariable(name: "n", arg: 3, scope: !880, file: !2, line: 77, type: !201)
!887 = !DILocalVariable(name: "k", scope: !880, file: !2, line: 78, type: !201)
!888 = !DILocation(line: 0, scope: !880)
!889 = !DILocation(line: 79, column: 3, scope: !890)
!890 = distinct !DILexicalBlock(scope: !891, file: !2, line: 79, column: 3)
!891 = distinct !DILexicalBlock(scope: !880, file: !2, line: 79, column: 3)
!892 = !DILocation(line: 81, column: 8, scope: !893)
!893 = distinct !DILexicalBlock(scope: !880, file: !2, line: 81, column: 7)
!894 = !DILocation(line: 81, column: 7, scope: !880)
!895 = !DILocation(line: 83, column: 12, scope: !896)
!896 = distinct !DILexicalBlock(scope: !893, file: !2, line: 81, column: 13)
!897 = !DILocation(line: 83, column: 5, scope: !896)
!898 = !DILocation(line: 91, column: 19, scope: !880)
!899 = !DILocation(line: 91, column: 3, scope: !880)
!900 = !DILocation(line: 92, column: 7, scope: !880)
!901 = !DILocation(line: 83, column: 16, scope: !896)
!902 = !DILocation(line: 83, column: 26, scope: !896)
!903 = !DILocation(line: 83, column: 32, scope: !896)
!904 = !DILocation(line: 83, column: 29, scope: !896)
!905 = !DILocation(line: 83, column: 35, scope: !896)
!906 = !DILocation(line: 83, column: 45, scope: !896)
!907 = !DILocation(line: 83, column: 48, scope: !896)
!908 = !DILocation(line: 83, column: 54, scope: !896)
!909 = !DILocation(line: 84, column: 9, scope: !896)
!910 = !DILocation(line: 84, column: 18, scope: !896)
!911 = !DILocation(line: 84, column: 26, scope: !896)
!912 = distinct !{!912, !897, !913, !430, !431}
!913 = !DILocation(line: 86, column: 5, scope: !896)
!914 = !DILocation(line: 93, column: 5, scope: !915)
!915 = distinct !DILexicalBlock(scope: !880, file: !2, line: 92, column: 7)
!916 = !DILocation(line: 93, column: 12, scope: !915)
!917 = !DILocation(line: 95, column: 3, scope: !880)
!918 = distinct !DISubprogram(name: "parse_uint8_t_array", scope: !2, file: !2, line: 132, type: !919, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !241, retainedNodes: !922)
!919 = !DISubroutineType(types: !920)
!920 = !{!201, !243, !921, !201}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!922 = !{!923, !924, !925, !926, !927, !928, !929}
!923 = !DILocalVariable(name: "s", arg: 1, scope: !918, file: !2, line: 132, type: !243)
!924 = !DILocalVariable(name: "arr", arg: 2, scope: !918, file: !2, line: 132, type: !921)
!925 = !DILocalVariable(name: "n", arg: 3, scope: !918, file: !2, line: 132, type: !201)
!926 = !DILocalVariable(name: "line", scope: !918, file: !2, line: 132, type: !243)
!927 = !DILocalVariable(name: "endptr", scope: !918, file: !2, line: 132, type: !243)
!928 = !DILocalVariable(name: "i", scope: !918, file: !2, line: 132, type: !201)
!929 = !DILocalVariable(name: "v", scope: !918, file: !2, line: 132, type: !245)
!930 = distinct !DIAssignID()
!931 = !DILocation(line: 0, scope: !918)
!932 = !DILocation(line: 132, column: 1, scope: !918)
!933 = !DILocation(line: 132, column: 1, scope: !934)
!934 = distinct !DILexicalBlock(scope: !935, file: !2, line: 132, column: 1)
!935 = distinct !DILexicalBlock(scope: !918, file: !2, line: 132, column: 1)
!936 = !DILocation(line: 132, column: 1, scope: !937)
!937 = distinct !DILexicalBlock(scope: !918, file: !2, line: 132, column: 1)
!938 = !{!939, !939, i64 0}
!939 = !{!"any pointer", !416, i64 0}
!940 = distinct !DIAssignID()
!941 = !DILocation(line: 132, column: 1, scope: !942)
!942 = distinct !DILexicalBlock(scope: !937, file: !2, line: 132, column: 1)
!943 = !DILocation(line: 132, column: 1, scope: !944)
!944 = distinct !DILexicalBlock(scope: !942, file: !2, line: 132, column: 1)
!945 = distinct !{!945, !932, !932, !430, !431}
!946 = !DILocation(line: 132, column: 1, scope: !947)
!947 = distinct !DILexicalBlock(scope: !948, file: !2, line: 132, column: 1)
!948 = distinct !DILexicalBlock(scope: !918, file: !2, line: 132, column: 1)
!949 = !DISubprogram(name: "strtok", scope: !950, file: !950, line: 356, type: !951, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!950 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/string.h", directory: "")
!951 = !DISubroutineType(types: !952)
!952 = !{!243, !953, !954}
!953 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !243)
!954 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !840)
!955 = !DISubprogram(name: "strtol", scope: !579, file: !579, line: 177, type: !956, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!956 = !DISubroutineType(types: !957)
!957 = !{!266, !954, !958, !201}
!958 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!960 = !DISubprogram(name: "fprintf", scope: !961, file: !961, line: 357, type: !962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!961 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdio.h", directory: "")
!962 = !DISubroutineType(types: !963)
!963 = !{!201, !964, !954, null}
!964 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !967, line: 7, baseType: !968)
!967 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/FILE.h", directory: "")
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !969, line: 49, size: 1728, elements: !970)
!969 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_FILE.h", directory: "")
!970 = !{!971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !986, !988, !989, !990, !991, !992, !993, !997, !1000, !1002, !1005, !1008, !1009, !1010, !1012, !1013}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !968, file: !969, line: 51, baseType: !201, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !968, file: !969, line: 54, baseType: !243, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !968, file: !969, line: 55, baseType: !243, size: 64, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !968, file: !969, line: 56, baseType: !243, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !968, file: !969, line: 57, baseType: !243, size: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !968, file: !969, line: 58, baseType: !243, size: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !968, file: !969, line: 59, baseType: !243, size: 64, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !968, file: !969, line: 60, baseType: !243, size: 64, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !968, file: !969, line: 61, baseType: !243, size: 64, offset: 512)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !968, file: !969, line: 64, baseType: !243, size: 64, offset: 576)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !968, file: !969, line: 65, baseType: !243, size: 64, offset: 640)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !968, file: !969, line: 66, baseType: !243, size: 64, offset: 704)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !968, file: !969, line: 68, baseType: !984, size: 64, offset: 768)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !969, line: 36, flags: DIFlagFwdDecl)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !968, file: !969, line: 70, baseType: !987, size: 64, offset: 832)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !968, file: !969, line: 72, baseType: !201, size: 32, offset: 896)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !968, file: !969, line: 73, baseType: !201, size: 32, offset: 928)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !968, file: !969, line: 74, baseType: !779, size: 64, offset: 960)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !968, file: !969, line: 77, baseType: !251, size: 16, offset: 1024)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !968, file: !969, line: 78, baseType: !260, size: 8, offset: 1040)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !968, file: !969, line: 79, baseType: !994, size: 8, offset: 1048)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !995)
!995 = !{!996}
!996 = !DISubrange(count: 1)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !968, file: !969, line: 81, baseType: !998, size: 64, offset: 1088)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !969, line: 43, baseType: null)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !968, file: !969, line: 89, baseType: !1001, size: 64, offset: 1152)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !200, line: 153, baseType: !266)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !968, file: !969, line: 91, baseType: !1003, size: 64, offset: 1216)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !969, line: 37, flags: DIFlagFwdDecl)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !968, file: !969, line: 92, baseType: !1006, size: 64, offset: 1280)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !969, line: 38, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !968, file: !969, line: 93, baseType: !987, size: 64, offset: 1344)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !968, file: !969, line: 94, baseType: !244, size: 64, offset: 1408)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_prevchain", scope: !968, file: !969, line: 95, baseType: !1011, size: 64, offset: 1472)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !968, file: !969, line: 96, baseType: !201, size: 32, offset: 1536)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !968, file: !969, line: 98, baseType: !1014, size: 160, offset: 1568)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !16)
!1015 = !DISubprogram(name: "strlen", scope: !950, file: !950, line: 407, type: !1016, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!257, !840}
!1018 = distinct !DISubprogram(name: "parse_uint16_t_array", scope: !2, file: !2, line: 133, type: !1019, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !241, retainedNodes: !1022)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!201, !243, !1021, !201}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1029}
!1023 = !DILocalVariable(name: "s", arg: 1, scope: !1018, file: !2, line: 133, type: !243)
!1024 = !DILocalVariable(name: "arr", arg: 2, scope: !1018, file: !2, line: 133, type: !1021)
!1025 = !DILocalVariable(name: "n", arg: 3, scope: !1018, file: !2, line: 133, type: !201)
!1026 = !DILocalVariable(name: "line", scope: !1018, file: !2, line: 133, type: !243)
!1027 = !DILocalVariable(name: "endptr", scope: !1018, file: !2, line: 133, type: !243)
!1028 = !DILocalVariable(name: "i", scope: !1018, file: !2, line: 133, type: !201)
!1029 = !DILocalVariable(name: "v", scope: !1018, file: !2, line: 133, type: !249)
!1030 = distinct !DIAssignID()
!1031 = !DILocation(line: 0, scope: !1018)
!1032 = !DILocation(line: 133, column: 1, scope: !1018)
!1033 = !DILocation(line: 133, column: 1, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !2, line: 133, column: 1)
!1035 = distinct !DILexicalBlock(scope: !1018, file: !2, line: 133, column: 1)
!1036 = !DILocation(line: 133, column: 1, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1018, file: !2, line: 133, column: 1)
!1038 = distinct !DIAssignID()
!1039 = !DILocation(line: 133, column: 1, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1037, file: !2, line: 133, column: 1)
!1041 = !DILocation(line: 133, column: 1, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1040, file: !2, line: 133, column: 1)
!1043 = !{!1044, !1044, i64 0}
!1044 = !{!"short", !416, i64 0}
!1045 = distinct !{!1045, !1032, !1032, !430, !431}
!1046 = !DILocation(line: 133, column: 1, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !2, line: 133, column: 1)
!1048 = distinct !DILexicalBlock(scope: !1018, file: !2, line: 133, column: 1)
!1049 = distinct !DISubprogram(name: "parse_uint32_t_array", scope: !2, file: !2, line: 134, type: !1050, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !241, retainedNodes: !1053)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!201, !243, !1052, !201}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059, !1060}
!1054 = !DILocalVariable(name: "s", arg: 1, scope: !1049, file: !2, line: 134, type: !243)
!1055 = !DILocalVariable(name: "arr", arg: 2, scope: !1049, file: !2, line: 134, type: !1052)
!1056 = !DILocalVariable(name: "n", arg: 3, scope: !1049, file: !2, line: 134, type: !201)
!1057 = !DILocalVariable(name: "line", scope: !1049, file: !2, line: 134, type: !243)
!1058 = !DILocalVariable(name: "endptr", scope: !1049, file: !2, line: 134, type: !243)
!1059 = !DILocalVariable(name: "i", scope: !1049, file: !2, line: 134, type: !201)
!1060 = !DILocalVariable(name: "v", scope: !1049, file: !2, line: 134, type: !252)
!1061 = distinct !DIAssignID()
!1062 = !DILocation(line: 0, scope: !1049)
!1063 = !DILocation(line: 134, column: 1, scope: !1049)
!1064 = !DILocation(line: 134, column: 1, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !2, line: 134, column: 1)
