; ModuleID = 'nw/nw/nw_opt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "riscv64-unknown-linux-gnu"

%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str.1 = private unnamed_addr constant [34 x i8] c"fd>1 && \22Invalid file descriptor\22\00", align 1, !dbg !0
@.str.2 = private unnamed_addr constant [23 x i8] c"../../common/support.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.readfile = private unnamed_addr constant [20 x i8] c"char *readfile(int)\00", align 1, !dbg !12
@.str.4 = private unnamed_addr constant [51 x i8] c"0==fstat(fd, &s) && \22Couldn't determine file size\22\00", align 1, !dbg !18
@.str.6 = private unnamed_addr constant [25 x i8] c"len>0 && \22File is empty\22\00", align 1, !dbg !23
@.str.8 = private unnamed_addr constant [29 x i8] c"status>=0 && \22read() failed\22\00", align 1, !dbg !28
@.str.10 = private unnamed_addr constant [33 x i8] c"n>=0 && \22Invalid section number\22\00", align 1, !dbg !33
@__PRETTY_FUNCTION__.find_section_start = private unnamed_addr constant [38 x i8] c"char *find_section_start(char *, int)\00", align 1, !dbg !38
@.str.12 = private unnamed_addr constant [34 x i8] c"s!=NULL && \22Invalid input string\22\00", align 1, !dbg !43

!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 344, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 43)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !104, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 182, type: !99, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !99, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !99, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !118, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 328, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 41)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 7)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !123, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 240, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 30)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 6)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 90)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !40, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !65)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !171, isLocal: true, isDefinition: true)
!170 = !DIFile(filename: "../../common/harness.c", directory: "/home/kelvin/MachSuite/nw/nw")
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 57)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !9, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 184, elements: !10)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !170, line: 22, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 11)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !170, line: 24, type: !181, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "INPUT_SIZE", scope: !188, file: !189, line: 4, type: !207, isLocal: false, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C11, file: !189, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !190, globals: !212, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "local_support.c", directory: "/home/kelvin/MachSuite/nw/nw")
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bench_args_t", file: !193, line: 14, size: 671808, elements: !194)
!193 = !DIFile(filename: "./nw.h", directory: "/home/kelvin/MachSuite/nw/nw")
!194 = !{!195, !199, !200, !204, !205, !210}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "seqA", scope: !192, file: !193, line: 15, baseType: !196, size: 1024)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "seqB", scope: !192, file: !193, line: 16, baseType: !196, size: 1024, offset: 1024)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "alignedA", scope: !192, file: !193, line: 17, baseType: !201, size: 2048, offset: 2048)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "alignedB", scope: !192, file: !193, line: 18, baseType: !201, size: 2048, offset: 4096)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !192, file: !193, line: 19, baseType: !206, size: 532512, offset: 6144)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 532512, elements: !208)
!207 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!208 = !{!209}
!209 = !DISubrange(count: 16641)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !192, file: !193, line: 20, baseType: !211, size: 133128, offset: 538656)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 133128, elements: !208)
!212 = !{!186}
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !151)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !124)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !170, line: 47, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 12)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !100)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !170, line: 58, type: !30, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !74)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !170, line: 67, type: !35, isLocal: true, isDefinition: true)
!234 = distinct !DICompileUnit(language: DW_LANG_C11, file: !235, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!235 = !DIFile(filename: "nw.c", directory: "/home/kelvin/MachSuite/nw/nw")
!236 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !237, globals: !268, splitDebugInlining: false, nameTableKind: None)
!237 = !{!238, !4, !239, !240, !245, !248, !251, !254, !258, !261, !263, !266, !267}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !241, line: 24, baseType: !242)
!241 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-uintn.h", directory: "")
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !243, line: 38, baseType: !244)
!243 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types.h", directory: "")
!244 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !241, line: 25, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !243, line: 40, baseType: !247)
!247 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !241, line: 26, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !243, line: 42, baseType: !250)
!250 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !241, line: 27, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !243, line: 45, baseType: !253)
!253 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !255, line: 24, baseType: !256)
!255 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-intn.h", directory: "")
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !243, line: 37, baseType: !257)
!257 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !255, line: 25, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !243, line: 39, baseType: !260)
!260 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !255, line: 26, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !243, line: 41, baseType: !207)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !255, line: 27, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !243, line: 44, baseType: !265)
!265 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!266 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!267 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!268 = !{!269, !0, !7, !12, !274, !18, !276, !23, !281, !28, !283, !33, !38, !285, !43, !45, !47, !52, !57, !62, !67, !69, !71, !76, !78, !80, !82, !87, !89, !290, !92, !97, !102, !107, !112, !114, !116, !121, !126, !128, !130, !132, !134, !136, !141, !146, !148, !153, !295, !158, !163, !297, !165}
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !271, isLocal: true, isDefinition: true)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 24)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !30, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !278, isLocal: true, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 14)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !278, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !9, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 21)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !2, line: 154, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 13)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !20, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 27)
!302 = distinct !DICompileUnit(language: DW_LANG_C11, file: !170, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !303, globals: !304, splitDebugInlining: false, nameTableKind: None)
!303 = !{!239}
!304 = !{!305, !168, !174, !176, !179, !184, !307, !213, !309, !216, !219, !311, !224, !227, !316, !229, !232, !318}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !226, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !278, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !215, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 31)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !215, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !170, line: 74, type: !320, isLocal: true, isDefinition: true)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 10)
!323 = !{!"clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)"}
!324 = !{i32 7, !"Dwarf Version", i32 4}
!325 = !{i32 2, !"Debug Info Version", i32 3}
!326 = !{i32 1, !"wchar_size", i32 4}
!327 = !{i32 1, !"target-abi", !"lp64d"}
!328 = distinct !{i32 6, !"riscv-isa", !329}
!329 = distinct !{!"rv64i2p1_m2p0_a2p1_f2p2_d2p2_zicsr2p0_zifencei2p0"}
!330 = !{i32 8, !"PIC Level", i32 2}
!331 = !{i32 7, !"PIE Level", i32 2}
!332 = !{i32 7, !"uwtable", i32 2}
!333 = !{i32 8, !"SmallDataLimit", i32 8}
!334 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!335 = distinct !DISubprogram(name: "nw", scope: !235, file: !235, line: 13, type: !336, scopeLine: 15, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !234, retainedNodes: !339)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !238, !238, !238, !238, !338, !238}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!339 = !{!340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !365, !366, !367}
!340 = !DILocalVariable(name: "SEQA", arg: 1, scope: !335, file: !235, line: 13, type: !238)
!341 = !DILocalVariable(name: "SEQB", arg: 2, scope: !335, file: !235, line: 13, type: !238)
!342 = !DILocalVariable(name: "alignedA", arg: 3, scope: !335, file: !235, line: 14, type: !238)
!343 = !DILocalVariable(name: "alignedB", arg: 4, scope: !335, file: !235, line: 14, type: !238)
!344 = !DILocalVariable(name: "M", arg: 5, scope: !335, file: !235, line: 15, type: !338)
!345 = !DILocalVariable(name: "ptr", arg: 6, scope: !335, file: !235, line: 15, type: !238)
!346 = !DILocalVariable(name: "score", scope: !335, file: !235, line: 17, type: !207)
!347 = !DILocalVariable(name: "up_left", scope: !335, file: !235, line: 17, type: !207)
!348 = !DILocalVariable(name: "up", scope: !335, file: !235, line: 17, type: !207)
!349 = !DILocalVariable(name: "left", scope: !335, file: !235, line: 17, type: !207)
!350 = !DILocalVariable(name: "max", scope: !335, file: !235, line: 17, type: !207)
!351 = !DILocalVariable(name: "row", scope: !335, file: !235, line: 18, type: !207)
!352 = !DILocalVariable(name: "row_up", scope: !335, file: !235, line: 18, type: !207)
!353 = !DILocalVariable(name: "r", scope: !335, file: !235, line: 18, type: !207)
!354 = !DILocalVariable(name: "a_idx", scope: !335, file: !235, line: 19, type: !207)
!355 = !DILocalVariable(name: "b_idx", scope: !335, file: !235, line: 19, type: !207)
!356 = !DILocalVariable(name: "a_str_idx", scope: !335, file: !235, line: 20, type: !207)
!357 = !DILocalVariable(name: "b_str_idx", scope: !335, file: !235, line: 20, type: !207)
!358 = !DILabel(scope: !335, name: "init_row", file: !235, line: 22)
!359 = !DILabel(scope: !335, name: "init_col", file: !235, line: 25)
!360 = !DILabel(scope: !335, name: "fill_out", file: !235, line: 30)
!361 = !DILabel(scope: !362, name: "fill_in", file: !235, line: 31)
!362 = distinct !DILexicalBlock(scope: !363, file: !235, line: 30, column: 52)
!363 = distinct !DILexicalBlock(scope: !364, file: !235, line: 30, column: 15)
!364 = distinct !DILexicalBlock(scope: !335, file: !235, line: 30, column: 15)
!365 = !DILabel(scope: !335, name: "trace", file: !235, line: 64)
!366 = !DILabel(scope: !335, name: "pad_a", file: !235, line: 85)
!367 = !DILabel(scope: !335, name: "pad_b", file: !235, line: 88)
!368 = !DILocation(line: 0, scope: !335)
!369 = !DILocation(line: 22, column: 5, scope: !335)
!370 = !DILocation(line: 31, column: 18, scope: !371)
!371 = distinct !DILexicalBlock(scope: !362, file: !235, line: 31, column: 18)
!372 = !DILocation(line: 32, column: 26, scope: !373)
!373 = distinct !DILexicalBlock(scope: !374, file: !235, line: 32, column: 16)
!374 = distinct !DILexicalBlock(scope: !375, file: !235, line: 31, column: 55)
!375 = distinct !DILexicalBlock(scope: !371, file: !235, line: 31, column: 18)
!376 = !DILocation(line: 32, column: 16, scope: !373)
!377 = !{!378, !378, i64 0}
!378 = !{!"omnipotent char", !379, i64 0}
!379 = !{!"Simple C/C++ TBAA"}
!380 = !DILocation(line: 32, column: 33, scope: !373)
!381 = !DILocation(line: 32, column: 30, scope: !373)
!382 = !DILocation(line: 41, column: 23, scope: !374)
!383 = !{!384, !384, i64 0}
!384 = !{!"int", !378, i64 0}
!385 = !DILocation(line: 41, column: 45, scope: !374)
!386 = !DILocation(line: 42, column: 23, scope: !374)
!387 = !DILocation(line: 42, column: 45, scope: !374)
!388 = !DILocation(line: 43, column: 23, scope: !374)
!389 = !DILocation(line: 43, column: 45, scope: !374)
!390 = !DILocation(line: 45, column: 19, scope: !374)
!391 = !DILocation(line: 47, column: 19, scope: !374)
!392 = !DILocation(line: 47, column: 13, scope: !374)
!393 = !DILocation(line: 47, column: 28, scope: !374)
!394 = !DILocation(line: 48, column: 20, scope: !395)
!395 = distinct !DILexicalBlock(scope: !374, file: !235, line: 48, column: 16)
!396 = !DILocation(line: 48, column: 16, scope: !374)
!397 = !DILocation(line: 50, column: 27, scope: !398)
!398 = distinct !DILexicalBlock(scope: !395, file: !235, line: 50, column: 23)
!399 = !DILocation(line: 0, scope: !398)
!400 = !DILocation(line: 50, column: 23, scope: !395)
!401 = !DILocation(line: 53, column: 34, scope: !402)
!402 = distinct !DILexicalBlock(scope: !398, file: !235, line: 52, column: 19)
!403 = !DILocation(line: 51, column: 34, scope: !404)
!404 = distinct !DILexicalBlock(scope: !398, file: !235, line: 50, column: 33)
!405 = !DILocation(line: 52, column: 13, scope: !404)
!406 = !DILocation(line: 49, column: 17, scope: !407)
!407 = distinct !DILexicalBlock(scope: !395, file: !235, line: 48, column: 28)
!408 = !DILocation(line: 49, column: 34, scope: !407)
!409 = !DILocation(line: 50, column: 13, scope: !407)
!410 = !DILocation(line: 31, column: 52, scope: !375)
!411 = !DILocation(line: 31, column: 36, scope: !375)
!412 = distinct !{!412, !370, !413, !414, !415}
!413 = !DILocation(line: 55, column: 9, scope: !371)
!414 = !{!"llvm.loop.mustprogress"}
!415 = !{!"llvm.loop.unroll.disable"}
!416 = !DILocation(line: 64, column: 12, scope: !335)
!417 = !DILocation(line: 30, column: 49, scope: !363)
!418 = !DILocation(line: 30, column: 33, scope: !363)
!419 = !DILocation(line: 30, column: 15, scope: !364)
!420 = distinct !{!420, !419, !421, !414, !415}
!421 = !DILocation(line: 56, column: 5, scope: !364)
!422 = !DILocation(line: 85, column: 28, scope: !423)
!423 = distinct !DILexicalBlock(scope: !424, file: !235, line: 85, column: 12)
!424 = distinct !DILexicalBlock(scope: !335, file: !235, line: 85, column: 12)
!425 = !DILocation(line: 85, column: 12, scope: !424)
!426 = !DILocation(line: 86, column: 27, scope: !427)
!427 = distinct !DILexicalBlock(scope: !423, file: !235, line: 85, column: 54)
!428 = !DILocation(line: 88, column: 12, scope: !429)
!429 = distinct !DILexicalBlock(scope: !335, file: !235, line: 88, column: 12)
!430 = !DILocation(line: 89, column: 27, scope: !431)
!431 = distinct !DILexicalBlock(scope: !432, file: !235, line: 88, column: 54)
!432 = distinct !DILexicalBlock(scope: !429, file: !235, line: 88, column: 12)
!433 = !DILocation(line: 91, column: 1, scope: !335)
!434 = !DILocation(line: 65, column: 18, scope: !435)
!435 = distinct !DILexicalBlock(scope: !335, file: !235, line: 64, column: 38)
!436 = !DILocation(line: 66, column: 19, scope: !437)
!437 = distinct !DILexicalBlock(scope: !435, file: !235, line: 66, column: 13)
!438 = !DILocation(line: 66, column: 13, scope: !437)
!439 = !DILocation(line: 66, column: 13, scope: !435)
!440 = !DILocation(line: 67, column: 37, scope: !441)
!441 = distinct !DILexicalBlock(scope: !437, file: !235, line: 66, column: 37)
!442 = !DILocation(line: 67, column: 13, scope: !441)
!443 = !DILocation(line: 67, column: 35, scope: !441)
!444 = !DILocation(line: 68, column: 37, scope: !441)
!445 = !DILocation(line: 68, column: 13, scope: !441)
!446 = !DILocation(line: 68, column: 35, scope: !441)
!447 = !DILocation(line: 69, column: 18, scope: !441)
!448 = !DILocation(line: 70, column: 18, scope: !441)
!449 = !DILocation(line: 71, column: 9, scope: !441)
!450 = !DILocation(line: 73, column: 37, scope: !451)
!451 = distinct !DILexicalBlock(scope: !452, file: !235, line: 72, column: 42)
!452 = distinct !DILexicalBlock(scope: !437, file: !235, line: 72, column: 18)
!453 = !DILocation(line: 73, column: 13, scope: !451)
!454 = !DILocation(line: 73, column: 35, scope: !451)
!455 = !DILocation(line: 74, column: 13, scope: !451)
!456 = !DILocation(line: 74, column: 35, scope: !451)
!457 = !DILocation(line: 75, column: 18, scope: !451)
!458 = !DILocation(line: 76, column: 9, scope: !451)
!459 = !DILocation(line: 78, column: 13, scope: !460)
!460 = distinct !DILexicalBlock(scope: !452, file: !235, line: 77, column: 13)
!461 = !DILocation(line: 78, column: 35, scope: !460)
!462 = !DILocation(line: 79, column: 37, scope: !460)
!463 = !DILocation(line: 79, column: 13, scope: !460)
!464 = !DILocation(line: 79, column: 35, scope: !460)
!465 = !DILocation(line: 80, column: 18, scope: !460)
!466 = !DILocation(line: 0, scope: !437)
!467 = !DILocation(line: 64, column: 23, scope: !335)
!468 = !DILocation(line: 64, column: 26, scope: !335)
!469 = distinct !{!469, !416, !470, !414, !415}
!470 = !DILocation(line: 82, column: 5, scope: !335)
!471 = !{!472}
!472 = distinct !{!472, !473, !"polly.alias.scope.MemRef0"}
!473 = distinct !{!473, !"polly.alias.scope.domain"}
!474 = !{}
!475 = distinct !DISubprogram(name: "run_benchmark", scope: !189, file: !189, line: 6, type: !476, scopeLine: 6, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !478)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !239}
!478 = !{!479, !480}
!479 = !DILocalVariable(name: "vargs", arg: 1, scope: !475, file: !189, line: 6, type: !239)
!480 = !DILocalVariable(name: "args", scope: !475, file: !189, line: 7, type: !191)
!481 = !DILocation(line: 0, scope: !475)
!482 = !DILocation(line: 8, column: 25, scope: !475)
!483 = !DILocation(line: 8, column: 37, scope: !475)
!484 = !DILocation(line: 8, column: 53, scope: !475)
!485 = !DILocation(line: 8, column: 69, scope: !475)
!486 = !DILocation(line: 8, column: 78, scope: !475)
!487 = !DILocation(line: 8, column: 3, scope: !475)
!488 = !DILocation(line: 9, column: 1, scope: !475)
!489 = distinct !DISubprogram(name: "input_to_data", scope: !189, file: !189, line: 18, type: !490, scopeLine: 18, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !492)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !207, !239}
!492 = !{!493, !494, !495, !496, !497}
!493 = !DILocalVariable(name: "fd", arg: 1, scope: !489, file: !189, line: 18, type: !207)
!494 = !DILocalVariable(name: "vdata", arg: 2, scope: !489, file: !189, line: 18, type: !239)
!495 = !DILocalVariable(name: "data", scope: !489, file: !189, line: 19, type: !191)
!496 = !DILocalVariable(name: "p", scope: !489, file: !189, line: 20, type: !238)
!497 = !DILocalVariable(name: "s", scope: !489, file: !189, line: 20, type: !238)
!498 = !DILocation(line: 0, scope: !489)
!499 = !DILocation(line: 22, column: 3, scope: !489)
!500 = !DILocation(line: 24, column: 7, scope: !489)
!501 = !DILocalVariable(name: "s", arg: 1, scope: !502, file: !2, line: 56, type: !238)
!502 = distinct !DISubprogram(name: "find_section_start", scope: !2, file: !2, line: 56, type: !503, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !505)
!503 = !DISubroutineType(types: !504)
!504 = !{!238, !238, !207}
!505 = !{!501, !506, !507}
!506 = !DILocalVariable(name: "n", arg: 2, scope: !502, file: !2, line: 56, type: !207)
!507 = !DILocalVariable(name: "i", scope: !502, file: !2, line: 57, type: !207)
!508 = !DILocation(line: 0, scope: !502, inlinedAt: !509)
!509 = distinct !DILocation(line: 26, column: 7, scope: !489)
!510 = !DILocation(line: 64, column: 17, scope: !502, inlinedAt: !509)
!511 = !DILocation(line: 64, column: 3, scope: !502, inlinedAt: !509)
!512 = !DILocation(line: 66, column: 22, scope: !513, inlinedAt: !509)
!513 = distinct !DILexicalBlock(scope: !514, file: !2, line: 66, column: 9)
!514 = distinct !DILexicalBlock(scope: !502, file: !2, line: 64, column: 31)
!515 = !DILocation(line: 66, column: 26, scope: !513, inlinedAt: !509)
!516 = !DILocation(line: 66, column: 32, scope: !513, inlinedAt: !509)
!517 = !DILocation(line: 66, column: 35, scope: !513, inlinedAt: !509)
!518 = !DILocation(line: 66, column: 39, scope: !513, inlinedAt: !509)
!519 = !DILocation(line: 66, column: 9, scope: !514, inlinedAt: !509)
!520 = !DILocation(line: 69, column: 6, scope: !514, inlinedAt: !509)
!521 = !DILocation(line: 64, column: 10, scope: !502, inlinedAt: !509)
!522 = !DILocation(line: 64, column: 13, scope: !502, inlinedAt: !509)
!523 = distinct !{!523, !511, !524, !414, !415}
!524 = !DILocation(line: 70, column: 3, scope: !502, inlinedAt: !509)
!525 = !DILocation(line: 71, column: 6, scope: !526, inlinedAt: !509)
!526 = distinct !DILexicalBlock(scope: !502, file: !2, line: 71, column: 6)
!527 = !DILocation(line: 71, column: 8, scope: !526, inlinedAt: !509)
!528 = !DILocation(line: 71, column: 6, scope: !502, inlinedAt: !509)
!529 = !DILocalVariable(name: "s", arg: 1, scope: !530, file: !2, line: 77, type: !238)
!530 = distinct !DISubprogram(name: "parse_string", scope: !2, file: !2, line: 77, type: !531, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !533)
!531 = !DISubroutineType(types: !532)
!532 = !{!207, !238, !238, !207}
!533 = !{!529, !534, !535, !536}
!534 = !DILocalVariable(name: "arr", arg: 2, scope: !530, file: !2, line: 77, type: !238)
!535 = !DILocalVariable(name: "n", arg: 3, scope: !530, file: !2, line: 77, type: !207)
!536 = !DILocalVariable(name: "k", scope: !530, file: !2, line: 78, type: !207)
!537 = !DILocation(line: 0, scope: !530, inlinedAt: !538)
!538 = distinct !DILocation(line: 27, column: 3, scope: !489)
!539 = !DILocation(line: 91, column: 3, scope: !530, inlinedAt: !538)
!540 = !DILocation(line: 0, scope: !502, inlinedAt: !541)
!541 = distinct !DILocation(line: 29, column: 7, scope: !489)
!542 = !DILocation(line: 64, column: 17, scope: !502, inlinedAt: !541)
!543 = !DILocation(line: 64, column: 3, scope: !502, inlinedAt: !541)
!544 = !DILocation(line: 66, column: 22, scope: !513, inlinedAt: !541)
!545 = !DILocation(line: 66, column: 26, scope: !513, inlinedAt: !541)
!546 = !DILocation(line: 66, column: 32, scope: !513, inlinedAt: !541)
!547 = !DILocation(line: 66, column: 35, scope: !513, inlinedAt: !541)
!548 = !DILocation(line: 66, column: 39, scope: !513, inlinedAt: !541)
!549 = !DILocation(line: 66, column: 9, scope: !514, inlinedAt: !541)
!550 = !DILocation(line: 69, column: 6, scope: !514, inlinedAt: !541)
!551 = !DILocation(line: 64, column: 10, scope: !502, inlinedAt: !541)
!552 = !DILocation(line: 64, column: 13, scope: !502, inlinedAt: !541)
!553 = distinct !{!553, !543, !554, !414, !415}
!554 = !DILocation(line: 70, column: 3, scope: !502, inlinedAt: !541)
!555 = !DILocation(line: 71, column: 6, scope: !526, inlinedAt: !541)
!556 = !DILocation(line: 71, column: 8, scope: !526, inlinedAt: !541)
!557 = !DILocation(line: 71, column: 6, scope: !502, inlinedAt: !541)
!558 = !DILocation(line: 30, column: 25, scope: !489)
!559 = !DILocation(line: 0, scope: !530, inlinedAt: !560)
!560 = distinct !DILocation(line: 30, column: 3, scope: !489)
!561 = !DILocation(line: 91, column: 3, scope: !530, inlinedAt: !560)
!562 = !DILocation(line: 31, column: 3, scope: !489)
!563 = !DILocation(line: 33, column: 1, scope: !489)
!564 = !DISubprogram(name: "free", scope: !565, file: !565, line: 687, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!565 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdlib.h", directory: "")
!566 = distinct !DISubprogram(name: "data_to_input", scope: !189, file: !189, line: 35, type: !490, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !567)
!567 = !{!568, !569, !570}
!568 = !DILocalVariable(name: "fd", arg: 1, scope: !566, file: !189, line: 35, type: !207)
!569 = !DILocalVariable(name: "vdata", arg: 2, scope: !566, file: !189, line: 35, type: !239)
!570 = !DILocalVariable(name: "data", scope: !566, file: !189, line: 36, type: !191)
!571 = !DILocation(line: 0, scope: !566)
!572 = !DILocalVariable(name: "fd", arg: 1, scope: !573, file: !2, line: 189, type: !207)
!573 = distinct !DISubprogram(name: "write_section_header", scope: !2, file: !2, line: 189, type: !574, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !576)
!574 = !DISubroutineType(types: !575)
!575 = !{!207, !207}
!576 = !{!572}
!577 = !DILocation(line: 0, scope: !573, inlinedAt: !578)
!578 = distinct !DILocation(line: 38, column: 3, scope: !566)
!579 = !DILocation(line: 190, column: 3, scope: !580, inlinedAt: !578)
!580 = distinct !DILexicalBlock(scope: !581, file: !2, line: 190, column: 3)
!581 = distinct !DILexicalBlock(scope: !573, file: !2, line: 190, column: 3)
!582 = !DILocation(line: 191, column: 3, scope: !573, inlinedAt: !578)
!583 = !DILocation(line: 39, column: 3, scope: !566)
!584 = !DILocation(line: 0, scope: !573, inlinedAt: !585)
!585 = distinct !DILocation(line: 41, column: 3, scope: !566)
!586 = !DILocation(line: 191, column: 3, scope: !573, inlinedAt: !585)
!587 = !DILocation(line: 42, column: 26, scope: !566)
!588 = !DILocation(line: 42, column: 3, scope: !566)
!589 = !DILocation(line: 0, scope: !573, inlinedAt: !590)
!590 = distinct !DILocation(line: 44, column: 3, scope: !566)
!591 = !DILocation(line: 191, column: 3, scope: !573, inlinedAt: !590)
!592 = !DILocation(line: 45, column: 1, scope: !566)
!593 = distinct !DISubprogram(name: "output_to_data", scope: !189, file: !189, line: 54, type: !490, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !594)
!594 = !{!595, !596, !597, !598, !599}
!595 = !DILocalVariable(name: "fd", arg: 1, scope: !593, file: !189, line: 54, type: !207)
!596 = !DILocalVariable(name: "vdata", arg: 2, scope: !593, file: !189, line: 54, type: !239)
!597 = !DILocalVariable(name: "data", scope: !593, file: !189, line: 55, type: !191)
!598 = !DILocalVariable(name: "p", scope: !593, file: !189, line: 56, type: !238)
!599 = !DILocalVariable(name: "s", scope: !593, file: !189, line: 56, type: !238)
!600 = !DILocation(line: 0, scope: !593)
!601 = !DILocation(line: 58, column: 3, scope: !593)
!602 = !DILocation(line: 60, column: 7, scope: !593)
!603 = !DILocation(line: 0, scope: !502, inlinedAt: !604)
!604 = distinct !DILocation(line: 62, column: 7, scope: !593)
!605 = !DILocation(line: 64, column: 17, scope: !502, inlinedAt: !604)
!606 = !DILocation(line: 64, column: 3, scope: !502, inlinedAt: !604)
!607 = !DILocation(line: 66, column: 22, scope: !513, inlinedAt: !604)
!608 = !DILocation(line: 66, column: 26, scope: !513, inlinedAt: !604)
!609 = !DILocation(line: 66, column: 32, scope: !513, inlinedAt: !604)
!610 = !DILocation(line: 66, column: 35, scope: !513, inlinedAt: !604)
!611 = !DILocation(line: 66, column: 39, scope: !513, inlinedAt: !604)
!612 = !DILocation(line: 66, column: 9, scope: !514, inlinedAt: !604)
!613 = !DILocation(line: 69, column: 6, scope: !514, inlinedAt: !604)
!614 = !DILocation(line: 64, column: 10, scope: !502, inlinedAt: !604)
!615 = !DILocation(line: 64, column: 13, scope: !502, inlinedAt: !604)
!616 = distinct !{!616, !606, !617, !414, !415}
!617 = !DILocation(line: 70, column: 3, scope: !502, inlinedAt: !604)
!618 = !DILocation(line: 71, column: 6, scope: !526, inlinedAt: !604)
!619 = !DILocation(line: 71, column: 8, scope: !526, inlinedAt: !604)
!620 = !DILocation(line: 71, column: 6, scope: !502, inlinedAt: !604)
!621 = !DILocation(line: 63, column: 25, scope: !593)
!622 = !DILocation(line: 0, scope: !530, inlinedAt: !623)
!623 = distinct !DILocation(line: 63, column: 3, scope: !593)
!624 = !DILocation(line: 91, column: 3, scope: !530, inlinedAt: !623)
!625 = !DILocation(line: 0, scope: !502, inlinedAt: !626)
!626 = distinct !DILocation(line: 65, column: 7, scope: !593)
!627 = !DILocation(line: 64, column: 17, scope: !502, inlinedAt: !626)
!628 = !DILocation(line: 64, column: 3, scope: !502, inlinedAt: !626)
!629 = !DILocation(line: 66, column: 22, scope: !513, inlinedAt: !626)
!630 = !DILocation(line: 66, column: 26, scope: !513, inlinedAt: !626)
!631 = !DILocation(line: 66, column: 32, scope: !513, inlinedAt: !626)
!632 = !DILocation(line: 66, column: 35, scope: !513, inlinedAt: !626)
!633 = !DILocation(line: 66, column: 39, scope: !513, inlinedAt: !626)
!634 = !DILocation(line: 66, column: 9, scope: !514, inlinedAt: !626)
!635 = !DILocation(line: 69, column: 6, scope: !514, inlinedAt: !626)
!636 = !DILocation(line: 64, column: 10, scope: !502, inlinedAt: !626)
!637 = !DILocation(line: 64, column: 13, scope: !502, inlinedAt: !626)
!638 = distinct !{!638, !628, !639, !414, !415}
!639 = !DILocation(line: 70, column: 3, scope: !502, inlinedAt: !626)
!640 = !DILocation(line: 71, column: 6, scope: !526, inlinedAt: !626)
!641 = !DILocation(line: 71, column: 8, scope: !526, inlinedAt: !626)
!642 = !DILocation(line: 71, column: 6, scope: !502, inlinedAt: !626)
!643 = !DILocation(line: 66, column: 25, scope: !593)
!644 = !DILocation(line: 0, scope: !530, inlinedAt: !645)
!645 = distinct !DILocation(line: 66, column: 3, scope: !593)
!646 = !DILocation(line: 91, column: 3, scope: !530, inlinedAt: !645)
!647 = !DILocation(line: 67, column: 3, scope: !593)
!648 = !DILocation(line: 68, column: 1, scope: !593)
!649 = distinct !DISubprogram(name: "data_to_output", scope: !189, file: !189, line: 70, type: !490, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !650)
!650 = !{!651, !652, !653}
!651 = !DILocalVariable(name: "fd", arg: 1, scope: !649, file: !189, line: 70, type: !207)
!652 = !DILocalVariable(name: "vdata", arg: 2, scope: !649, file: !189, line: 70, type: !239)
!653 = !DILocalVariable(name: "data", scope: !649, file: !189, line: 71, type: !191)
!654 = !DILocation(line: 0, scope: !649)
!655 = !DILocation(line: 0, scope: !573, inlinedAt: !656)
!656 = distinct !DILocation(line: 73, column: 3, scope: !649)
!657 = !DILocation(line: 190, column: 3, scope: !580, inlinedAt: !656)
!658 = !DILocation(line: 191, column: 3, scope: !573, inlinedAt: !656)
!659 = !DILocation(line: 74, column: 26, scope: !649)
!660 = !DILocation(line: 74, column: 3, scope: !649)
!661 = !DILocation(line: 0, scope: !573, inlinedAt: !662)
!662 = distinct !DILocation(line: 76, column: 3, scope: !649)
!663 = !DILocation(line: 191, column: 3, scope: !573, inlinedAt: !662)
!664 = !DILocation(line: 77, column: 26, scope: !649)
!665 = !DILocation(line: 77, column: 3, scope: !649)
!666 = !DILocation(line: 0, scope: !573, inlinedAt: !667)
!667 = distinct !DILocation(line: 79, column: 3, scope: !649)
!668 = !DILocation(line: 191, column: 3, scope: !573, inlinedAt: !667)
!669 = !DILocation(line: 80, column: 1, scope: !649)
!670 = distinct !DISubprogram(name: "check_data", scope: !189, file: !189, line: 82, type: !671, scopeLine: 82, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !673)
!671 = !DISubroutineType(types: !672)
!672 = !{!207, !239, !239}
!673 = !{!674, !675, !676, !677, !678}
!674 = !DILocalVariable(name: "vdata", arg: 1, scope: !670, file: !189, line: 82, type: !239)
!675 = !DILocalVariable(name: "vref", arg: 2, scope: !670, file: !189, line: 82, type: !239)
!676 = !DILocalVariable(name: "data", scope: !670, file: !189, line: 83, type: !191)
!677 = !DILocalVariable(name: "ref", scope: !670, file: !189, line: 84, type: !191)
!678 = !DILocalVariable(name: "has_errors", scope: !670, file: !189, line: 85, type: !207)
!679 = !DILocation(line: 0, scope: !670)
!680 = !DILocation(line: 87, column: 30, scope: !670)
!681 = !DILocation(line: 87, column: 45, scope: !670)
!682 = !DILocation(line: 87, column: 17, scope: !670)
!683 = !DILocation(line: 88, column: 30, scope: !670)
!684 = !DILocation(line: 88, column: 45, scope: !670)
!685 = !DILocation(line: 88, column: 17, scope: !670)
!686 = !DILocation(line: 88, column: 14, scope: !670)
!687 = !DILocation(line: 91, column: 10, scope: !670)
!688 = !DILocation(line: 91, column: 3, scope: !670)
!689 = !DISubprogram(name: "memcmp", scope: !690, file: !690, line: 64, type: !691, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!690 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/string.h", directory: "")
!691 = !DISubroutineType(types: !692)
!692 = !{!207, !693, !693, !695}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !696, line: 18, baseType: !253)
!696 = !DIFile(filename: "/opt/riscv/lib/clang/18/include/__stddef_size_t.h", directory: "")
!697 = distinct !DISubprogram(name: "readfile", scope: !2, file: !2, line: 34, type: !698, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !700)
!698 = !DISubroutineType(types: !699)
!699 = !{!238, !207}
!700 = !{!701, !702, !703, !740, !743, !746}
!701 = !DILocalVariable(name: "fd", arg: 1, scope: !697, file: !2, line: 34, type: !207)
!702 = !DILocalVariable(name: "p", scope: !697, file: !2, line: 35, type: !238)
!703 = !DILocalVariable(name: "s", scope: !697, file: !2, line: 36, type: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !705, line: 44, size: 1024, elements: !706)
!705 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/struct_stat.h", directory: "")
!706 = !{!707, !709, !711, !713, !715, !717, !719, !720, !721, !723, !725, !726, !728, !736, !737, !738}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !704, file: !705, line: 46, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !243, line: 145, baseType: !253)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !704, file: !705, line: 47, baseType: !710, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !243, line: 148, baseType: !253)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !704, file: !705, line: 48, baseType: !712, size: 32, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !243, line: 150, baseType: !250)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !704, file: !705, line: 49, baseType: !714, size: 32, offset: 160)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !243, line: 151, baseType: !250)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !704, file: !705, line: 50, baseType: !716, size: 32, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !243, line: 146, baseType: !250)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !704, file: !705, line: 51, baseType: !718, size: 32, offset: 224)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !243, line: 147, baseType: !250)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !704, file: !705, line: 52, baseType: !708, size: 64, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !704, file: !705, line: 53, baseType: !708, size: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !704, file: !705, line: 54, baseType: !722, size: 64, offset: 384)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !243, line: 152, baseType: !265)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !704, file: !705, line: 55, baseType: !724, size: 32, offset: 448)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !243, line: 175, baseType: !207)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !704, file: !705, line: 56, baseType: !207, size: 32, offset: 480)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !704, file: !705, line: 57, baseType: !727, size: 64, offset: 512)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !243, line: 180, baseType: !265)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !704, file: !705, line: 65, baseType: !729, size: 128, offset: 576)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !730, line: 11, size: 128, elements: !731)
!730 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_timespec.h", directory: "")
!731 = !{!732, !734}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !729, file: !730, line: 16, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !243, line: 160, baseType: !265)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !729, file: !730, line: 21, baseType: !735, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !243, line: 197, baseType: !265)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !704, file: !705, line: 66, baseType: !729, size: 128, offset: 704)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !704, file: !705, line: 67, baseType: !729, size: 128, offset: 832)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !704, file: !705, line: 79, baseType: !739, size: 64, offset: 960)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !55)
!740 = !DILocalVariable(name: "len", scope: !697, file: !2, line: 37, type: !741)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !742, line: 85, baseType: !722)
!742 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/types.h", directory: "")
!743 = !DILocalVariable(name: "bytes_read", scope: !697, file: !2, line: 38, type: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !742, line: 108, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !243, line: 194, baseType: !265)
!746 = !DILocalVariable(name: "status", scope: !697, file: !2, line: 38, type: !744)
!747 = distinct !DIAssignID()
!748 = !DILocation(line: 0, scope: !697)
!749 = !DILocation(line: 36, column: 3, scope: !697)
!750 = !DILocation(line: 40, column: 3, scope: !751)
!751 = distinct !DILexicalBlock(scope: !752, file: !2, line: 40, column: 3)
!752 = distinct !DILexicalBlock(scope: !697, file: !2, line: 40, column: 3)
!753 = !DILocation(line: 41, column: 3, scope: !754)
!754 = distinct !DILexicalBlock(scope: !755, file: !2, line: 41, column: 3)
!755 = distinct !DILexicalBlock(scope: !697, file: !2, line: 41, column: 3)
!756 = !DILocation(line: 42, column: 11, scope: !697)
!757 = !DILocation(line: 43, column: 3, scope: !758)
!758 = distinct !DILexicalBlock(scope: !759, file: !2, line: 43, column: 3)
!759 = distinct !DILexicalBlock(scope: !697, file: !2, line: 43, column: 3)
!760 = !DILocation(line: 44, column: 25, scope: !697)
!761 = !DILocation(line: 44, column: 15, scope: !697)
!762 = !DILocation(line: 46, column: 3, scope: !697)
!763 = !DILocation(line: 49, column: 15, scope: !764)
!764 = distinct !DILexicalBlock(scope: !697, file: !2, line: 46, column: 27)
!765 = !DILocation(line: 46, column: 20, scope: !697)
!766 = distinct !{!766, !762, !767, !414, !415}
!767 = !DILocation(line: 50, column: 3, scope: !697)
!768 = !DILocation(line: 47, column: 24, scope: !764)
!769 = !DILocation(line: 47, column: 42, scope: !764)
!770 = !DILocation(line: 47, column: 14, scope: !764)
!771 = !DILocation(line: 48, column: 5, scope: !772)
!772 = distinct !DILexicalBlock(scope: !773, file: !2, line: 48, column: 5)
!773 = distinct !DILexicalBlock(scope: !764, file: !2, line: 48, column: 5)
!774 = !DILocation(line: 51, column: 3, scope: !697)
!775 = !DILocation(line: 51, column: 10, scope: !697)
!776 = !DILocation(line: 52, column: 3, scope: !697)
!777 = !DILocation(line: 54, column: 1, scope: !697)
!778 = !DILocation(line: 53, column: 3, scope: !697)
!779 = !DISubprogram(name: "__assert_fail", scope: !780, file: !780, line: 67, type: !781, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!780 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/assert.h", directory: "")
!781 = !DISubroutineType(types: !782)
!782 = !{null, !783, !783, !250, !783}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!784 = !DISubprogram(name: "fstat", scope: !785, file: !785, line: 210, type: !786, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!785 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/stat.h", directory: "")
!786 = !DISubroutineType(types: !787)
!787 = !{!207, !207, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!789 = !DISubprogram(name: "malloc", scope: !565, file: !565, line: 672, type: !790, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!790 = !DISubroutineType(types: !791)
!791 = !{!239, !695}
!792 = !DISubprogram(name: "read", scope: !793, file: !793, line: 371, type: !794, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!793 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/unistd.h", directory: "")
!794 = !DISubroutineType(types: !795)
!795 = !{!744, !207, !239, !695}
!796 = !DISubprogram(name: "close", scope: !793, file: !793, line: 358, type: !574, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!797 = !DILocation(line: 0, scope: !502)
!798 = !DILocation(line: 59, column: 3, scope: !799)
!799 = distinct !DILexicalBlock(scope: !800, file: !2, line: 59, column: 3)
!800 = distinct !DILexicalBlock(scope: !502, file: !2, line: 59, column: 3)
!801 = !DILocation(line: 60, column: 7, scope: !802)
!802 = distinct !DILexicalBlock(scope: !502, file: !2, line: 60, column: 6)
!803 = !DILocation(line: 60, column: 6, scope: !502)
!804 = !DILocation(line: 64, column: 17, scope: !502)
!805 = !DILocation(line: 64, column: 3, scope: !502)
!806 = !DILocation(line: 66, column: 22, scope: !513)
!807 = !DILocation(line: 66, column: 26, scope: !513)
!808 = !DILocation(line: 66, column: 32, scope: !513)
!809 = !DILocation(line: 66, column: 35, scope: !513)
!810 = !DILocation(line: 66, column: 39, scope: !513)
!811 = !DILocation(line: 66, column: 9, scope: !514)
!812 = !DILocation(line: 69, column: 6, scope: !514)
!813 = !DILocation(line: 64, column: 10, scope: !502)
!814 = !DILocation(line: 64, column: 13, scope: !502)
!815 = distinct !{!815, !805, !816, !414, !415}
!816 = !DILocation(line: 70, column: 3, scope: !502)
!817 = !DILocation(line: 71, column: 6, scope: !526)
!818 = !DILocation(line: 71, column: 8, scope: !526)
!819 = !DILocation(line: 71, column: 6, scope: !502)
!820 = !DILocation(line: 74, column: 1, scope: !502)
!821 = !DILocation(line: 0, scope: !530)
!822 = !DILocation(line: 79, column: 3, scope: !823)
!823 = distinct !DILexicalBlock(scope: !824, file: !2, line: 79, column: 3)
!824 = distinct !DILexicalBlock(scope: !530, file: !2, line: 79, column: 3)
!825 = !DILocation(line: 81, column: 8, scope: !826)
!826 = distinct !DILexicalBlock(scope: !530, file: !2, line: 81, column: 7)
!827 = !DILocation(line: 81, column: 7, scope: !530)
!828 = !DILocation(line: 83, column: 12, scope: !829)
!829 = distinct !DILexicalBlock(scope: !826, file: !2, line: 81, column: 13)
!830 = !DILocation(line: 83, column: 5, scope: !829)
!831 = !DILocation(line: 91, column: 19, scope: !530)
!832 = !DILocation(line: 91, column: 3, scope: !530)
!833 = !DILocation(line: 92, column: 7, scope: !530)
!834 = !DILocation(line: 83, column: 16, scope: !829)
!835 = !DILocation(line: 83, column: 26, scope: !829)
!836 = !DILocation(line: 83, column: 32, scope: !829)
!837 = !DILocation(line: 83, column: 29, scope: !829)
!838 = !DILocation(line: 83, column: 35, scope: !829)
!839 = !DILocation(line: 83, column: 45, scope: !829)
!840 = !DILocation(line: 83, column: 48, scope: !829)
!841 = !DILocation(line: 83, column: 54, scope: !829)
!842 = !DILocation(line: 84, column: 9, scope: !829)
!843 = !DILocation(line: 84, column: 18, scope: !829)
!844 = !DILocation(line: 84, column: 26, scope: !829)
!845 = distinct !{!845, !830, !846, !414, !415}
!846 = !DILocation(line: 86, column: 5, scope: !829)
!847 = !DILocation(line: 93, column: 5, scope: !848)
!848 = distinct !DILexicalBlock(scope: !530, file: !2, line: 92, column: 7)
!849 = !DILocation(line: 93, column: 12, scope: !848)
!850 = !DILocation(line: 95, column: 3, scope: !530)
!851 = distinct !DISubprogram(name: "parse_uint8_t_array", scope: !2, file: !2, line: 132, type: !852, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !855)
!852 = !DISubroutineType(types: !853)
!853 = !{!207, !238, !854, !207}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!855 = !{!856, !857, !858, !859, !860, !861, !862}
!856 = !DILocalVariable(name: "s", arg: 1, scope: !851, file: !2, line: 132, type: !238)
!857 = !DILocalVariable(name: "arr", arg: 2, scope: !851, file: !2, line: 132, type: !854)
!858 = !DILocalVariable(name: "n", arg: 3, scope: !851, file: !2, line: 132, type: !207)
!859 = !DILocalVariable(name: "line", scope: !851, file: !2, line: 132, type: !238)
!860 = !DILocalVariable(name: "endptr", scope: !851, file: !2, line: 132, type: !238)
!861 = !DILocalVariable(name: "i", scope: !851, file: !2, line: 132, type: !207)
!862 = !DILocalVariable(name: "v", scope: !851, file: !2, line: 132, type: !240)
!863 = distinct !DIAssignID()
!864 = !DILocation(line: 0, scope: !851)
!865 = !DILocation(line: 132, column: 1, scope: !851)
!866 = !DILocation(line: 132, column: 1, scope: !867)
!867 = distinct !DILexicalBlock(scope: !868, file: !2, line: 132, column: 1)
!868 = distinct !DILexicalBlock(scope: !851, file: !2, line: 132, column: 1)
!869 = !DILocation(line: 132, column: 1, scope: !870)
!870 = distinct !DILexicalBlock(scope: !851, file: !2, line: 132, column: 1)
!871 = !{!872, !872, i64 0}
!872 = !{!"any pointer", !378, i64 0}
!873 = distinct !DIAssignID()
!874 = !DILocation(line: 132, column: 1, scope: !875)
!875 = distinct !DILexicalBlock(scope: !870, file: !2, line: 132, column: 1)
!876 = !DILocation(line: 132, column: 1, scope: !877)
!877 = distinct !DILexicalBlock(scope: !875, file: !2, line: 132, column: 1)
!878 = distinct !{!878, !865, !865, !414, !415}
!879 = !DILocation(line: 132, column: 1, scope: !880)
!880 = distinct !DILexicalBlock(scope: !881, file: !2, line: 132, column: 1)
!881 = distinct !DILexicalBlock(scope: !851, file: !2, line: 132, column: 1)
!882 = !DISubprogram(name: "strtok", scope: !690, file: !690, line: 356, type: !883, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!883 = !DISubroutineType(types: !884)
!884 = !{!238, !885, !886}
!885 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !238)
!886 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !783)
!887 = !DISubprogram(name: "strtol", scope: !565, file: !565, line: 177, type: !888, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!888 = !DISubroutineType(types: !889)
!889 = !{!265, !886, !890, !207}
!890 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!892 = !DISubprogram(name: "fprintf", scope: !893, file: !893, line: 357, type: !894, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!893 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdio.h", directory: "")
!894 = !DISubroutineType(types: !895)
!895 = !{!207, !896, !886, null}
!896 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !899, line: 7, baseType: !900)
!899 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/FILE.h", directory: "")
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !901, line: 49, size: 1728, elements: !902)
!901 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_FILE.h", directory: "")
!902 = !{!903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !918, !920, !921, !922, !923, !924, !925, !929, !932, !934, !937, !940, !941, !942, !944, !945}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !900, file: !901, line: 51, baseType: !207, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !900, file: !901, line: 54, baseType: !238, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !900, file: !901, line: 55, baseType: !238, size: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !900, file: !901, line: 56, baseType: !238, size: 64, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !900, file: !901, line: 57, baseType: !238, size: 64, offset: 256)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !900, file: !901, line: 58, baseType: !238, size: 64, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !900, file: !901, line: 59, baseType: !238, size: 64, offset: 384)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !900, file: !901, line: 60, baseType: !238, size: 64, offset: 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !900, file: !901, line: 61, baseType: !238, size: 64, offset: 512)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !900, file: !901, line: 64, baseType: !238, size: 64, offset: 576)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !900, file: !901, line: 65, baseType: !238, size: 64, offset: 640)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !900, file: !901, line: 66, baseType: !238, size: 64, offset: 704)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !900, file: !901, line: 68, baseType: !916, size: 64, offset: 768)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !901, line: 36, flags: DIFlagFwdDecl)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !900, file: !901, line: 70, baseType: !919, size: 64, offset: 832)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !900, file: !901, line: 72, baseType: !207, size: 32, offset: 896)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !900, file: !901, line: 73, baseType: !207, size: 32, offset: 928)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !900, file: !901, line: 74, baseType: !722, size: 64, offset: 960)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !900, file: !901, line: 77, baseType: !247, size: 16, offset: 1024)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !900, file: !901, line: 78, baseType: !257, size: 8, offset: 1040)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !900, file: !901, line: 79, baseType: !926, size: 8, offset: 1048)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 1)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !900, file: !901, line: 81, baseType: !930, size: 64, offset: 1088)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !901, line: 43, baseType: null)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !900, file: !901, line: 89, baseType: !933, size: 64, offset: 1152)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !243, line: 153, baseType: !265)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !900, file: !901, line: 91, baseType: !935, size: 64, offset: 1216)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !901, line: 37, flags: DIFlagFwdDecl)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !900, file: !901, line: 92, baseType: !938, size: 64, offset: 1280)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !901, line: 38, flags: DIFlagFwdDecl)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !900, file: !901, line: 93, baseType: !919, size: 64, offset: 1344)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !900, file: !901, line: 94, baseType: !239, size: 64, offset: 1408)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_prevchain", scope: !900, file: !901, line: 95, baseType: !943, size: 64, offset: 1472)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !900, file: !901, line: 96, baseType: !207, size: 32, offset: 1536)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !900, file: !901, line: 98, baseType: !946, size: 160, offset: 1568)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !16)
!947 = !DISubprogram(name: "strlen", scope: !690, file: !690, line: 407, type: !948, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!948 = !DISubroutineType(types: !949)
!949 = !{!253, !783}
!950 = distinct !DISubprogram(name: "parse_uint16_t_array", scope: !2, file: !2, line: 133, type: !951, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !954)
!951 = !DISubroutineType(types: !952)
!952 = !{!207, !238, !953, !207}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!954 = !{!955, !956, !957, !958, !959, !960, !961}
!955 = !DILocalVariable(name: "s", arg: 1, scope: !950, file: !2, line: 133, type: !238)
!956 = !DILocalVariable(name: "arr", arg: 2, scope: !950, file: !2, line: 133, type: !953)
!957 = !DILocalVariable(name: "n", arg: 3, scope: !950, file: !2, line: 133, type: !207)
!958 = !DILocalVariable(name: "line", scope: !950, file: !2, line: 133, type: !238)
!959 = !DILocalVariable(name: "endptr", scope: !950, file: !2, line: 133, type: !238)
!960 = !DILocalVariable(name: "i", scope: !950, file: !2, line: 133, type: !207)
!961 = !DILocalVariable(name: "v", scope: !950, file: !2, line: 133, type: !245)
!962 = distinct !DIAssignID()
!963 = !DILocation(line: 0, scope: !950)
!964 = !DILocation(line: 133, column: 1, scope: !950)
!965 = !DILocation(line: 133, column: 1, scope: !966)
!966 = distinct !DILexicalBlock(scope: !967, file: !2, line: 133, column: 1)
!967 = distinct !DILexicalBlock(scope: !950, file: !2, line: 133, column: 1)
!968 = !DILocation(line: 133, column: 1, scope: !969)
!969 = distinct !DILexicalBlock(scope: !950, file: !2, line: 133, column: 1)
!970 = distinct !DIAssignID()
!971 = !DILocation(line: 133, column: 1, scope: !972)
!972 = distinct !DILexicalBlock(scope: !969, file: !2, line: 133, column: 1)
!973 = !DILocation(line: 133, column: 1, scope: !974)
!974 = distinct !DILexicalBlock(scope: !972, file: !2, line: 133, column: 1)
!975 = !{!976, !976, i64 0}
!976 = !{!"short", !378, i64 0}
!977 = distinct !{!977, !964, !964, !414, !415}
!978 = !DILocation(line: 133, column: 1, scope: !979)
!979 = distinct !DILexicalBlock(scope: !980, file: !2, line: 133, column: 1)
!980 = distinct !DILexicalBlock(scope: !950, file: !2, line: 133, column: 1)
!981 = distinct !DISubprogram(name: "parse_uint32_t_array", scope: !2, file: !2, line: 134, type: !982, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !985)
!982 = !DISubroutineType(types: !983)
!983 = !{!207, !238, !984, !207}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!985 = !{!986, !987, !988, !989, !990, !991, !992}
!986 = !DILocalVariable(name: "s", arg: 1, scope: !981, file: !2, line: 134, type: !238)
!987 = !DILocalVariable(name: "arr", arg: 2, scope: !981, file: !2, line: 134, type: !984)
!988 = !DILocalVariable(name: "n", arg: 3, scope: !981, file: !2, line: 134, type: !207)
!989 = !DILocalVariable(name: "line", scope: !981, file: !2, line: 134, type: !238)
!990 = !DILocalVariable(name: "endptr", scope: !981, file: !2, line: 134, type: !238)
!991 = !DILocalVariable(name: "i", scope: !981, file: !2, line: 134, type: !207)
!992 = !DILocalVariable(name: "v", scope: !981, file: !2, line: 134, type: !248)
!993 = distinct !DIAssignID()
!994 = !DILocation(line: 0, scope: !981)
!995 = !DILocation(line: 134, column: 1, scope: !981)
!996 = !DILocation(line: 134, column: 1, scope: !997)
!997 = distinct !DILexicalBlock(scope: !998, file: !2, line: 134, column: 1)
!998 = distinct !DILexicalBlock(scope: !981, file: !2, line: 134, column: 1)
!999 = !DILocation(line: 134, column: 1, scope: !1000)
