; ModuleID = 'sort/merge/sort_opt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "riscv64-unknown-linux-gnu"

%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str.1 = private unnamed_addr constant [34 x i8] c"fd>1 && \22Invalid file descriptor\22\00", align 1, !dbg !0
@.str.2 = private unnamed_addr constant [23 x i8] c"../../common/support.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.readfile = private unnamed_addr constant [20 x i8] c"char *readfile(int)\00", align 1, !dbg !12
@.str.4 = private unnamed_addr constant [51 x i8] c"0==fstat(fd, &s) && \22Couldn't determine file size\22\00", align 1, !dbg !18
@.str.6 = private unnamed_addr constant [25 x i8] c"len>0 && \22File is empty\22\00", align 1, !dbg !23
@.str.8 = private unnamed_addr constant [29 x i8] c"status>=0 && \22read() failed\22\00", align 1, !dbg !28
@.str.10 = private unnamed_addr constant [33 x i8] c"n>=0 && \22Invalid section number\22\00", align 1, !dbg !33
@__PRETTY_FUNCTION__.find_section_start = private unnamed_addr constant [38 x i8] c"char *find_section_start(char *, int)\00", align 1, !dbg !38
@.str.12 = private unnamed_addr constant [34 x i8] c"s!=NULL && \22Invalid input string\22\00", align 1, !dbg !43

!556 = distinct !DILocation(line: 49, column: 7, scope: !545)
!557 = !DILocation(line: 64, column: 17, scope: !477, inlinedAt: !556)
!558 = !DILocation(line: 64, column: 3, scope: !477, inlinedAt: !556)
!559 = !DILocation(line: 66, column: 22, scope: !489, inlinedAt: !556)
!560 = !DILocation(line: 66, column: 26, scope: !489, inlinedAt: !556)
!561 = !DILocation(line: 66, column: 32, scope: !489, inlinedAt: !556)
!562 = !DILocation(line: 66, column: 35, scope: !489, inlinedAt: !556)
!563 = !DILocation(line: 66, column: 39, scope: !489, inlinedAt: !556)
!564 = !DILocation(line: 66, column: 9, scope: !490, inlinedAt: !556)
!565 = !DILocation(line: 69, column: 6, scope: !490, inlinedAt: !556)
!566 = !DILocation(line: 64, column: 10, scope: !477, inlinedAt: !556)
!567 = !DILocation(line: 64, column: 13, scope: !477, inlinedAt: !556)
!568 = distinct !{!568, !558, !569, !404, !405}
!569 = !DILocation(line: 70, column: 3, scope: !477, inlinedAt: !556)
!570 = !DILocation(line: 71, column: 6, scope: !502, inlinedAt: !556)
!571 = !DILocation(line: 71, column: 8, scope: !502, inlinedAt: !556)
!572 = !DILocation(line: 71, column: 6, scope: !477, inlinedAt: !556)
!573 = !DILocation(line: 50, column: 3, scope: !545)
!574 = !DILocation(line: 51, column: 3, scope: !545)
!575 = !DILocation(line: 52, column: 1, scope: !545)
!576 = distinct !DISubprogram(name: "data_to_output", scope: !189, file: !189, line: 54, type: !465, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !577)
!577 = !{!578, !579, !580}
!578 = !DILocalVariable(name: "fd", arg: 1, scope: !576, file: !189, line: 54, type: !201)
!579 = !DILocalVariable(name: "vdata", arg: 2, scope: !576, file: !189, line: 54, type: !231)
!580 = !DILocalVariable(name: "data", scope: !576, file: !189, line: 55, type: !191)
!581 = !DILocation(line: 0, scope: !576)
!582 = !DILocation(line: 0, scope: !517, inlinedAt: !583)
!583 = distinct !DILocation(line: 57, column: 3, scope: !576)
!584 = !DILocation(line: 190, column: 3, scope: !524, inlinedAt: !583)
!585 = !DILocation(line: 191, column: 3, scope: !517, inlinedAt: !583)
!586 = !DILocation(line: 0, scope: !528, inlinedAt: !587)
!587 = distinct !DILocation(line: 58, column: 3, scope: !576)
!588 = !DILocation(line: 183, column: 1, scope: !538, inlinedAt: !587)
!589 = !DILocation(line: 183, column: 1, scope: !540, inlinedAt: !587)
!590 = !DILocation(line: 183, column: 1, scope: !541, inlinedAt: !587)
!591 = distinct !{!591, !588, !588, !404, !405}
!592 = !DILocation(line: 59, column: 1, scope: !576)
!593 = distinct !DISubprogram(name: "check_data", scope: !189, file: !189, line: 61, type: !594, scopeLine: 61, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !596)
!594 = !DISubroutineType(types: !595)
!595 = !{!201, !231, !231}
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604}
!597 = !DILocalVariable(name: "vdata", arg: 1, scope: !593, file: !189, line: 61, type: !231)
!598 = !DILocalVariable(name: "vref", arg: 2, scope: !593, file: !189, line: 61, type: !231)
!599 = !DILocalVariable(name: "data", scope: !593, file: !189, line: 62, type: !191)
!600 = !DILocalVariable(name: "ref", scope: !593, file: !189, line: 63, type: !191)
!601 = !DILocalVariable(name: "has_errors", scope: !593, file: !189, line: 64, type: !201)
!602 = !DILocalVariable(name: "i", scope: !593, file: !189, line: 65, type: !201)
!603 = !DILocalVariable(name: "data_sum", scope: !593, file: !189, line: 66, type: !197)
!604 = !DILocalVariable(name: "ref_sum", scope: !593, file: !189, line: 66, type: !197)
!605 = !DILocation(line: 0, scope: !593)
!606 = !DILocation(line: 69, column: 14, scope: !593)
!607 = !DILocation(line: 70, column: 13, scope: !593)
!608 = !DILocation(line: 71, column: 3, scope: !609)
!609 = distinct !DILexicalBlock(scope: !593, file: !189, line: 71, column: 3)
!610 = !DILocation(line: 72, column: 34, scope: !611)
!611 = distinct !DILexicalBlock(scope: !612, file: !189, line: 71, column: 27)
!612 = distinct !DILexicalBlock(scope: !609, file: !189, line: 71, column: 3)
!613 = !DILocation(line: 72, column: 32, scope: !611)
!614 = !DILocation(line: 72, column: 16, scope: !611)
!615 = !DILocation(line: 73, column: 14, scope: !611)
!616 = !DILocation(line: 74, column: 16, scope: !611)
!617 = !DILocation(line: 74, column: 13, scope: !611)
!618 = !DILocation(line: 71, column: 22, scope: !612)
!619 = !DILocation(line: 71, column: 14, scope: !612)
!620 = distinct !{!620, !608, !621, !404, !405}
!621 = !DILocation(line: 75, column: 3, scope: !609)
!622 = !DILocation(line: 76, column: 26, scope: !593)
!623 = !DILocation(line: 76, column: 14, scope: !593)
!624 = !DILocation(line: 79, column: 10, scope: !593)
!625 = !DILocation(line: 79, column: 3, scope: !593)
!626 = distinct !DISubprogram(name: "readfile", scope: !2, file: !2, line: 34, type: !627, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !228, retainedNodes: !629)
!627 = !DISubroutineType(types: !628)
!628 = !{!230, !201}
!629 = !{!630, !631, !632, !669, !672, !675}
!630 = !DILocalVariable(name: "fd", arg: 1, scope: !626, file: !2, line: 34, type: !201)
!631 = !DILocalVariable(name: "p", scope: !626, file: !2, line: 35, type: !230)
!632 = !DILocalVariable(name: "s", scope: !626, file: !2, line: 36, type: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !634, line: 44, size: 1024, elements: !635)
!634 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/struct_stat.h", directory: "")
!635 = !{!636, !638, !640, !642, !644, !646, !648, !649, !650, !652, !654, !655, !657, !665, !666, !667}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !633, file: !634, line: 46, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !200, line: 145, baseType: !244)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !633, file: !634, line: 47, baseType: !639, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !200, line: 148, baseType: !244)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !633, file: !634, line: 48, baseType: !641, size: 32, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !200, line: 150, baseType: !241)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !633, file: !634, line: 49, baseType: !643, size: 32, offset: 160)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !200, line: 151, baseType: !241)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !633, file: !634, line: 50, baseType: !645, size: 32, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !200, line: 146, baseType: !241)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !633, file: !634, line: 51, baseType: !647, size: 32, offset: 224)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !200, line: 147, baseType: !241)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !633, file: !634, line: 52, baseType: !637, size: 64, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !633, file: !634, line: 53, baseType: !637, size: 64, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !633, file: !634, line: 54, baseType: !651, size: 64, offset: 384)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !200, line: 152, baseType: !253)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !633, file: !634, line: 55, baseType: !653, size: 32, offset: 448)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !200, line: 175, baseType: !201)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !633, file: !634, line: 56, baseType: !201, size: 32, offset: 480)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !633, file: !634, line: 57, baseType: !656, size: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !200, line: 180, baseType: !253)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !633, file: !634, line: 65, baseType: !658, size: 128, offset: 576)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !659, line: 11, size: 128, elements: !660)
!659 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_timespec.h", directory: "")
!660 = !{!661, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !658, file: !659, line: 16, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !200, line: 160, baseType: !253)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !658, file: !659, line: 21, baseType: !664, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !200, line: 197, baseType: !253)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !633, file: !634, line: 66, baseType: !658, size: 128, offset: 704)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !633, file: !634, line: 67, baseType: !658, size: 128, offset: 832)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !633, file: !634, line: 79, baseType: !668, size: 64, offset: 960)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 64, elements: !55)
!669 = !DILocalVariable(name: "len", scope: !626, file: !2, line: 37, type: !670)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !671, line: 85, baseType: !651)
!671 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/types.h", directory: "")
!672 = !DILocalVariable(name: "bytes_read", scope: !626, file: !2, line: 38, type: !673)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !671, line: 108, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !200, line: 194, baseType: !253)
!675 = !DILocalVariable(name: "status", scope: !626, file: !2, line: 38, type: !673)
!676 = distinct !DIAssignID()
!677 = !DILocation(line: 0, scope: !626)
!678 = !DILocation(line: 36, column: 3, scope: !626)
!679 = !DILocation(line: 40, column: 3, scope: !680)
!680 = distinct !DILexicalBlock(scope: !681, file: !2, line: 40, column: 3)
!681 = distinct !DILexicalBlock(scope: !626, file: !2, line: 40, column: 3)
!682 = !DILocation(line: 41, column: 3, scope: !683)
!683 = distinct !DILexicalBlock(scope: !684, file: !2, line: 41, column: 3)
!684 = distinct !DILexicalBlock(scope: !626, file: !2, line: 41, column: 3)
!685 = !DILocation(line: 42, column: 11, scope: !626)
!686 = !DILocation(line: 43, column: 3, scope: !687)
!687 = distinct !DILexicalBlock(scope: !688, file: !2, line: 43, column: 3)
!688 = distinct !DILexicalBlock(scope: !626, file: !2, line: 43, column: 3)
!689 = !DILocation(line: 44, column: 25, scope: !626)
!690 = !DILocation(line: 44, column: 15, scope: !626)
!691 = !DILocation(line: 46, column: 3, scope: !626)
!692 = !DILocation(line: 49, column: 15, scope: !693)
!693 = distinct !DILexicalBlock(scope: !626, file: !2, line: 46, column: 27)
!694 = !DILocation(line: 46, column: 20, scope: !626)
!695 = distinct !{!695, !691, !696, !404, !405}
!696 = !DILocation(line: 50, column: 3, scope: !626)
!697 = !DILocation(line: 47, column: 24, scope: !693)
!698 = !DILocation(line: 47, column: 42, scope: !693)
!699 = !DILocation(line: 47, column: 14, scope: !693)
!700 = !DILocation(line: 48, column: 5, scope: !701)
!701 = distinct !DILexicalBlock(scope: !702, file: !2, line: 48, column: 5)
!702 = distinct !DILexicalBlock(scope: !693, file: !2, line: 48, column: 5)
!703 = !DILocation(line: 51, column: 3, scope: !626)
!704 = !DILocation(line: 51, column: 10, scope: !626)
!705 = !DILocation(line: 52, column: 3, scope: !626)
!706 = !DILocation(line: 54, column: 1, scope: !626)
!707 = !DILocation(line: 53, column: 3, scope: !626)
!708 = !DISubprogram(name: "__assert_fail", scope: !709, file: !709, line: 67, type: !710, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!709 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/assert.h", directory: "")
!710 = !DISubroutineType(types: !711)
!711 = !{null, !712, !712, !241, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!713 = !DISubprogram(name: "fstat", scope: !714, file: !714, line: 210, type: !715, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!714 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/stat.h", directory: "")
!715 = !DISubroutineType(types: !716)
!716 = !{!201, !201, !717}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!718 = !DISubprogram(name: "malloc", scope: !509, file: !509, line: 672, type: !719, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!719 = !DISubroutineType(types: !720)
!720 = !{!231, !721}
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !722, line: 18, baseType: !244)
!722 = !DIFile(filename: "/opt/riscv/lib/clang/18/include/__stddef_size_t.h", directory: "")
!723 = !DISubprogram(name: "read", scope: !724, file: !724, line: 371, type: !725, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!724 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/unistd.h", directory: "")
!725 = !DISubroutineType(types: !726)
!726 = !{!673, !201, !231, !721}
!727 = !DISubprogram(name: "close", scope: !724, file: !724, line: 358, type: !518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!728 = !DILocation(line: 0, scope: !477)
!729 = !DILocation(line: 59, column: 3, scope: !730)
!730 = distinct !DILexicalBlock(scope: !731, file: !2, line: 59, column: 3)
!731 = distinct !DILexicalBlock(scope: !477, file: !2, line: 59, column: 3)
!732 = !DILocation(line: 60, column: 7, scope: !733)
!733 = distinct !DILexicalBlock(scope: !477, file: !2, line: 60, column: 6)
!734 = !DILocation(line: 60, column: 6, scope: !477)
!735 = !DILocation(line: 64, column: 17, scope: !477)
!736 = !DILocation(line: 64, column: 3, scope: !477)
!737 = !DILocation(line: 66, column: 22, scope: !489)
!738 = !DILocation(line: 66, column: 26, scope: !489)
!739 = !DILocation(line: 66, column: 32, scope: !489)
!740 = !DILocation(line: 66, column: 35, scope: !489)
!741 = !DILocation(line: 66, column: 39, scope: !489)
!742 = !DILocation(line: 66, column: 9, scope: !490)
!743 = !DILocation(line: 69, column: 6, scope: !490)
!744 = !DILocation(line: 64, column: 10, scope: !477)
!745 = !DILocation(line: 64, column: 13, scope: !477)
!746 = distinct !{!746, !736, !747, !404, !405}
!747 = !DILocation(line: 70, column: 3, scope: !477)
!748 = !DILocation(line: 71, column: 6, scope: !502)
!749 = !DILocation(line: 71, column: 8, scope: !502)
!750 = !DILocation(line: 71, column: 6, scope: !477)
!751 = !DILocation(line: 74, column: 1, scope: !477)
!752 = distinct !DISubprogram(name: "parse_string", scope: !2, file: !2, line: 77, type: !753, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !228, retainedNodes: !755)
!753 = !DISubroutineType(types: !754)
!754 = !{!201, !230, !230, !201}
!755 = !{!756, !757, !758, !759}
!756 = !DILocalVariable(name: "s", arg: 1, scope: !752, file: !2, line: 77, type: !230)
!757 = !DILocalVariable(name: "arr", arg: 2, scope: !752, file: !2, line: 77, type: !230)
!758 = !DILocalVariable(name: "n", arg: 3, scope: !752, file: !2, line: 77, type: !201)
!759 = !DILocalVariable(name: "k", scope: !752, file: !2, line: 78, type: !201)
!760 = !DILocation(line: 0, scope: !752)
!761 = !DILocation(line: 79, column: 3, scope: !762)
!762 = distinct !DILexicalBlock(scope: !763, file: !2, line: 79, column: 3)
!763 = distinct !DILexicalBlock(scope: !752, file: !2, line: 79, column: 3)
!764 = !DILocation(line: 81, column: 8, scope: !765)
!765 = distinct !DILexicalBlock(scope: !752, file: !2, line: 81, column: 7)
!766 = !DILocation(line: 81, column: 7, scope: !752)
!767 = !DILocation(line: 83, column: 12, scope: !768)
!768 = distinct !DILexicalBlock(scope: !765, file: !2, line: 81, column: 13)
!769 = !DILocation(line: 83, column: 5, scope: !768)
!770 = !DILocation(line: 91, column: 19, scope: !752)
!771 = !DILocation(line: 91, column: 3, scope: !752)
!772 = !DILocation(line: 92, column: 7, scope: !752)
!773 = !DILocation(line: 83, column: 16, scope: !768)
!774 = !DILocation(line: 83, column: 26, scope: !768)
!775 = !DILocation(line: 83, column: 32, scope: !768)
!776 = !DILocation(line: 83, column: 29, scope: !768)
!777 = !DILocation(line: 83, column: 35, scope: !768)
!778 = !DILocation(line: 83, column: 45, scope: !768)
!779 = !DILocation(line: 83, column: 48, scope: !768)
!780 = !DILocation(line: 83, column: 54, scope: !768)
!781 = !DILocation(line: 84, column: 9, scope: !768)
!782 = !DILocation(line: 84, column: 18, scope: !768)
!783 = !DILocation(line: 84, column: 26, scope: !768)
!784 = distinct !{!784, !769, !785, !404, !405}
!785 = !DILocation(line: 86, column: 5, scope: !768)
!786 = !DILocation(line: 93, column: 5, scope: !787)
!787 = distinct !DILexicalBlock(scope: !752, file: !2, line: 92, column: 7)
!788 = !DILocation(line: 93, column: 12, scope: !787)
!789 = !DILocation(line: 95, column: 3, scope: !752)
!790 = distinct !DISubprogram(name: "parse_uint8_t_array", scope: !2, file: !2, line: 132, type: !791, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !228, retainedNodes: !794)
!791 = !DISubroutineType(types: !792)
!792 = !{!201, !230, !793, !201}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!794 = !{!795, !796, !797, !798, !799, !800, !801}
!795 = !DILocalVariable(name: "s", arg: 1, scope: !790, file: !2, line: 132, type: !230)
!796 = !DILocalVariable(name: "arr", arg: 2, scope: !790, file: !2, line: 132, type: !793)
!797 = !DILocalVariable(name: "n", arg: 3, scope: !790, file: !2, line: 132, type: !201)
!798 = !DILocalVariable(name: "line", scope: !790, file: !2, line: 132, type: !230)
!799 = !DILocalVariable(name: "endptr", scope: !790, file: !2, line: 132, type: !230)
!800 = !DILocalVariable(name: "i", scope: !790, file: !2, line: 132, type: !201)
!801 = !DILocalVariable(name: "v", scope: !790, file: !2, line: 132, type: !232)
!802 = distinct !DIAssignID()
!803 = !DILocation(line: 0, scope: !790)
!804 = !DILocation(line: 132, column: 1, scope: !790)
!805 = !DILocation(line: 132, column: 1, scope: !806)
!806 = distinct !DILexicalBlock(scope: !807, file: !2, line: 132, column: 1)
!807 = distinct !DILexicalBlock(scope: !790, file: !2, line: 132, column: 1)
!808 = !DILocation(line: 132, column: 1, scope: !809)
!809 = distinct !DILexicalBlock(scope: !790, file: !2, line: 132, column: 1)
!810 = !{!811, !811, i64 0}
!811 = !{!"any pointer", !388, i64 0}
!812 = distinct !DIAssignID()
!813 = !DILocation(line: 132, column: 1, scope: !814)
!814 = distinct !DILexicalBlock(scope: !809, file: !2, line: 132, column: 1)
!815 = !DILocation(line: 132, column: 1, scope: !816)
!816 = distinct !DILexicalBlock(scope: !814, file: !2, line: 132, column: 1)
!817 = distinct !{!817, !804, !804, !404, !405}
!818 = !DILocation(line: 132, column: 1, scope: !819)
!819 = distinct !DILexicalBlock(scope: !820, file: !2, line: 132, column: 1)
!820 = distinct !DILexicalBlock(scope: !790, file: !2, line: 132, column: 1)
!821 = !DISubprogram(name: "strtok", scope: !822, file: !822, line: 356, type: !823, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!822 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/string.h", directory: "")
!823 = !DISubroutineType(types: !824)
!824 = !{!230, !825, !826}
!825 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !230)
!826 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !712)
!827 = !DISubprogram(name: "strtol", scope: !509, file: !509, line: 177, type: !828, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!828 = !DISubroutineType(types: !829)
!829 = !{!253, !826, !830, !201}
!830 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!832 = !DISubprogram(name: "fprintf", scope: !833, file: !833, line: 357, type: !834, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!833 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdio.h", directory: "")
!834 = !DISubroutineType(types: !835)
!835 = !{!201, !836, !826, null}
!836 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !839, line: 7, baseType: !840)
!839 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/FILE.h", directory: "")
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !841, line: 49, size: 1728, elements: !842)
!841 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_FILE.h", directory: "")
!842 = !{!843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !858, !860, !861, !862, !863, !864, !865, !869, !872, !874, !877, !880, !881, !882, !884, !885}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !840, file: !841, line: 51, baseType: !201, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !840, file: !841, line: 54, baseType: !230, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !840, file: !841, line: 55, baseType: !230, size: 64, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !840, file: !841, line: 56, baseType: !230, size: 64, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !840, file: !841, line: 57, baseType: !230, size: 64, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !840, file: !841, line: 58, baseType: !230, size: 64, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !840, file: !841, line: 59, baseType: !230, size: 64, offset: 384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !840, file: !841, line: 60, baseType: !230, size: 64, offset: 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !840, file: !841, line: 61, baseType: !230, size: 64, offset: 512)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !840, file: !841, line: 64, baseType: !230, size: 64, offset: 576)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !840, file: !841, line: 65, baseType: !230, size: 64, offset: 640)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !840, file: !841, line: 66, baseType: !230, size: 64, offset: 704)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !840, file: !841, line: 68, baseType: !856, size: 64, offset: 768)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !841, line: 36, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !840, file: !841, line: 70, baseType: !859, size: 64, offset: 832)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !840, file: !841, line: 72, baseType: !201, size: 32, offset: 896)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !840, file: !841, line: 73, baseType: !201, size: 32, offset: 928)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !840, file: !841, line: 74, baseType: !651, size: 64, offset: 960)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !840, file: !841, line: 77, baseType: !238, size: 16, offset: 1024)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !840, file: !841, line: 78, baseType: !247, size: 8, offset: 1040)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !840, file: !841, line: 79, baseType: !866, size: 8, offset: 1048)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 1)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !840, file: !841, line: 81, baseType: !870, size: 64, offset: 1088)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !841, line: 43, baseType: null)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !840, file: !841, line: 89, baseType: !873, size: 64, offset: 1152)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !200, line: 153, baseType: !253)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !840, file: !841, line: 91, baseType: !875, size: 64, offset: 1216)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !841, line: 37, flags: DIFlagFwdDecl)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !840, file: !841, line: 92, baseType: !878, size: 64, offset: 1280)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !841, line: 38, flags: DIFlagFwdDecl)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !840, file: !841, line: 93, baseType: !859, size: 64, offset: 1344)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !840, file: !841, line: 94, baseType: !231, size: 64, offset: 1408)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_prevchain", scope: !840, file: !841, line: 95, baseType: !883, size: 64, offset: 1472)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !840, file: !841, line: 96, baseType: !201, size: 32, offset: 1536)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !840, file: !841, line: 98, baseType: !886, size: 160, offset: 1568)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !16)
!887 = !DISubprogram(name: "strlen", scope: !822, file: !822, line: 407, type: !888, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!888 = !DISubroutineType(types: !889)
!889 = !{!244, !712}
!890 = distinct !DISubprogram(name: "parse_uint16_t_array", scope: !2, file: !2, line: 133, type: !891, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !228, retainedNodes: !894)
!891 = !DISubroutineType(types: !892)
!892 = !{!201, !230, !893, !201}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!894 = !{!895, !896, !897, !898, !899, !900, !901}
!895 = !DILocalVariable(name: "s", arg: 1, scope: !890, file: !2, line: 133, type: !230)
!896 = !DILocalVariable(name: "arr", arg: 2, scope: !890, file: !2, line: 133, type: !893)
!897 = !DILocalVariable(name: "n", arg: 3, scope: !890, file: !2, line: 133, type: !201)
!898 = !DILocalVariable(name: "line", scope: !890, file: !2, line: 133, type: !230)
!899 = !DILocalVariable(name: "endptr", scope: !890, file: !2, line: 133, type: !230)
!900 = !DILocalVariable(name: "i", scope: !890, file: !2, line: 133, type: !201)
!901 = !DILocalVariable(name: "v", scope: !890, file: !2, line: 133, type: !236)
!902 = distinct !DIAssignID()
!903 = !DILocation(line: 0, scope: !890)
!904 = !DILocation(line: 133, column: 1, scope: !890)
!905 = !DILocation(line: 133, column: 1, scope: !906)
!906 = distinct !DILexicalBlock(scope: !907, file: !2, line: 133, column: 1)
!907 = distinct !DILexicalBlock(scope: !890, file: !2, line: 133, column: 1)
!908 = !DILocation(line: 133, column: 1, scope: !909)
!909 = distinct !DILexicalBlock(scope: !890, file: !2, line: 133, column: 1)
!910 = distinct !DIAssignID()
!911 = !DILocation(line: 133, column: 1, scope: !912)
!912 = distinct !DILexicalBlock(scope: !909, file: !2, line: 133, column: 1)
!913 = !DILocation(line: 133, column: 1, scope: !914)
!914 = distinct !DILexicalBlock(scope: !912, file: !2, line: 133, column: 1)
!915 = !{!916, !916, i64 0}
!916 = !{!"short", !388, i64 0}
!917 = distinct !{!917, !904, !904, !404, !405}
!918 = !DILocation(line: 133, column: 1, scope: !919)
!919 = distinct !DILexicalBlock(scope: !920, file: !2, line: 133, column: 1)
!920 = distinct !DILexicalBlock(scope: !890, file: !2, line: 133, column: 1)
!921 = distinct !DISubprogram(name: "parse_uint32_t_array", scope: !2, file: !2, line: 134, type: !922, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !228, retainedNodes: !925)
!922 = !DISubroutineType(types: !923)
!923 = !{!201, !230, !924, !201}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!925 = !{!926, !927, !928, !929, !930, !931, !932}
!926 = !DILocalVariable(name: "s", arg: 1, scope: !921, file: !2, line: 134, type: !230)
!927 = !DILocalVariable(name: "arr", arg: 2, scope: !921, file: !2, line: 134, type: !924)
!928 = !DILocalVariable(name: "n", arg: 3, scope: !921, file: !2, line: 134, type: !201)
!929 = !DILocalVariable(name: "line", scope: !921, file: !2, line: 134, type: !230)
!930 = !DILocalVariable(name: "endptr", scope: !921, file: !2, line: 134, type: !230)
!931 = !DILocalVariable(name: "i", scope: !921, file: !2, line: 134, type: !201)
!932 = !DILocalVariable(name: "v", scope: !921, file: !2, line: 134, type: !239)
!933 = distinct !DIAssignID()
!934 = !DILocation(line: 0, scope: !921)
!935 = !DILocation(line: 134, column: 1, scope: !921)
!936 = !DILocation(line: 134, column: 1, scope: !937)
!937 = distinct !DILexicalBlock(scope: !938, file: !2, line: 134, column: 1)
!938 = distinct !DILexicalBlock(scope: !921, file: !2, line: 134, column: 1)
!939 = !DILocation(line: 134, column: 1, scope: !940)
