; ModuleID = 'sort/radix/sort_opt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "riscv64-unknown-linux-gnu"

%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str.1 = private unnamed_addr constant [34 x i8] c"fd>1 && \22Invalid file descriptor\22\00", align 1, !dbg !0
@.str.2 = private unnamed_addr constant [23 x i8] c"../../common/support.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.readfile = private unnamed_addr constant [20 x i8] c"char *readfile(int)\00", align 1, !dbg !12
@.str.4 = private unnamed_addr constant [51 x i8] c"0==fstat(fd, &s) && \22Couldn't determine file size\22\00", align 1, !dbg !18
@.str.6 = private unnamed_addr constant [25 x i8] c"len>0 && \22File is empty\22\00", align 1, !dbg !23
@.str.8 = private unnamed_addr constant [29 x i8] c"status>=0 && \22read() failed\22\00", align 1, !dbg !28
@.str.10 = private unnamed_addr constant [33 x i8] c"n>=0 && \22Invalid section number\22\00", align 1, !dbg !33
@__PRETTY_FUNCTION__.find_section_start = private unnamed_addr constant [38 x i8] c"char *find_section_start(char *, int)\00", align 1, !dbg !38
@.str.12 = private unnamed_addr constant [34 x i8] c"s!=NULL && \22Invalid input string\22\00", align 1, !dbg !43

!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 344, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 43)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !104, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 182, type: !99, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !99, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !99, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !118, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 328, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 41)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 7)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !123, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 240, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 30)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 6)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 90)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !40, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !65)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !171, isLocal: true, isDefinition: true)
!170 = !DIFile(filename: "../../common/harness.c", directory: "/home/kelvin/MachSuite/sort/radix")
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 57)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !9, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 184, elements: !10)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !170, line: 22, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 11)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !170, line: 24, type: !181, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "INPUT_SIZE", scope: !188, file: !189, line: 4, type: !197, isLocal: false, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C11, file: !189, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !190, globals: !206, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "local_support.c", directory: "/home/kelvin/MachSuite/sort/radix")
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bench_args_t", file: !193, line: 32, size: 200704, elements: !194)
!193 = !DIFile(filename: "./sort.h", directory: "/home/kelvin/MachSuite/sort/radix")
!194 = !{!195, !200, !201, !202}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !192, file: !193, line: 33, baseType: !196, size: 65536)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 65536, elements: !198)
!197 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!198 = !{!199}
!199 = !DISubrange(count: 2048)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !192, file: !193, line: 34, baseType: !196, size: 65536, offset: 65536)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !192, file: !193, line: 35, baseType: !196, size: 65536, offset: 131072)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sum", scope: !192, file: !193, line: 36, baseType: !203, size: 4096, offset: 196608)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 4096, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 128)
!206 = !{!186}
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !151)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !124)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !170, line: 47, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 12)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !100)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !170, line: 58, type: !30, isLocal: true, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !74)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !170, line: 67, type: !35, isLocal: true, isDefinition: true)
!228 = distinct !DICompileUnit(language: DW_LANG_C11, file: !229, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!229 = !DIFile(filename: "sort.c", directory: "/home/kelvin/MachSuite/sort/radix")
!230 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !231, globals: !262, splitDebugInlining: false, nameTableKind: None)
!231 = !{!232, !4, !233, !234, !239, !242, !245, !248, !252, !255, !257, !260, !261}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !235, line: 24, baseType: !236)
!235 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-uintn.h", directory: "")
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !237, line: 38, baseType: !238)
!237 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types.h", directory: "")
!238 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !235, line: 25, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !237, line: 40, baseType: !241)
!241 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !235, line: 26, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !237, line: 42, baseType: !244)
!244 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !235, line: 27, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !237, line: 45, baseType: !247)
!247 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !249, line: 24, baseType: !250)
!249 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-intn.h", directory: "")
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !237, line: 37, baseType: !251)
!251 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !249, line: 25, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !237, line: 39, baseType: !254)
!254 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !249, line: 26, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !237, line: 41, baseType: !197)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !249, line: 27, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !237, line: 44, baseType: !259)
!259 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!260 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!261 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!262 = !{!263, !0, !7, !12, !268, !18, !270, !23, !275, !28, !277, !33, !38, !279, !43, !45, !47, !52, !57, !62, !67, !69, !71, !76, !78, !80, !82, !87, !89, !284, !92, !97, !102, !107, !112, !114, !116, !121, !126, !128, !130, !132, !134, !136, !141, !146, !148, !153, !289, !158, !163, !291, !165}
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 24)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !30, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !272, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 14)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !272, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !9, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !281, isLocal: true, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 21)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !2, line: 154, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 13)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !20, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 27)
!296 = distinct !DICompileUnit(language: DW_LANG_C11, file: !170, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !297, globals: !298, splitDebugInlining: false, nameTableKind: None)
!297 = !{!233}
!298 = !{!299, !168, !174, !176, !179, !184, !301, !207, !303, !210, !213, !305, !218, !221, !310, !223, !226, !312}
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !220, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !272, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !209, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 31)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !209, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !170, line: 74, type: !314, isLocal: true, isDefinition: true)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 10)
!317 = !{!"clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)"}
!318 = !{i32 7, !"Dwarf Version", i32 4}
!319 = !{i32 2, !"Debug Info Version", i32 3}
!320 = !{i32 1, !"wchar_size", i32 4}
!321 = !{i32 1, !"target-abi", !"lp64d"}
!322 = distinct !{i32 6, !"riscv-isa", !323}
!323 = distinct !{!"rv64i2p1_m2p0_a2p1_f2p2_d2p2_zicsr2p0_zifencei2p0"}
!324 = !{i32 8, !"PIC Level", i32 2}
!325 = !{i32 7, !"PIE Level", i32 2}
!326 = !{i32 7, !"uwtable", i32 2}
!327 = !{i32 8, !"SmallDataLimit", i32 8}
!328 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!329 = distinct !DISubprogram(name: "sort", scope: !229, file: !229, line: 78, type: !330, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !228, retainedNodes: !333)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !332, !332, !332, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!333 = !{!334, !335, !336, !337, !338, !339, !340}
!334 = !DILocalVariable(name: "a", arg: 1, scope: !329, file: !229, line: 78, type: !332)
!335 = !DILocalVariable(name: "b", arg: 2, scope: !329, file: !229, line: 78, type: !332)
!336 = !DILocalVariable(name: "bucket", arg: 3, scope: !329, file: !229, line: 78, type: !332)
!337 = !DILocalVariable(name: "sum", arg: 4, scope: !329, file: !229, line: 78, type: !332)
!338 = !DILocalVariable(name: "exp", scope: !329, file: !229, line: 79, type: !197)
!339 = !DILocalVariable(name: "valid_buffer", scope: !329, file: !229, line: 80, type: !197)
!340 = !DILabel(scope: !329, name: "sort_1", file: !229, line: 84)
!341 = !DILocation(line: 0, scope: !329)
!342 = !DILocation(line: 84, column: 5, scope: !329)
!343 = !DILocation(line: 84, column: 14, scope: !344)
!344 = distinct !DILexicalBlock(scope: !329, file: !229, line: 84, column: 14)
!345 = !DILocalVariable(name: "bucket", arg: 1, scope: !346, file: !229, line: 42, type: !332)
!346 = distinct !DISubprogram(name: "init", scope: !229, file: !229, line: 42, type: !347, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !228, retainedNodes: !349)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !332}
!349 = !{!345, !350, !351}
!350 = !DILocalVariable(name: "i", scope: !346, file: !229, line: 44, type: !197)
!351 = !DILabel(scope: !346, name: "init_1", file: !229, line: 45)
!352 = !DILocation(line: 0, scope: !346, inlinedAt: !353)
!353 = distinct !DILocation(line: 85, column: 9, scope: !354)
!354 = distinct !DILexicalBlock(scope: !355, file: !229, line: 84, column: 42)
!355 = distinct !DILexicalBlock(scope: !344, file: !229, line: 84, column: 14)
!356 = !DILocation(line: 45, column: 5, scope: !346, inlinedAt: !353)
!357 = !DILocation(line: 46, column: 19, scope: !358, inlinedAt: !353)
!358 = distinct !DILexicalBlock(scope: !359, file: !229, line: 45, column: 43)
!359 = distinct !DILexicalBlock(scope: !360, file: !229, line: 45, column: 14)
!360 = distinct !DILexicalBlock(scope: !346, file: !229, line: 45, column: 14)
!361 = !{!362, !362, i64 0}
!362 = !{!"int", !363, i64 0}
!363 = !{!"omnipotent char", !364, i64 0}
!364 = !{!"Simple C/C++ TBAA"}
!365 = !DILocation(line: 86, column: 26, scope: !366)
!366 = distinct !DILexicalBlock(scope: !354, file: !229, line: 86, column: 13)
!367 = !DILocalVariable(name: "bucket", arg: 1, scope: !368, file: !229, line: 50, type: !332)
!368 = distinct !DISubprogram(name: "hist", scope: !229, file: !229, line: 50, type: !369, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !228, retainedNodes: !371)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !332, !332, !197}
!371 = !{!367, !372, !373, !374, !375, !376, !377, !378, !379}
!372 = !DILocalVariable(name: "a", arg: 2, scope: !368, file: !229, line: 50, type: !332)
!373 = !DILocalVariable(name: "exp", arg: 3, scope: !368, file: !229, line: 50, type: !197)
!374 = !DILocalVariable(name: "blockID", scope: !368, file: !229, line: 52, type: !197)
!375 = !DILocalVariable(name: "i", scope: !368, file: !229, line: 52, type: !197)
!376 = !DILocalVariable(name: "bucket_indx", scope: !368, file: !229, line: 52, type: !197)
!377 = !DILocalVariable(name: "a_indx", scope: !368, file: !229, line: 52, type: !197)
!378 = !DILabel(scope: !368, name: "hist_1", file: !229, line: 54)
!379 = !DILabel(scope: !380, name: "hist_2", file: !229, line: 55)
!380 = distinct !DILexicalBlock(scope: !381, file: !229, line: 54, column: 62)
!381 = distinct !DILexicalBlock(scope: !382, file: !229, line: 54, column: 14)
!382 = distinct !DILexicalBlock(scope: !368, file: !229, line: 54, column: 14)
!383 = !DILocation(line: 0, scope: !368, inlinedAt: !384)
!384 = distinct !DILocation(line: 87, column: 13, scope: !385)
!385 = distinct !DILexicalBlock(scope: !366, file: !229, line: 86, column: 39)
!386 = !DILocation(line: 0, scope: !368, inlinedAt: !387)
!387 = distinct !DILocation(line: 89, column: 13, scope: !388)
!388 = distinct !DILexicalBlock(scope: !366, file: !229, line: 88, column: 16)
!389 = !DILocation(line: 86, column: 13, scope: !354)
!390 = !DILocation(line: 55, column: 18, scope: !391, inlinedAt: !384)
!391 = distinct !DILexicalBlock(scope: !380, file: !229, line: 55, column: 18)
!392 = !DILocation(line: 57, column: 29, scope: !393, inlinedAt: !384)
!393 = distinct !DILexicalBlock(scope: !394, file: !229, line: 55, column: 37)
!394 = distinct !DILexicalBlock(scope: !391, file: !229, line: 55, column: 18)
!395 = !DILocation(line: 57, column: 39, scope: !393, inlinedAt: !384)
!396 = !DILocation(line: 57, column: 53, scope: !393, inlinedAt: !384)
!397 = !DILocation(line: 57, column: 66, scope: !393, inlinedAt: !384)
!398 = !DILocation(line: 58, column: 13, scope: !393, inlinedAt: !384)
!399 = !DILocation(line: 58, column: 32, scope: !393, inlinedAt: !384)
!400 = !DILocation(line: 55, column: 33, scope: !394, inlinedAt: !384)
!401 = !DILocation(line: 55, column: 28, scope: !394, inlinedAt: !384)
!402 = distinct !{!402, !390, !403, !404, !405}
!403 = !DILocation(line: 59, column: 9, scope: !391, inlinedAt: !384)
!404 = !{!"llvm.loop.mustprogress"}
!405 = !{!"llvm.loop.unroll.disable"}
!406 = !DILocation(line: 54, column: 58, scope: !381, inlinedAt: !384)
!407 = !DILocation(line: 54, column: 37, scope: !381, inlinedAt: !384)
!408 = !DILocation(line: 54, column: 14, scope: !382, inlinedAt: !384)
!409 = distinct !{!409, !408, !410, !404, !405}
!410 = !DILocation(line: 60, column: 5, scope: !382, inlinedAt: !384)
!411 = !DILocation(line: 55, column: 18, scope: !391, inlinedAt: !387)
!412 = !DILocation(line: 57, column: 29, scope: !393, inlinedAt: !387)
!413 = !DILocation(line: 57, column: 39, scope: !393, inlinedAt: !387)
!414 = !DILocation(line: 57, column: 53, scope: !393, inlinedAt: !387)
!415 = !DILocation(line: 57, column: 66, scope: !393, inlinedAt: !387)
!416 = !DILocation(line: 58, column: 13, scope: !393, inlinedAt: !387)
!417 = !DILocation(line: 58, column: 32, scope: !393, inlinedAt: !387)
!418 = !DILocation(line: 55, column: 33, scope: !394, inlinedAt: !387)
!419 = !DILocation(line: 55, column: 28, scope: !394, inlinedAt: !387)
!420 = distinct !{!420, !411, !421, !404, !405}
!421 = !DILocation(line: 59, column: 9, scope: !391, inlinedAt: !387)
!422 = !DILocation(line: 54, column: 58, scope: !381, inlinedAt: !387)
!423 = !DILocation(line: 54, column: 37, scope: !381, inlinedAt: !387)
!424 = !DILocation(line: 54, column: 14, scope: !382, inlinedAt: !387)
!425 = distinct !{!425, !424, !426, !404, !405}
!426 = !DILocation(line: 60, column: 5, scope: !382, inlinedAt: !387)
!427 = !DILocalVariable(name: "radixID", scope: !428, file: !229, line: 12, type: !197)
!428 = distinct !DISubprogram(name: "local_scan", scope: !229, file: !229, line: 10, type: !347, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !228, retainedNodes: !429)
!429 = !{!430, !427, !431, !432, !433, !434}
!430 = !DILocalVariable(name: "bucket", arg: 1, scope: !428, file: !229, line: 10, type: !332)
!431 = !DILocalVariable(name: "i", scope: !428, file: !229, line: 12, type: !197)
!432 = !DILocalVariable(name: "bucket_indx", scope: !428, file: !229, line: 12, type: !197)
!433 = !DILabel(scope: !428, name: "local_1", file: !229, line: 13)
!434 = !DILabel(scope: !435, name: "local_2", file: !229, line: 14)
!435 = distinct !DILexicalBlock(scope: !436, file: !229, line: 13, column: 62)
!436 = distinct !DILexicalBlock(scope: !437, file: !229, line: 13, column: 15)
!437 = distinct !DILexicalBlock(scope: !428, file: !229, line: 13, column: 15)
!438 = !DILocation(line: 0, scope: !428, inlinedAt: !439)
!439 = distinct !DILocation(line: 92, column: 9, scope: !354)
!440 = !DILocation(line: 14, column: 19, scope: !441, inlinedAt: !439)
!441 = distinct !DILexicalBlock(scope: !435, file: !229, line: 14, column: 19)
!442 = !DILocation(line: 16, column: 36, scope: !443, inlinedAt: !439)
!443 = distinct !DILexicalBlock(scope: !444, file: !229, line: 14, column: 47)
!444 = distinct !DILexicalBlock(scope: !441, file: !229, line: 14, column: 19)
!445 = !DILocation(line: 16, column: 33, scope: !443, inlinedAt: !439)
!446 = !DILocation(line: 14, column: 44, scope: !444, inlinedAt: !439)
!447 = !DILocation(line: 14, column: 30, scope: !444, inlinedAt: !439)
!448 = distinct !{!448, !440, !449, !404, !405}
!449 = !DILocation(line: 17, column: 9, scope: !441, inlinedAt: !439)
!450 = !DILocation(line: 13, column: 58, scope: !436, inlinedAt: !439)
!451 = !DILocation(line: 13, column: 38, scope: !436, inlinedAt: !439)
!452 = !DILocation(line: 13, column: 15, scope: !437, inlinedAt: !439)
!453 = distinct !{!453, !452, !454, !404, !405}
!454 = !DILocation(line: 18, column: 5, scope: !437, inlinedAt: !439)
!455 = !DILocalVariable(name: "sum", arg: 1, scope: !456, file: !229, line: 21, type: !332)
!456 = distinct !DISubprogram(name: "sum_scan", scope: !229, file: !229, line: 21, type: !457, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !228, retainedNodes: !459)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !332, !332}
!459 = !{!455, !460, !461, !462, !463}
!460 = !DILocalVariable(name: "bucket", arg: 2, scope: !456, file: !229, line: 21, type: !332)
!461 = !DILocalVariable(name: "radixID", scope: !456, file: !229, line: 23, type: !197)
!462 = !DILocalVariable(name: "bucket_indx", scope: !456, file: !229, line: 23, type: !197)
!463 = !DILabel(scope: !456, name: "sum_1", file: !229, line: 25)
!464 = !DILocation(line: 0, scope: !456, inlinedAt: !465)
!465 = distinct !DILocation(line: 93, column: 9, scope: !354)
!466 = !DILocation(line: 24, column: 12, scope: !456, inlinedAt: !465)
!467 = !DILocation(line: 25, column: 5, scope: !456, inlinedAt: !465)
!468 = !DILocation(line: 25, column: 13, scope: !469, inlinedAt: !465)
!469 = distinct !DILexicalBlock(scope: !456, file: !229, line: 25, column: 13)
!470 = !DILocation(line: 27, column: 24, scope: !471, inlinedAt: !465)
!471 = distinct !DILexicalBlock(scope: !472, file: !229, line: 25, column: 60)
!472 = distinct !DILexicalBlock(scope: !469, file: !229, line: 25, column: 13)
!473 = !DILocation(line: 27, column: 41, scope: !471, inlinedAt: !465)
!474 = !DILocation(line: 27, column: 39, scope: !471, inlinedAt: !465)
!475 = !DILocation(line: 27, column: 22, scope: !471, inlinedAt: !465)
!476 = !DILocation(line: 25, column: 56, scope: !472, inlinedAt: !465)
!477 = !DILocation(line: 25, column: 36, scope: !472, inlinedAt: !465)
!478 = distinct !{!478, !468, !479, !404, !405}
!479 = !DILocation(line: 28, column: 5, scope: !469, inlinedAt: !465)
!480 = !DILocalVariable(name: "radixID", scope: !481, file: !229, line: 33, type: !197)
!481 = distinct !DISubprogram(name: "last_step_scan", scope: !229, file: !229, line: 31, type: !457, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !228, retainedNodes: !482)
!482 = !{!483, !484, !480, !485, !486, !487, !488}
!483 = !DILocalVariable(name: "bucket", arg: 1, scope: !481, file: !229, line: 31, type: !332)
!484 = !DILocalVariable(name: "sum", arg: 2, scope: !481, file: !229, line: 31, type: !332)
!485 = !DILocalVariable(name: "i", scope: !481, file: !229, line: 33, type: !197)
!486 = !DILocalVariable(name: "bucket_indx", scope: !481, file: !229, line: 33, type: !197)
!487 = !DILabel(scope: !481, name: "last_1", file: !229, line: 34)
!488 = !DILabel(scope: !489, name: "last_2", file: !229, line: 35)
!489 = distinct !DILexicalBlock(scope: !490, file: !229, line: 34, column: 59)
!490 = distinct !DILexicalBlock(scope: !491, file: !229, line: 34, column: 12)
!491 = distinct !DILexicalBlock(scope: !481, file: !229, line: 34, column: 12)
!492 = !DILocation(line: 0, scope: !481, inlinedAt: !493)
!493 = distinct !DILocation(line: 94, column: 9, scope: !354)
!494 = !DILocation(line: 35, column: 16, scope: !495, inlinedAt: !493)
!495 = distinct !DILexicalBlock(scope: !489, file: !229, line: 35, column: 16)
!496 = !DILocation(line: 37, column: 35, scope: !497, inlinedAt: !493)
!497 = distinct !DILexicalBlock(scope: !498, file: !229, line: 35, column: 45)
!498 = distinct !DILexicalBlock(scope: !495, file: !229, line: 35, column: 16)
!499 = !DILocation(line: 37, column: 57, scope: !497, inlinedAt: !493)
!500 = !DILocation(line: 37, column: 55, scope: !497, inlinedAt: !493)
!501 = !DILocation(line: 37, column: 33, scope: !497, inlinedAt: !493)
!502 = !DILocation(line: 35, column: 41, scope: !498, inlinedAt: !493)
!503 = !DILocation(line: 35, column: 27, scope: !498, inlinedAt: !493)
!504 = distinct !{!504, !494, !505, !404, !405}
!505 = !DILocation(line: 38, column: 9, scope: !495, inlinedAt: !493)
!506 = !DILocation(line: 34, column: 55, scope: !490, inlinedAt: !493)
!507 = !DILocation(line: 34, column: 35, scope: !490, inlinedAt: !493)
!508 = !DILocation(line: 34, column: 12, scope: !491, inlinedAt: !493)
!509 = distinct !{!509, !508, !510, !404, !405}
!510 = !DILocation(line: 39, column: 5, scope: !491, inlinedAt: !493)
!511 = !DILocation(line: 96, column: 13, scope: !354)
!512 = !DILocalVariable(name: "blockID", scope: !513, file: !229, line: 65, type: !197)
!513 = distinct !DISubprogram(name: "update", scope: !229, file: !229, line: 63, type: !514, scopeLine: 64, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !228, retainedNodes: !516)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !332, !332, !332, !197}
!516 = !{!517, !518, !519, !520, !521, !512, !522, !523, !524, !525}
!517 = !DILocalVariable(name: "b", arg: 1, scope: !513, file: !229, line: 63, type: !332)
!518 = !DILocalVariable(name: "bucket", arg: 2, scope: !513, file: !229, line: 63, type: !332)
!519 = !DILocalVariable(name: "a", arg: 3, scope: !513, file: !229, line: 63, type: !332)
!520 = !DILocalVariable(name: "exp", arg: 4, scope: !513, file: !229, line: 63, type: !197)
!521 = !DILocalVariable(name: "i", scope: !513, file: !229, line: 65, type: !197)
!522 = !DILocalVariable(name: "bucket_indx", scope: !513, file: !229, line: 65, type: !197)
!523 = !DILocalVariable(name: "a_indx", scope: !513, file: !229, line: 65, type: !197)
!524 = !DILabel(scope: !513, name: "update_1", file: !229, line: 68)
!525 = !DILabel(scope: !526, name: "update_2", file: !229, line: 69)
!526 = distinct !DILexicalBlock(scope: !527, file: !229, line: 68, column: 68)
!527 = distinct !DILexicalBlock(scope: !528, file: !229, line: 68, column: 16)
!528 = distinct !DILexicalBlock(scope: !513, file: !229, line: 68, column: 16)
!529 = !DILocation(line: 0, scope: !513, inlinedAt: !530)
!530 = distinct !DILocation(line: 97, column: 13, scope: !531)
!531 = distinct !DILexicalBlock(scope: !532, file: !229, line: 96, column: 37)
!532 = distinct !DILexicalBlock(scope: !354, file: !229, line: 96, column: 13)
!533 = !DILocation(line: 69, column: 20, scope: !534, inlinedAt: !530)
!534 = distinct !DILexicalBlock(scope: !526, file: !229, line: 69, column: 20)
!535 = !DILocation(line: 70, column: 29, scope: !536, inlinedAt: !530)
!536 = distinct !DILexicalBlock(scope: !537, file: !229, line: 69, column: 39)
!537 = distinct !DILexicalBlock(scope: !534, file: !229, line: 69, column: 20)
!538 = !DILocation(line: 70, column: 63, scope: !536, inlinedAt: !530)
!539 = !DILocation(line: 70, column: 77, scope: !536, inlinedAt: !530)
!540 = !DILocation(line: 70, column: 90, scope: !536, inlinedAt: !530)
!541 = !DILocation(line: 72, column: 15, scope: !536, inlinedAt: !530)
!542 = !DILocation(line: 72, column: 13, scope: !536, inlinedAt: !530)
!543 = !DILocation(line: 72, column: 36, scope: !536, inlinedAt: !530)
!544 = !DILocation(line: 73, column: 32, scope: !536, inlinedAt: !530)
!545 = !DILocation(line: 69, column: 35, scope: !537, inlinedAt: !530)
!546 = !DILocation(line: 69, column: 30, scope: !537, inlinedAt: !530)
!547 = distinct !{!547, !533, !548, !404, !405}
!548 = !DILocation(line: 74, column: 9, scope: !534, inlinedAt: !530)
!549 = !DILocation(line: 68, column: 64, scope: !527, inlinedAt: !530)
!550 = !DILocation(line: 68, column: 42, scope: !527, inlinedAt: !530)
!551 = !DILocation(line: 68, column: 16, scope: !528, inlinedAt: !530)
!552 = distinct !{!552, !551, !553, !404, !405}
!553 = !DILocation(line: 75, column: 5, scope: !528, inlinedAt: !530)
!554 = !DILocation(line: 0, scope: !513, inlinedAt: !555)
!555 = distinct !DILocation(line: 100, column: 13, scope: !556)
!556 = distinct !DILexicalBlock(scope: !532, file: !229, line: 99, column: 16)
!557 = !DILocation(line: 69, column: 20, scope: !534, inlinedAt: !555)
!558 = !DILocation(line: 70, column: 29, scope: !536, inlinedAt: !555)
!559 = !DILocation(line: 70, column: 63, scope: !536, inlinedAt: !555)
!560 = !DILocation(line: 70, column: 77, scope: !536, inlinedAt: !555)
!561 = !DILocation(line: 70, column: 90, scope: !536, inlinedAt: !555)
!562 = !DILocation(line: 72, column: 15, scope: !536, inlinedAt: !555)
!563 = !DILocation(line: 72, column: 13, scope: !536, inlinedAt: !555)
!564 = !DILocation(line: 72, column: 36, scope: !536, inlinedAt: !555)
!565 = !DILocation(line: 73, column: 32, scope: !536, inlinedAt: !555)
!566 = !DILocation(line: 69, column: 35, scope: !537, inlinedAt: !555)
!567 = !DILocation(line: 69, column: 30, scope: !537, inlinedAt: !555)
!568 = distinct !{!568, !557, !569, !404, !405}
!569 = !DILocation(line: 74, column: 9, scope: !534, inlinedAt: !555)
!570 = !DILocation(line: 68, column: 64, scope: !527, inlinedAt: !555)
!571 = !DILocation(line: 68, column: 42, scope: !527, inlinedAt: !555)
!572 = !DILocation(line: 68, column: 16, scope: !528, inlinedAt: !555)
!573 = distinct !{!573, !572, !574, !404, !405}
!574 = !DILocation(line: 75, column: 5, scope: !528, inlinedAt: !555)
!575 = !DILocation(line: 84, column: 37, scope: !355)
!576 = !DILocation(line: 84, column: 29, scope: !355)
!577 = distinct !{!577, !343, !578, !404, !405}
!578 = !DILocation(line: 103, column: 5, scope: !344)
!579 = !DILocation(line: 105, column: 1, scope: !329)
!580 = !{!581}
!581 = distinct !{!581, !582, !"polly.alias.scope.MemRef0"}
!582 = distinct !{!582, !"polly.alias.scope.domain"}
!583 = !{!584}
!584 = distinct !{!584, !582, !"polly.alias.scope.MemRef2"}
!585 = distinct !DISubprogram(name: "run_benchmark", scope: !189, file: !189, line: 6, type: !586, scopeLine: 6, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !588)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !233}
!588 = !{!589, !590}
!589 = !DILocalVariable(name: "vargs", arg: 1, scope: !585, file: !189, line: 6, type: !233)
!590 = !DILocalVariable(name: "args", scope: !585, file: !189, line: 7, type: !191)
!591 = !DILocation(line: 0, scope: !585)
!592 = !DILocation(line: 8, column: 24, scope: !585)
!593 = !DILocation(line: 8, column: 33, scope: !585)
!594 = !DILocation(line: 8, column: 47, scope: !585)
!595 = !DILocation(line: 8, column: 3, scope: !585)
!596 = !DILocation(line: 9, column: 1, scope: !585)
!597 = distinct !DISubprogram(name: "input_to_data", scope: !189, file: !189, line: 16, type: !598, scopeLine: 16, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !600)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !197, !233}
!600 = !{!601, !602, !603, !604, !605}
!601 = !DILocalVariable(name: "fd", arg: 1, scope: !597, file: !189, line: 16, type: !197)
!602 = !DILocalVariable(name: "vdata", arg: 2, scope: !597, file: !189, line: 16, type: !233)
!603 = !DILocalVariable(name: "data", scope: !597, file: !189, line: 17, type: !191)
!604 = !DILocalVariable(name: "p", scope: !597, file: !189, line: 18, type: !232)
!605 = !DILocalVariable(name: "s", scope: !597, file: !189, line: 18, type: !232)
!606 = !DILocation(line: 0, scope: !597)
!607 = !DILocation(line: 20, column: 3, scope: !597)
!608 = !DILocation(line: 22, column: 7, scope: !597)
!609 = !DILocalVariable(name: "s", arg: 1, scope: !610, file: !2, line: 56, type: !232)
!610 = distinct !DISubprogram(name: "find_section_start", scope: !2, file: !2, line: 56, type: !611, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !613)
!611 = !DISubroutineType(types: !612)
!612 = !{!232, !232, !197}
!613 = !{!609, !614, !615}
!614 = !DILocalVariable(name: "n", arg: 2, scope: !610, file: !2, line: 56, type: !197)
!615 = !DILocalVariable(name: "i", scope: !610, file: !2, line: 57, type: !197)
!616 = !DILocation(line: 0, scope: !610, inlinedAt: !617)
!617 = distinct !DILocation(line: 24, column: 7, scope: !597)
!618 = !DILocation(line: 64, column: 17, scope: !610, inlinedAt: !617)
!619 = !{!363, !363, i64 0}
!620 = !DILocation(line: 64, column: 3, scope: !610, inlinedAt: !617)
!621 = !DILocation(line: 66, column: 22, scope: !622, inlinedAt: !617)
!622 = distinct !DILexicalBlock(scope: !623, file: !2, line: 66, column: 9)
!623 = distinct !DILexicalBlock(scope: !610, file: !2, line: 64, column: 31)
!624 = !DILocation(line: 66, column: 26, scope: !622, inlinedAt: !617)
!625 = !DILocation(line: 66, column: 32, scope: !622, inlinedAt: !617)
!626 = !DILocation(line: 66, column: 35, scope: !622, inlinedAt: !617)
!627 = !DILocation(line: 66, column: 39, scope: !622, inlinedAt: !617)
!628 = !DILocation(line: 66, column: 9, scope: !623, inlinedAt: !617)
!629 = !DILocation(line: 69, column: 6, scope: !623, inlinedAt: !617)
!630 = !DILocation(line: 64, column: 10, scope: !610, inlinedAt: !617)
!631 = !DILocation(line: 64, column: 13, scope: !610, inlinedAt: !617)
!632 = distinct !{!632, !620, !633, !404, !405}
!633 = !DILocation(line: 70, column: 3, scope: !610, inlinedAt: !617)
!634 = !DILocation(line: 71, column: 6, scope: !635, inlinedAt: !617)
!635 = distinct !DILexicalBlock(scope: !610, file: !2, line: 71, column: 6)
!636 = !DILocation(line: 71, column: 8, scope: !635, inlinedAt: !617)
!637 = !DILocation(line: 71, column: 6, scope: !610, inlinedAt: !617)
!638 = !DILocation(line: 25, column: 3, scope: !597)
!639 = !DILocation(line: 26, column: 3, scope: !597)
!640 = !DILocation(line: 27, column: 1, scope: !597)
!641 = !DISubprogram(name: "free", scope: !642, file: !642, line: 687, type: !586, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!642 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdlib.h", directory: "")
!643 = distinct !DISubprogram(name: "data_to_input", scope: !189, file: !189, line: 29, type: !598, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !644)
!644 = !{!645, !646, !647}
!645 = !DILocalVariable(name: "fd", arg: 1, scope: !643, file: !189, line: 29, type: !197)
!646 = !DILocalVariable(name: "vdata", arg: 2, scope: !643, file: !189, line: 29, type: !233)
!647 = !DILocalVariable(name: "data", scope: !643, file: !189, line: 30, type: !191)
!648 = !DILocation(line: 0, scope: !643)
!649 = !DILocalVariable(name: "fd", arg: 1, scope: !650, file: !2, line: 189, type: !197)
!650 = distinct !DISubprogram(name: "write_section_header", scope: !2, file: !2, line: 189, type: !651, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !653)
!651 = !DISubroutineType(types: !652)
!652 = !{!197, !197}
!653 = !{!649}
!654 = !DILocation(line: 0, scope: !650, inlinedAt: !655)
!655 = distinct !DILocation(line: 32, column: 3, scope: !643)
!656 = !DILocation(line: 190, column: 3, scope: !657, inlinedAt: !655)
!657 = distinct !DILexicalBlock(scope: !658, file: !2, line: 190, column: 3)
!658 = distinct !DILexicalBlock(scope: !650, file: !2, line: 190, column: 3)
!659 = !DILocation(line: 191, column: 3, scope: !650, inlinedAt: !655)
!660 = !DILocalVariable(name: "fd", arg: 1, scope: !661, file: !2, line: 183, type: !197)
!661 = distinct !DISubprogram(name: "write_int32_t_array", scope: !2, file: !2, line: 183, type: !662, scopeLine: 183, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !665)
!662 = !DISubroutineType(types: !663)
!663 = !{!197, !197, !664, !197}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!665 = !{!660, !666, !667, !668}
!666 = !DILocalVariable(name: "arr", arg: 2, scope: !661, file: !2, line: 183, type: !664)
!667 = !DILocalVariable(name: "n", arg: 3, scope: !661, file: !2, line: 183, type: !197)
!668 = !DILocalVariable(name: "i", scope: !661, file: !2, line: 183, type: !197)
!669 = !DILocation(line: 0, scope: !661, inlinedAt: !670)
!670 = distinct !DILocation(line: 33, column: 3, scope: !643)
!671 = !DILocation(line: 183, column: 1, scope: !672, inlinedAt: !670)
!672 = distinct !DILexicalBlock(scope: !661, file: !2, line: 183, column: 1)
!673 = !DILocation(line: 183, column: 1, scope: !674, inlinedAt: !670)
!674 = distinct !DILexicalBlock(scope: !675, file: !2, line: 183, column: 1)
!675 = distinct !DILexicalBlock(scope: !672, file: !2, line: 183, column: 1)
!676 = !DILocation(line: 183, column: 1, scope: !675, inlinedAt: !670)
!677 = distinct !{!677, !671, !671, !404, !405}
!678 = !DILocation(line: 34, column: 1, scope: !643)
!679 = distinct !DISubprogram(name: "output_to_data", scope: !189, file: !189, line: 41, type: !598, scopeLine: 41, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !680)
!680 = !{!681, !682, !683, !684, !685}
!681 = !DILocalVariable(name: "fd", arg: 1, scope: !679, file: !189, line: 41, type: !197)
!682 = !DILocalVariable(name: "vdata", arg: 2, scope: !679, file: !189, line: 41, type: !233)
!683 = !DILocalVariable(name: "data", scope: !679, file: !189, line: 42, type: !191)
!684 = !DILocalVariable(name: "p", scope: !679, file: !189, line: 43, type: !232)
!685 = !DILocalVariable(name: "s", scope: !679, file: !189, line: 43, type: !232)
!686 = !DILocation(line: 0, scope: !679)
!687 = !DILocation(line: 45, column: 3, scope: !679)
!688 = !DILocation(line: 47, column: 7, scope: !679)
!689 = !DILocation(line: 0, scope: !610, inlinedAt: !690)
!690 = distinct !DILocation(line: 49, column: 7, scope: !679)
!691 = !DILocation(line: 64, column: 17, scope: !610, inlinedAt: !690)
!692 = !DILocation(line: 64, column: 3, scope: !610, inlinedAt: !690)
!693 = !DILocation(line: 66, column: 22, scope: !622, inlinedAt: !690)
!694 = !DILocation(line: 66, column: 26, scope: !622, inlinedAt: !690)
!695 = !DILocation(line: 66, column: 32, scope: !622, inlinedAt: !690)
!696 = !DILocation(line: 66, column: 35, scope: !622, inlinedAt: !690)
!697 = !DILocation(line: 66, column: 39, scope: !622, inlinedAt: !690)
!698 = !DILocation(line: 66, column: 9, scope: !623, inlinedAt: !690)
!699 = !DILocation(line: 69, column: 6, scope: !623, inlinedAt: !690)
!700 = !DILocation(line: 64, column: 10, scope: !610, inlinedAt: !690)
!701 = !DILocation(line: 64, column: 13, scope: !610, inlinedAt: !690)
!702 = distinct !{!702, !692, !703, !404, !405}
!703 = !DILocation(line: 70, column: 3, scope: !610, inlinedAt: !690)
!704 = !DILocation(line: 71, column: 6, scope: !635, inlinedAt: !690)
!705 = !DILocation(line: 71, column: 8, scope: !635, inlinedAt: !690)
!706 = !DILocation(line: 71, column: 6, scope: !610, inlinedAt: !690)
!707 = !DILocation(line: 50, column: 3, scope: !679)
!708 = !DILocation(line: 51, column: 3, scope: !679)
!709 = !DILocation(line: 52, column: 1, scope: !679)
!710 = distinct !DISubprogram(name: "data_to_output", scope: !189, file: !189, line: 54, type: !598, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !711)
!711 = !{!712, !713, !714}
!712 = !DILocalVariable(name: "fd", arg: 1, scope: !710, file: !189, line: 54, type: !197)
!713 = !DILocalVariable(name: "vdata", arg: 2, scope: !710, file: !189, line: 54, type: !233)
!714 = !DILocalVariable(name: "data", scope: !710, file: !189, line: 55, type: !191)
!715 = !DILocation(line: 0, scope: !710)
!716 = !DILocation(line: 0, scope: !650, inlinedAt: !717)
!717 = distinct !DILocation(line: 57, column: 3, scope: !710)
!718 = !DILocation(line: 190, column: 3, scope: !657, inlinedAt: !717)
!719 = !DILocation(line: 191, column: 3, scope: !650, inlinedAt: !717)
!720 = !DILocation(line: 0, scope: !661, inlinedAt: !721)
!721 = distinct !DILocation(line: 58, column: 3, scope: !710)
!722 = !DILocation(line: 183, column: 1, scope: !672, inlinedAt: !721)
!723 = !DILocation(line: 183, column: 1, scope: !674, inlinedAt: !721)
!724 = !DILocation(line: 183, column: 1, scope: !675, inlinedAt: !721)
!725 = distinct !{!725, !722, !722, !404, !405}
!726 = !DILocation(line: 59, column: 1, scope: !710)
!727 = distinct !DISubprogram(name: "check_data", scope: !189, file: !189, line: 61, type: !728, scopeLine: 61, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !730)
!728 = !DISubroutineType(types: !729)
!729 = !{!197, !233, !233}
!730 = !{!731, !732, !733, !734, !735, !736, !737, !738}
!731 = !DILocalVariable(name: "vdata", arg: 1, scope: !727, file: !189, line: 61, type: !233)
!732 = !DILocalVariable(name: "vref", arg: 2, scope: !727, file: !189, line: 61, type: !233)
!733 = !DILocalVariable(name: "data", scope: !727, file: !189, line: 62, type: !191)
!734 = !DILocalVariable(name: "ref", scope: !727, file: !189, line: 63, type: !191)
!735 = !DILocalVariable(name: "has_errors", scope: !727, file: !189, line: 64, type: !197)
!736 = !DILocalVariable(name: "i", scope: !727, file: !189, line: 65, type: !197)
!737 = !DILocalVariable(name: "data_sum", scope: !727, file: !189, line: 66, type: !255)
!738 = !DILocalVariable(name: "ref_sum", scope: !727, file: !189, line: 66, type: !255)
!739 = !DILocation(line: 0, scope: !727)
!740 = !DILocation(line: 69, column: 14, scope: !727)
!741 = !DILocation(line: 70, column: 13, scope: !727)
!742 = !DILocation(line: 71, column: 3, scope: !743)
!743 = distinct !DILexicalBlock(scope: !727, file: !189, line: 71, column: 3)
!744 = !DILocation(line: 72, column: 34, scope: !745)
!745 = distinct !DILexicalBlock(scope: !746, file: !189, line: 71, column: 27)
!746 = distinct !DILexicalBlock(scope: !743, file: !189, line: 71, column: 3)
!747 = !DILocation(line: 72, column: 32, scope: !745)
!748 = !DILocation(line: 72, column: 16, scope: !745)
!749 = !DILocation(line: 73, column: 14, scope: !745)
!750 = !DILocation(line: 74, column: 16, scope: !745)
!751 = !DILocation(line: 74, column: 13, scope: !745)
!752 = !DILocation(line: 71, column: 22, scope: !746)
!753 = !DILocation(line: 71, column: 14, scope: !746)
!754 = distinct !{!754, !742, !755, !404, !405}
!755 = !DILocation(line: 75, column: 3, scope: !743)
!756 = !DILocation(line: 76, column: 26, scope: !727)
!757 = !DILocation(line: 76, column: 14, scope: !727)
!758 = !DILocation(line: 79, column: 10, scope: !727)
!759 = !DILocation(line: 79, column: 3, scope: !727)
!760 = distinct !DISubprogram(name: "readfile", scope: !2, file: !2, line: 34, type: !761, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !763)
!761 = !DISubroutineType(types: !762)
!762 = !{!232, !197}
!763 = !{!764, !765, !766, !803, !806, !809}
!764 = !DILocalVariable(name: "fd", arg: 1, scope: !760, file: !2, line: 34, type: !197)
!765 = !DILocalVariable(name: "p", scope: !760, file: !2, line: 35, type: !232)
!766 = !DILocalVariable(name: "s", scope: !760, file: !2, line: 36, type: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !768, line: 44, size: 1024, elements: !769)
!768 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/struct_stat.h", directory: "")
!769 = !{!770, !772, !774, !776, !778, !780, !782, !783, !784, !786, !788, !789, !791, !799, !800, !801}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !767, file: !768, line: 46, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !237, line: 145, baseType: !247)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !767, file: !768, line: 47, baseType: !773, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !237, line: 148, baseType: !247)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !767, file: !768, line: 48, baseType: !775, size: 32, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !237, line: 150, baseType: !244)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !767, file: !768, line: 49, baseType: !777, size: 32, offset: 160)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !237, line: 151, baseType: !244)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !767, file: !768, line: 50, baseType: !779, size: 32, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !237, line: 146, baseType: !244)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !767, file: !768, line: 51, baseType: !781, size: 32, offset: 224)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !237, line: 147, baseType: !244)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !767, file: !768, line: 52, baseType: !771, size: 64, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !767, file: !768, line: 53, baseType: !771, size: 64, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !767, file: !768, line: 54, baseType: !785, size: 64, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !237, line: 152, baseType: !259)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !767, file: !768, line: 55, baseType: !787, size: 32, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !237, line: 175, baseType: !197)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !767, file: !768, line: 56, baseType: !197, size: 32, offset: 480)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !767, file: !768, line: 57, baseType: !790, size: 64, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !237, line: 180, baseType: !259)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !767, file: !768, line: 65, baseType: !792, size: 128, offset: 576)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !793, line: 11, size: 128, elements: !794)
!793 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_timespec.h", directory: "")
!794 = !{!795, !797}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !792, file: !793, line: 16, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !237, line: 160, baseType: !259)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !792, file: !793, line: 21, baseType: !798, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !237, line: 197, baseType: !259)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !767, file: !768, line: 66, baseType: !792, size: 128, offset: 704)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !767, file: !768, line: 67, baseType: !792, size: 128, offset: 832)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !767, file: !768, line: 79, baseType: !802, size: 64, offset: 960)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 64, elements: !55)
!803 = !DILocalVariable(name: "len", scope: !760, file: !2, line: 37, type: !804)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !805, line: 85, baseType: !785)
!805 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/types.h", directory: "")
!806 = !DILocalVariable(name: "bytes_read", scope: !760, file: !2, line: 38, type: !807)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !805, line: 108, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !237, line: 194, baseType: !259)
!809 = !DILocalVariable(name: "status", scope: !760, file: !2, line: 38, type: !807)
!810 = distinct !DIAssignID()
!811 = !DILocation(line: 0, scope: !760)
!812 = !DILocation(line: 36, column: 3, scope: !760)
!813 = !DILocation(line: 40, column: 3, scope: !814)
!814 = distinct !DILexicalBlock(scope: !815, file: !2, line: 40, column: 3)
!815 = distinct !DILexicalBlock(scope: !760, file: !2, line: 40, column: 3)
!816 = !DILocation(line: 41, column: 3, scope: !817)
!817 = distinct !DILexicalBlock(scope: !818, file: !2, line: 41, column: 3)
!818 = distinct !DILexicalBlock(scope: !760, file: !2, line: 41, column: 3)
!819 = !DILocation(line: 42, column: 11, scope: !760)
!820 = !DILocation(line: 43, column: 3, scope: !821)
!821 = distinct !DILexicalBlock(scope: !822, file: !2, line: 43, column: 3)
!822 = distinct !DILexicalBlock(scope: !760, file: !2, line: 43, column: 3)
!823 = !DILocation(line: 44, column: 25, scope: !760)
!824 = !DILocation(line: 44, column: 15, scope: !760)
!825 = !DILocation(line: 46, column: 3, scope: !760)
!826 = !DILocation(line: 49, column: 15, scope: !827)
!827 = distinct !DILexicalBlock(scope: !760, file: !2, line: 46, column: 27)
!828 = !DILocation(line: 46, column: 20, scope: !760)
!829 = distinct !{!829, !825, !830, !404, !405}
!830 = !DILocation(line: 50, column: 3, scope: !760)
!831 = !DILocation(line: 47, column: 24, scope: !827)
!832 = !DILocation(line: 47, column: 42, scope: !827)
!833 = !DILocation(line: 47, column: 14, scope: !827)
!834 = !DILocation(line: 48, column: 5, scope: !835)
!835 = distinct !DILexicalBlock(scope: !836, file: !2, line: 48, column: 5)
!836 = distinct !DILexicalBlock(scope: !827, file: !2, line: 48, column: 5)
!837 = !DILocation(line: 51, column: 3, scope: !760)
!838 = !DILocation(line: 51, column: 10, scope: !760)
!839 = !DILocation(line: 52, column: 3, scope: !760)
!840 = !DILocation(line: 54, column: 1, scope: !760)
!841 = !DILocation(line: 53, column: 3, scope: !760)
!842 = !DISubprogram(name: "__assert_fail", scope: !843, file: !843, line: 67, type: !844, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!843 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/assert.h", directory: "")
!844 = !DISubroutineType(types: !845)
!845 = !{null, !846, !846, !244, !846}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!847 = !DISubprogram(name: "fstat", scope: !848, file: !848, line: 210, type: !849, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!848 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/stat.h", directory: "")
!849 = !DISubroutineType(types: !850)
!850 = !{!197, !197, !851}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!852 = !DISubprogram(name: "malloc", scope: !642, file: !642, line: 672, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!853 = !DISubroutineType(types: !854)
!854 = !{!233, !855}
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !856, line: 18, baseType: !247)
!856 = !DIFile(filename: "/opt/riscv/lib/clang/18/include/__stddef_size_t.h", directory: "")
!857 = !DISubprogram(name: "read", scope: !858, file: !858, line: 371, type: !859, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!858 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/unistd.h", directory: "")
!859 = !DISubroutineType(types: !860)
!860 = !{!807, !197, !233, !855}
!861 = !DISubprogram(name: "close", scope: !858, file: !858, line: 358, type: !651, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!862 = !DILocation(line: 0, scope: !610)
!863 = !DILocation(line: 59, column: 3, scope: !864)
!864 = distinct !DILexicalBlock(scope: !865, file: !2, line: 59, column: 3)
!865 = distinct !DILexicalBlock(scope: !610, file: !2, line: 59, column: 3)
!866 = !DILocation(line: 60, column: 7, scope: !867)
!867 = distinct !DILexicalBlock(scope: !610, file: !2, line: 60, column: 6)
!868 = !DILocation(line: 60, column: 6, scope: !610)
!869 = !DILocation(line: 64, column: 17, scope: !610)
!870 = !DILocation(line: 64, column: 3, scope: !610)
!871 = !DILocation(line: 66, column: 22, scope: !622)
!872 = !DILocation(line: 66, column: 26, scope: !622)
!873 = !DILocation(line: 66, column: 32, scope: !622)
!874 = !DILocation(line: 66, column: 35, scope: !622)
!875 = !DILocation(line: 66, column: 39, scope: !622)
!876 = !DILocation(line: 66, column: 9, scope: !623)
!877 = !DILocation(line: 69, column: 6, scope: !623)
!878 = !DILocation(line: 64, column: 10, scope: !610)
!879 = !DILocation(line: 64, column: 13, scope: !610)
!880 = distinct !{!880, !870, !881, !404, !405}
!881 = !DILocation(line: 70, column: 3, scope: !610)
!882 = !DILocation(line: 71, column: 6, scope: !635)
!883 = !DILocation(line: 71, column: 8, scope: !635)
!884 = !DILocation(line: 71, column: 6, scope: !610)
!885 = !DILocation(line: 74, column: 1, scope: !610)
!886 = distinct !DISubprogram(name: "parse_string", scope: !2, file: !2, line: 77, type: !887, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !889)
!887 = !DISubroutineType(types: !888)
!888 = !{!197, !232, !232, !197}
!889 = !{!890, !891, !892, !893}
!890 = !DILocalVariable(name: "s", arg: 1, scope: !886, file: !2, line: 77, type: !232)
!891 = !DILocalVariable(name: "arr", arg: 2, scope: !886, file: !2, line: 77, type: !232)
!892 = !DILocalVariable(name: "n", arg: 3, scope: !886, file: !2, line: 77, type: !197)
!893 = !DILocalVariable(name: "k", scope: !886, file: !2, line: 78, type: !197)
!894 = !DILocation(line: 0, scope: !886)
!895 = !DILocation(line: 79, column: 3, scope: !896)
!896 = distinct !DILexicalBlock(scope: !897, file: !2, line: 79, column: 3)
!897 = distinct !DILexicalBlock(scope: !886, file: !2, line: 79, column: 3)
!898 = !DILocation(line: 81, column: 8, scope: !899)
!899 = distinct !DILexicalBlock(scope: !886, file: !2, line: 81, column: 7)
!900 = !DILocation(line: 81, column: 7, scope: !886)
!901 = !DILocation(line: 83, column: 12, scope: !902)
!902 = distinct !DILexicalBlock(scope: !899, file: !2, line: 81, column: 13)
!903 = !DILocation(line: 83, column: 5, scope: !902)
!904 = !DILocation(line: 91, column: 19, scope: !886)
!905 = !DILocation(line: 91, column: 3, scope: !886)
!906 = !DILocation(line: 92, column: 7, scope: !886)
!907 = !DILocation(line: 83, column: 16, scope: !902)
!908 = !DILocation(line: 83, column: 26, scope: !902)
!909 = !DILocation(line: 83, column: 32, scope: !902)
!910 = !DILocation(line: 83, column: 29, scope: !902)
!911 = !DILocation(line: 83, column: 35, scope: !902)
!912 = !DILocation(line: 83, column: 45, scope: !902)
!913 = !DILocation(line: 83, column: 48, scope: !902)
!914 = !DILocation(line: 83, column: 54, scope: !902)
!915 = !DILocation(line: 84, column: 9, scope: !902)
!916 = !DILocation(line: 84, column: 18, scope: !902)
!917 = !DILocation(line: 84, column: 26, scope: !902)
!918 = distinct !{!918, !903, !919, !404, !405}
!919 = !DILocation(line: 86, column: 5, scope: !902)
!920 = !DILocation(line: 93, column: 5, scope: !921)
!921 = distinct !DILexicalBlock(scope: !886, file: !2, line: 92, column: 7)
!922 = !DILocation(line: 93, column: 12, scope: !921)
!923 = !DILocation(line: 95, column: 3, scope: !886)
!924 = distinct !DISubprogram(name: "parse_uint8_t_array", scope: !2, file: !2, line: 132, type: !925, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !928)
!925 = !DISubroutineType(types: !926)
!926 = !{!197, !232, !927, !197}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!928 = !{!929, !930, !931, !932, !933, !934, !935}
!929 = !DILocalVariable(name: "s", arg: 1, scope: !924, file: !2, line: 132, type: !232)
!930 = !DILocalVariable(name: "arr", arg: 2, scope: !924, file: !2, line: 132, type: !927)
!931 = !DILocalVariable(name: "n", arg: 3, scope: !924, file: !2, line: 132, type: !197)
!932 = !DILocalVariable(name: "line", scope: !924, file: !2, line: 132, type: !232)
!933 = !DILocalVariable(name: "endptr", scope: !924, file: !2, line: 132, type: !232)
!934 = !DILocalVariable(name: "i", scope: !924, file: !2, line: 132, type: !197)
!935 = !DILocalVariable(name: "v", scope: !924, file: !2, line: 132, type: !234)
!936 = distinct !DIAssignID()
!937 = !DILocation(line: 0, scope: !924)
!938 = !DILocation(line: 132, column: 1, scope: !924)
!939 = !DILocation(line: 132, column: 1, scope: !940)
!940 = distinct !DILexicalBlock(scope: !941, file: !2, line: 132, column: 1)
!941 = distinct !DILexicalBlock(scope: !924, file: !2, line: 132, column: 1)
!942 = !DILocation(line: 132, column: 1, scope: !943)
!943 = distinct !DILexicalBlock(scope: !924, file: !2, line: 132, column: 1)
!944 = !{!945, !945, i64 0}
!945 = !{!"any pointer", !363, i64 0}
!946 = distinct !DIAssignID()
!947 = !DILocation(line: 132, column: 1, scope: !948)
!948 = distinct !DILexicalBlock(scope: !943, file: !2, line: 132, column: 1)
!949 = !DILocation(line: 132, column: 1, scope: !950)
!950 = distinct !DILexicalBlock(scope: !948, file: !2, line: 132, column: 1)
!951 = distinct !{!951, !938, !938, !404, !405}
!952 = !DILocation(line: 132, column: 1, scope: !953)
!953 = distinct !DILexicalBlock(scope: !954, file: !2, line: 132, column: 1)
!954 = distinct !DILexicalBlock(scope: !924, file: !2, line: 132, column: 1)
!955 = !DISubprogram(name: "strtok", scope: !956, file: !956, line: 356, type: !957, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!956 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/string.h", directory: "")
!957 = !DISubroutineType(types: !958)
!958 = !{!232, !959, !960}
!959 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !232)
!960 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !846)
!961 = !DISubprogram(name: "strtol", scope: !642, file: !642, line: 177, type: !962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!962 = !DISubroutineType(types: !963)
!963 = !{!259, !960, !964, !197}
!964 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!966 = !DISubprogram(name: "fprintf", scope: !967, file: !967, line: 357, type: !968, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!967 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdio.h", directory: "")
!968 = !DISubroutineType(types: !969)
!969 = !{!197, !970, !960, null}
!970 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !973, line: 7, baseType: !974)
!973 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/FILE.h", directory: "")
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !975, line: 49, size: 1728, elements: !976)
!975 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_FILE.h", directory: "")
!976 = !{!977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !992, !994, !995, !996, !997, !998, !999, !1003, !1006, !1008, !1011, !1014, !1015, !1016, !1018, !1019}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !974, file: !975, line: 51, baseType: !197, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !974, file: !975, line: 54, baseType: !232, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !974, file: !975, line: 55, baseType: !232, size: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !974, file: !975, line: 56, baseType: !232, size: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !974, file: !975, line: 57, baseType: !232, size: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !974, file: !975, line: 58, baseType: !232, size: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !974, file: !975, line: 59, baseType: !232, size: 64, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !974, file: !975, line: 60, baseType: !232, size: 64, offset: 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !974, file: !975, line: 61, baseType: !232, size: 64, offset: 512)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !974, file: !975, line: 64, baseType: !232, size: 64, offset: 576)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !974, file: !975, line: 65, baseType: !232, size: 64, offset: 640)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !974, file: !975, line: 66, baseType: !232, size: 64, offset: 704)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !974, file: !975, line: 68, baseType: !990, size: 64, offset: 768)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !975, line: 36, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !974, file: !975, line: 70, baseType: !993, size: 64, offset: 832)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !974, file: !975, line: 72, baseType: !197, size: 32, offset: 896)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !974, file: !975, line: 73, baseType: !197, size: 32, offset: 928)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !974, file: !975, line: 74, baseType: !785, size: 64, offset: 960)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !974, file: !975, line: 77, baseType: !241, size: 16, offset: 1024)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !974, file: !975, line: 78, baseType: !251, size: 8, offset: 1040)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !974, file: !975, line: 79, baseType: !1000, size: 8, offset: 1048)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !1001)
!1001 = !{!1002}
!1002 = !DISubrange(count: 1)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !974, file: !975, line: 81, baseType: !1004, size: 64, offset: 1088)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !975, line: 43, baseType: null)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !974, file: !975, line: 89, baseType: !1007, size: 64, offset: 1152)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !237, line: 153, baseType: !259)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !974, file: !975, line: 91, baseType: !1009, size: 64, offset: 1216)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !975, line: 37, flags: DIFlagFwdDecl)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !974, file: !975, line: 92, baseType: !1012, size: 64, offset: 1280)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !975, line: 38, flags: DIFlagFwdDecl)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !974, file: !975, line: 93, baseType: !993, size: 64, offset: 1344)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !974, file: !975, line: 94, baseType: !233, size: 64, offset: 1408)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_prevchain", scope: !974, file: !975, line: 95, baseType: !1017, size: 64, offset: 1472)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !974, file: !975, line: 96, baseType: !197, size: 32, offset: 1536)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !974, file: !975, line: 98, baseType: !1020, size: 160, offset: 1568)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !16)
!1021 = !DISubprogram(name: "strlen", scope: !956, file: !956, line: 407, type: !1022, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!247, !846}
!1024 = distinct !DISubprogram(name: "parse_uint16_t_array", scope: !2, file: !2, line: 133, type: !1025, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !1028)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!197, !232, !1027, !197}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034, !1035}
!1029 = !DILocalVariable(name: "s", arg: 1, scope: !1024, file: !2, line: 133, type: !232)
!1030 = !DILocalVariable(name: "arr", arg: 2, scope: !1024, file: !2, line: 133, type: !1027)
!1031 = !DILocalVariable(name: "n", arg: 3, scope: !1024, file: !2, line: 133, type: !197)
!1032 = !DILocalVariable(name: "line", scope: !1024, file: !2, line: 133, type: !232)
!1033 = !DILocalVariable(name: "endptr", scope: !1024, file: !2, line: 133, type: !232)
!1034 = !DILocalVariable(name: "i", scope: !1024, file: !2, line: 133, type: !197)
!1035 = !DILocalVariable(name: "v", scope: !1024, file: !2, line: 133, type: !239)
!1036 = distinct !DIAssignID()
!1037 = !DILocation(line: 0, scope: !1024)
!1038 = !DILocation(line: 133, column: 1, scope: !1024)
!1039 = !DILocation(line: 133, column: 1, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !2, line: 133, column: 1)
!1041 = distinct !DILexicalBlock(scope: !1024, file: !2, line: 133, column: 1)
!1042 = !DILocation(line: 133, column: 1, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1024, file: !2, line: 133, column: 1)
!1044 = distinct !DIAssignID()
!1045 = !DILocation(line: 133, column: 1, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1043, file: !2, line: 133, column: 1)
!1047 = !DILocation(line: 133, column: 1, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1046, file: !2, line: 133, column: 1)
!1049 = !{!1050, !1050, i64 0}
!1050 = !{!"short", !363, i64 0}
!1051 = distinct !{!1051, !1038, !1038, !404, !405}
!1052 = !DILocation(line: 133, column: 1, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !2, line: 133, column: 1)
!1054 = distinct !DILexicalBlock(scope: !1024, file: !2, line: 133, column: 1)
!1055 = distinct !DISubprogram(name: "parse_uint32_t_array", scope: !2, file: !2, line: 134, type: !1056, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !1059)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!197, !232, !1058, !197}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1065, !1066}
!1060 = !DILocalVariable(name: "s", arg: 1, scope: !1055, file: !2, line: 134, type: !232)
!1061 = !DILocalVariable(name: "arr", arg: 2, scope: !1055, file: !2, line: 134, type: !1058)
!1062 = !DILocalVariable(name: "n", arg: 3, scope: !1055, file: !2, line: 134, type: !197)
!1063 = !DILocalVariable(name: "line", scope: !1055, file: !2, line: 134, type: !232)
!1064 = !DILocalVariable(name: "endptr", scope: !1055, file: !2, line: 134, type: !232)
!1065 = !DILocalVariable(name: "i", scope: !1055, file: !2, line: 134, type: !197)
!1066 = !DILocalVariable(name: "v", scope: !1055, file: !2, line: 134, type: !242)
!1067 = distinct !DIAssignID()
!1068 = !DILocation(line: 0, scope: !1055)
!1069 = !DILocation(line: 134, column: 1, scope: !1055)
!1070 = !DILocation(line: 134, column: 1, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !2, line: 134, column: 1)
