; ModuleID = 'spmv/ellpack/spmv_opt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "riscv64-unknown-linux-gnu"

%struct.bench_args_t = type { [4940 x double], [4940 x i32], [494 x double], [494 x double] }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str.1 = private unnamed_addr constant [34 x i8] c"fd>1 && \22Invalid file descriptor\22\00", align 1, !dbg !0
@.str.2 = private unnamed_addr constant [23 x i8] c"../../common/support.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.readfile = private unnamed_addr constant [20 x i8] c"char *readfile(int)\00", align 1, !dbg !12
@.str.4 = private unnamed_addr constant [51 x i8] c"0==fstat(fd, &s) && \22Couldn't determine file size\22\00", align 1, !dbg !18
@.str.6 = private unnamed_addr constant [25 x i8] c"len>0 && \22File is empty\22\00", align 1, !dbg !23
@.str.8 = private unnamed_addr constant [29 x i8] c"status>=0 && \22read() failed\22\00", align 1, !dbg !28
@.str.10 = private unnamed_addr constant [33 x i8] c"n>=0 && \22Invalid section number\22\00", align 1, !dbg !33
@__PRETTY_FUNCTION__.find_section_start = private unnamed_addr constant [38 x i8] c"char *find_section_start(char *, int)\00", align 1, !dbg !38
@.str.12 = private unnamed_addr constant [34 x i8] c"s!=NULL && \22Invalid input string\22\00", align 1, !dbg !43

!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 344, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 43)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !104, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 182, type: !99, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !99, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !99, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !118, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 328, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 41)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 7)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !123, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 240, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 30)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 6)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 90)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !40, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !65)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !171, isLocal: true, isDefinition: true)
!170 = !DIFile(filename: "../../common/harness.c", directory: "/home/kelvin/MachSuite/spmv/ellpack")
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 57)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !9, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 184, elements: !10)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !170, line: 22, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 11)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !170, line: 24, type: !181, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "INPUT_SIZE", scope: !188, file: !189, line: 4, type: !206, isLocal: false, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C11, file: !189, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !190, globals: !212, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "local_support.c", directory: "/home/kelvin/MachSuite/spmv/ellpack")
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bench_args_t", file: !193, line: 21, size: 537472, elements: !194)
!193 = !DIFile(filename: "./spmv.h", directory: "/home/kelvin/MachSuite/spmv/ellpack")
!194 = !{!195, !200, !207, !211}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nzval", scope: !192, file: !193, line: 22, baseType: !196, size: 316160)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 316160, elements: !198)
!197 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!198 = !{!199}
!199 = !DISubrange(count: 4940)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "cols", scope: !192, file: !193, line: 23, baseType: !201, size: 158080, offset: 316160)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 158080, elements: !198)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !203, line: 26, baseType: !204)
!203 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-intn.h", directory: "")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !205, line: 41, baseType: !206)
!205 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types.h", directory: "")
!206 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !192, file: !193, line: 24, baseType: !208, size: 31616, offset: 474240)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 31616, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 494)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !192, file: !193, line: 25, baseType: !208, size: 31616, offset: 505856)
!212 = !{!186}
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !151)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !124)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !170, line: 47, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 12)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !100)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !170, line: 58, type: !30, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !74)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !170, line: 67, type: !35, isLocal: true, isDefinition: true)
!234 = distinct !DICompileUnit(language: DW_LANG_C11, file: !235, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!235 = !DIFile(filename: "spmv.c", directory: "/home/kelvin/MachSuite/spmv/ellpack")
!236 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !237, globals: !263, splitDebugInlining: false, nameTableKind: None)
!237 = !{!238, !4, !239, !240, !244, !247, !250, !253, !256, !202, !259, !262, !197}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !241, line: 24, baseType: !242)
!241 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-uintn.h", directory: "")
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !205, line: 38, baseType: !243)
!243 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !241, line: 25, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !205, line: 40, baseType: !246)
!246 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !241, line: 26, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !205, line: 42, baseType: !249)
!249 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !241, line: 27, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !205, line: 45, baseType: !252)
!252 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !203, line: 24, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !205, line: 37, baseType: !255)
!255 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !203, line: 25, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !205, line: 39, baseType: !258)
!258 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !203, line: 27, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !205, line: 44, baseType: !261)
!261 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!262 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!263 = !{!264, !0, !7, !12, !269, !18, !271, !23, !276, !28, !278, !33, !38, !280, !43, !45, !47, !52, !57, !62, !67, !69, !71, !76, !78, !80, !82, !87, !89, !285, !92, !97, !102, !107, !112, !114, !116, !121, !126, !128, !130, !132, !134, !136, !141, !146, !148, !153, !290, !158, !163, !292, !165}
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !266, isLocal: true, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 24)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !30, isLocal: true, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 14)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !273, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !9, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 21)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !2, line: 154, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 13)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !20, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 27)
!297 = distinct !DICompileUnit(language: DW_LANG_C11, file: !170, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !298, globals: !299, splitDebugInlining: false, nameTableKind: None)
!298 = !{!239}
!299 = !{!300, !168, !174, !176, !179, !184, !302, !213, !304, !216, !219, !306, !224, !227, !311, !229, !232, !313}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !226, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !273, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !215, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !308, isLocal: true, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 31)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !215, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !170, line: 74, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 10)
!318 = !{!"clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)"}
!319 = !{i32 7, !"Dwarf Version", i32 4}
!320 = !{i32 2, !"Debug Info Version", i32 3}
!321 = !{i32 1, !"wchar_size", i32 4}
!322 = !{i32 1, !"target-abi", !"lp64d"}
!323 = distinct !{i32 6, !"riscv-isa", !324}
!324 = distinct !{!"rv64i2p1_m2p0_a2p1_f2p2_d2p2_zicsr2p0_zifencei2p0"}
!325 = !{i32 8, !"PIC Level", i32 2}
!326 = !{i32 7, !"PIE Level", i32 2}
!327 = !{i32 7, !"uwtable", i32 2}
!328 = !{i32 8, !"SmallDataLimit", i32 8}
!329 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!330 = distinct !DISubprogram(name: "spmv", scope: !235, file: !235, line: 8, type: !331, scopeLine: 9, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !234, retainedNodes: !335)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !333, !334, !333, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !348}
!336 = !DILocalVariable(name: "nzval", arg: 1, scope: !330, file: !235, line: 8, type: !333)
!337 = !DILocalVariable(name: "cols", arg: 2, scope: !330, file: !235, line: 8, type: !334)
!338 = !DILocalVariable(name: "vec", arg: 3, scope: !330, file: !235, line: 8, type: !333)
!339 = !DILocalVariable(name: "out", arg: 4, scope: !330, file: !235, line: 8, type: !333)
!340 = !DILocalVariable(name: "i", scope: !330, file: !235, line: 10, type: !206)
!341 = !DILocalVariable(name: "j", scope: !330, file: !235, line: 10, type: !206)
!342 = !DILocalVariable(name: "Si", scope: !330, file: !235, line: 11, type: !197)
!343 = !DILabel(scope: !330, name: "ellpack_1", file: !235, line: 13)
!344 = !DILocalVariable(name: "sum", scope: !345, file: !235, line: 14, type: !197)
!345 = distinct !DILexicalBlock(scope: !346, file: !235, line: 13, column: 37)
!346 = distinct !DILexicalBlock(scope: !347, file: !235, line: 13, column: 17)
!347 = distinct !DILexicalBlock(scope: !330, file: !235, line: 13, column: 17)
!348 = !DILabel(scope: !345, name: "ellpack_2", file: !235, line: 15)
!349 = !DILocation(line: 0, scope: !330)
!350 = !DILocation(line: 13, column: 5, scope: !330)
!351 = !DILocation(line: 13, column: 17, scope: !347)
!352 = !DILocation(line: 14, column: 20, scope: !345)
!353 = !DILocation(line: 0, scope: !345)
!354 = !DILocation(line: 15, column: 9, scope: !345)
!355 = !DILocation(line: 15, column: 21, scope: !356)
!356 = distinct !DILexicalBlock(scope: !345, file: !235, line: 15, column: 21)
!357 = !DILocation(line: 16, column: 30, scope: !358)
!358 = distinct !DILexicalBlock(scope: !359, file: !235, line: 15, column: 41)
!359 = distinct !DILexicalBlock(scope: !356, file: !235, line: 15, column: 21)
!360 = !DILocation(line: 16, column: 22, scope: !358)
!361 = !{!362, !362, i64 0}
!362 = !{!"double", !363, i64 0}
!363 = !{!"omnipotent char", !364, i64 0}
!364 = !{!"Simple C/C++ TBAA"}
!365 = !DILocation(line: 16, column: 43, scope: !358)
!366 = !{!367, !367, i64 0}
!367 = !{!"int", !363, i64 0}
!368 = !DILocation(line: 16, column: 39, scope: !358)
!369 = !DILocation(line: 16, column: 37, scope: !358)
!370 = !DILocation(line: 17, column: 21, scope: !358)
!371 = !DILocation(line: 15, column: 37, scope: !359)
!372 = !DILocation(line: 15, column: 32, scope: !359)
!373 = distinct !{!373, !355, !374, !375, !376}
!374 = !DILocation(line: 18, column: 9, scope: !356)
!375 = !{!"llvm.loop.mustprogress"}
!376 = !{!"llvm.loop.unroll.disable"}
!377 = !DILocation(line: 19, column: 16, scope: !345)
!378 = !DILocation(line: 13, column: 33, scope: !346)
!379 = !DILocation(line: 13, column: 28, scope: !346)
!380 = distinct !{!380, !351, !381, !375, !376}
!381 = !DILocation(line: 20, column: 5, scope: !347)
!382 = !DILocation(line: 21, column: 1, scope: !330)
!383 = distinct !DISubprogram(name: "run_benchmark", scope: !189, file: !189, line: 8, type: !384, scopeLine: 8, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !386)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !239}
!386 = !{!387, !388}
!387 = !DILocalVariable(name: "vargs", arg: 1, scope: !383, file: !189, line: 8, type: !239)
!388 = !DILocalVariable(name: "args", scope: !383, file: !189, line: 9, type: !191)
!389 = !DILocation(line: 0, scope: !383)
!390 = !DILocation(line: 10, column: 28, scope: !383)
!391 = !DILocation(line: 10, column: 40, scope: !383)
!392 = !DILocation(line: 10, column: 51, scope: !383)
!393 = !DILocation(line: 0, scope: !330, inlinedAt: !394)
!394 = distinct !DILocation(line: 10, column: 3, scope: !383)
!395 = !DILocation(line: 13, column: 5, scope: !330, inlinedAt: !394)
!396 = !DILocation(line: 13, column: 17, scope: !347, inlinedAt: !394)
!397 = !DILocation(line: 14, column: 20, scope: !345, inlinedAt: !394)
!398 = !DILocation(line: 0, scope: !345, inlinedAt: !394)
!399 = !DILocation(line: 15, column: 9, scope: !345, inlinedAt: !394)
!400 = !DILocation(line: 15, column: 21, scope: !356, inlinedAt: !394)
!401 = !DILocation(line: 16, column: 30, scope: !358, inlinedAt: !394)
!402 = !DILocation(line: 16, column: 22, scope: !358, inlinedAt: !394)
!403 = !DILocation(line: 16, column: 43, scope: !358, inlinedAt: !394)
!404 = !DILocation(line: 16, column: 39, scope: !358, inlinedAt: !394)
!405 = !DILocation(line: 16, column: 37, scope: !358, inlinedAt: !394)
!406 = !DILocation(line: 17, column: 21, scope: !358, inlinedAt: !394)
!407 = !DILocation(line: 15, column: 37, scope: !359, inlinedAt: !394)
!408 = !DILocation(line: 15, column: 32, scope: !359, inlinedAt: !394)
!409 = distinct !{!409, !400, !410, !375, !376}
!410 = !DILocation(line: 18, column: 9, scope: !356, inlinedAt: !394)
!411 = !DILocation(line: 19, column: 16, scope: !345, inlinedAt: !394)
!412 = !DILocation(line: 13, column: 33, scope: !346, inlinedAt: !394)
!413 = !DILocation(line: 13, column: 28, scope: !346, inlinedAt: !394)
!414 = distinct !{!414, !396, !415, !375, !376}
!415 = !DILocation(line: 20, column: 5, scope: !347, inlinedAt: !394)
!416 = !DILocation(line: 11, column: 1, scope: !383)
!417 = distinct !DISubprogram(name: "input_to_data", scope: !189, file: !189, line: 22, type: !418, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !420)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !206, !239}
!420 = !{!421, !422, !423, !424, !425}
!421 = !DILocalVariable(name: "fd", arg: 1, scope: !417, file: !189, line: 22, type: !206)
!422 = !DILocalVariable(name: "vdata", arg: 2, scope: !417, file: !189, line: 22, type: !239)
!423 = !DILocalVariable(name: "data", scope: !417, file: !189, line: 23, type: !191)
!424 = !DILocalVariable(name: "p", scope: !417, file: !189, line: 24, type: !238)
!425 = !DILocalVariable(name: "s", scope: !417, file: !189, line: 24, type: !238)
!426 = !DILocation(line: 0, scope: !417)
!427 = !DILocation(line: 26, column: 3, scope: !417)
!428 = !DILocation(line: 28, column: 7, scope: !417)
!429 = !DILocalVariable(name: "s", arg: 1, scope: !430, file: !2, line: 56, type: !238)
!430 = distinct !DISubprogram(name: "find_section_start", scope: !2, file: !2, line: 56, type: !431, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !433)
!431 = !DISubroutineType(types: !432)
!432 = !{!238, !238, !206}
!433 = !{!429, !434, !435}
!434 = !DILocalVariable(name: "n", arg: 2, scope: !430, file: !2, line: 56, type: !206)
!435 = !DILocalVariable(name: "i", scope: !430, file: !2, line: 57, type: !206)
!436 = !DILocation(line: 0, scope: !430, inlinedAt: !437)
!437 = distinct !DILocation(line: 30, column: 7, scope: !417)
!438 = !DILocation(line: 64, column: 17, scope: !430, inlinedAt: !437)
!439 = !{!363, !363, i64 0}
!440 = !DILocation(line: 64, column: 3, scope: !430, inlinedAt: !437)
!441 = !DILocation(line: 66, column: 22, scope: !442, inlinedAt: !437)
!442 = distinct !DILexicalBlock(scope: !443, file: !2, line: 66, column: 9)
!443 = distinct !DILexicalBlock(scope: !430, file: !2, line: 64, column: 31)
!444 = !DILocation(line: 66, column: 26, scope: !442, inlinedAt: !437)
!445 = !DILocation(line: 66, column: 32, scope: !442, inlinedAt: !437)
!446 = !DILocation(line: 66, column: 35, scope: !442, inlinedAt: !437)
!447 = !DILocation(line: 66, column: 39, scope: !442, inlinedAt: !437)
!448 = !DILocation(line: 66, column: 9, scope: !443, inlinedAt: !437)
!449 = !DILocation(line: 69, column: 6, scope: !443, inlinedAt: !437)
!450 = !DILocation(line: 64, column: 10, scope: !430, inlinedAt: !437)
!451 = !DILocation(line: 64, column: 13, scope: !430, inlinedAt: !437)
!452 = distinct !{!452, !440, !453, !375, !376}
!453 = !DILocation(line: 70, column: 3, scope: !430, inlinedAt: !437)
!454 = !DILocation(line: 71, column: 6, scope: !455, inlinedAt: !437)
!455 = distinct !DILexicalBlock(scope: !430, file: !2, line: 71, column: 6)
!456 = !DILocation(line: 71, column: 8, scope: !455, inlinedAt: !437)
!457 = !DILocation(line: 71, column: 6, scope: !430, inlinedAt: !437)
!458 = !DILocation(line: 31, column: 3, scope: !417)
!459 = !DILocation(line: 0, scope: !430, inlinedAt: !460)
!460 = distinct !DILocation(line: 33, column: 7, scope: !417)
!461 = !DILocation(line: 64, column: 17, scope: !430, inlinedAt: !460)
!462 = !DILocation(line: 64, column: 3, scope: !430, inlinedAt: !460)
!463 = !DILocation(line: 66, column: 22, scope: !442, inlinedAt: !460)
!464 = !DILocation(line: 66, column: 26, scope: !442, inlinedAt: !460)
!465 = !DILocation(line: 66, column: 32, scope: !442, inlinedAt: !460)
!466 = !DILocation(line: 66, column: 35, scope: !442, inlinedAt: !460)
!467 = !DILocation(line: 66, column: 39, scope: !442, inlinedAt: !460)
!468 = !DILocation(line: 66, column: 9, scope: !443, inlinedAt: !460)
!469 = !DILocation(line: 69, column: 6, scope: !443, inlinedAt: !460)
!470 = !DILocation(line: 64, column: 10, scope: !430, inlinedAt: !460)
!471 = !DILocation(line: 64, column: 13, scope: !430, inlinedAt: !460)
!472 = distinct !{!472, !462, !473, !375, !376}
!473 = !DILocation(line: 70, column: 3, scope: !430, inlinedAt: !460)
!474 = !DILocation(line: 71, column: 6, scope: !455, inlinedAt: !460)
!475 = !DILocation(line: 71, column: 8, scope: !455, inlinedAt: !460)
!476 = !DILocation(line: 71, column: 6, scope: !430, inlinedAt: !460)
!477 = !DILocation(line: 34, column: 32, scope: !417)
!478 = !DILocation(line: 34, column: 3, scope: !417)
!479 = !DILocation(line: 0, scope: !430, inlinedAt: !480)
!480 = distinct !DILocation(line: 36, column: 7, scope: !417)
!481 = !DILocation(line: 64, column: 17, scope: !430, inlinedAt: !480)
!482 = !DILocation(line: 64, column: 3, scope: !430, inlinedAt: !480)
!483 = !DILocation(line: 66, column: 22, scope: !442, inlinedAt: !480)
!484 = !DILocation(line: 66, column: 26, scope: !442, inlinedAt: !480)
!485 = !DILocation(line: 66, column: 32, scope: !442, inlinedAt: !480)
!486 = !DILocation(line: 66, column: 35, scope: !442, inlinedAt: !480)
!487 = !DILocation(line: 66, column: 39, scope: !442, inlinedAt: !480)
!488 = !DILocation(line: 66, column: 9, scope: !443, inlinedAt: !480)
!489 = !DILocation(line: 69, column: 6, scope: !443, inlinedAt: !480)
!490 = !DILocation(line: 64, column: 10, scope: !430, inlinedAt: !480)
!491 = !DILocation(line: 64, column: 13, scope: !430, inlinedAt: !480)
!492 = distinct !{!492, !482, !493, !375, !376}
!493 = !DILocation(line: 70, column: 3, scope: !430, inlinedAt: !480)
!494 = !DILocation(line: 71, column: 6, scope: !455, inlinedAt: !480)
!495 = !DILocation(line: 71, column: 8, scope: !455, inlinedAt: !480)
!496 = !DILocation(line: 71, column: 6, scope: !430, inlinedAt: !480)
!497 = !DILocation(line: 37, column: 37, scope: !417)
!498 = !DILocation(line: 37, column: 3, scope: !417)
!499 = !DILocation(line: 38, column: 3, scope: !417)
!500 = !DILocation(line: 39, column: 1, scope: !417)
!501 = !DISubprogram(name: "free", scope: !502, file: !502, line: 687, type: !384, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!502 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdlib.h", directory: "")
!503 = distinct !DISubprogram(name: "data_to_input", scope: !189, file: !189, line: 41, type: !418, scopeLine: 41, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !504)
!504 = !{!505, !506, !507}
!505 = !DILocalVariable(name: "fd", arg: 1, scope: !503, file: !189, line: 41, type: !206)
!506 = !DILocalVariable(name: "vdata", arg: 2, scope: !503, file: !189, line: 41, type: !239)
!507 = !DILocalVariable(name: "data", scope: !503, file: !189, line: 42, type: !191)
!508 = !DILocation(line: 0, scope: !503)
!509 = !DILocalVariable(name: "fd", arg: 1, scope: !510, file: !2, line: 189, type: !206)
!510 = distinct !DISubprogram(name: "write_section_header", scope: !2, file: !2, line: 189, type: !511, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !513)
!511 = !DISubroutineType(types: !512)
!512 = !{!206, !206}
!513 = !{!509}
!514 = !DILocation(line: 0, scope: !510, inlinedAt: !515)
!515 = distinct !DILocation(line: 44, column: 3, scope: !503)
!516 = !DILocation(line: 190, column: 3, scope: !517, inlinedAt: !515)
!517 = distinct !DILexicalBlock(scope: !518, file: !2, line: 190, column: 3)
!518 = distinct !DILexicalBlock(scope: !510, file: !2, line: 190, column: 3)
!519 = !DILocation(line: 191, column: 3, scope: !510, inlinedAt: !515)
!520 = !DILocalVariable(name: "fd", arg: 1, scope: !521, file: !2, line: 187, type: !206)
!521 = distinct !DISubprogram(name: "write_double_array", scope: !2, file: !2, line: 187, type: !522, scopeLine: 187, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !524)
!522 = !DISubroutineType(types: !523)
!523 = !{!206, !206, !333, !206}
!524 = !{!520, !525, !526, !527}
!525 = !DILocalVariable(name: "arr", arg: 2, scope: !521, file: !2, line: 187, type: !333)
!526 = !DILocalVariable(name: "n", arg: 3, scope: !521, file: !2, line: 187, type: !206)
!527 = !DILocalVariable(name: "i", scope: !521, file: !2, line: 187, type: !206)
!528 = !DILocation(line: 0, scope: !521, inlinedAt: !529)
!529 = distinct !DILocation(line: 45, column: 3, scope: !503)
!530 = !DILocation(line: 187, column: 1, scope: !531, inlinedAt: !529)
!531 = distinct !DILexicalBlock(scope: !521, file: !2, line: 187, column: 1)
!532 = !DILocation(line: 187, column: 1, scope: !533, inlinedAt: !529)
!533 = distinct !DILexicalBlock(scope: !534, file: !2, line: 187, column: 1)
!534 = distinct !DILexicalBlock(scope: !531, file: !2, line: 187, column: 1)
!535 = !DILocation(line: 187, column: 1, scope: !534, inlinedAt: !529)
!536 = distinct !{!536, !530, !530, !375, !376}
!537 = !DILocation(line: 0, scope: !510, inlinedAt: !538)
!538 = distinct !DILocation(line: 47, column: 3, scope: !503)
!539 = !DILocation(line: 191, column: 3, scope: !510, inlinedAt: !538)
!540 = !DILocation(line: 48, column: 33, scope: !503)
!541 = !DILocalVariable(name: "fd", arg: 1, scope: !542, file: !2, line: 183, type: !206)
!542 = distinct !DISubprogram(name: "write_int32_t_array", scope: !2, file: !2, line: 183, type: !543, scopeLine: 183, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !545)
!543 = !DISubroutineType(types: !544)
!544 = !{!206, !206, !334, !206}
!545 = !{!541, !546, !547, !548}
!546 = !DILocalVariable(name: "arr", arg: 2, scope: !542, file: !2, line: 183, type: !334)
!547 = !DILocalVariable(name: "n", arg: 3, scope: !542, file: !2, line: 183, type: !206)
!548 = !DILocalVariable(name: "i", scope: !542, file: !2, line: 183, type: !206)
!549 = !DILocation(line: 0, scope: !542, inlinedAt: !550)
!550 = distinct !DILocation(line: 48, column: 3, scope: !503)
!551 = !DILocation(line: 183, column: 1, scope: !552, inlinedAt: !550)
!552 = distinct !DILexicalBlock(scope: !542, file: !2, line: 183, column: 1)
!553 = !DILocation(line: 183, column: 1, scope: !554, inlinedAt: !550)
!554 = distinct !DILexicalBlock(scope: !555, file: !2, line: 183, column: 1)
!555 = distinct !DILexicalBlock(scope: !552, file: !2, line: 183, column: 1)
!556 = !DILocation(line: 183, column: 1, scope: !555, inlinedAt: !550)
!557 = distinct !{!557, !551, !551, !375, !376}
!558 = !DILocation(line: 0, scope: !510, inlinedAt: !559)
!559 = distinct !DILocation(line: 50, column: 3, scope: !503)
!560 = !DILocation(line: 191, column: 3, scope: !510, inlinedAt: !559)
!561 = !DILocation(line: 51, column: 38, scope: !503)
!562 = !DILocation(line: 0, scope: !521, inlinedAt: !563)
!563 = distinct !DILocation(line: 51, column: 3, scope: !503)
!564 = !DILocation(line: 187, column: 1, scope: !531, inlinedAt: !563)
!565 = !DILocation(line: 187, column: 1, scope: !533, inlinedAt: !563)
!566 = !DILocation(line: 187, column: 1, scope: !534, inlinedAt: !563)
!567 = distinct !{!567, !564, !564, !375, !376}
!568 = !DILocation(line: 52, column: 1, scope: !503)
!569 = distinct !DISubprogram(name: "output_to_data", scope: !189, file: !189, line: 59, type: !418, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !570)
!570 = !{!571, !572, !573, !574, !575}
!571 = !DILocalVariable(name: "fd", arg: 1, scope: !569, file: !189, line: 59, type: !206)
!572 = !DILocalVariable(name: "vdata", arg: 2, scope: !569, file: !189, line: 59, type: !239)
!573 = !DILocalVariable(name: "data", scope: !569, file: !189, line: 60, type: !191)
!574 = !DILocalVariable(name: "p", scope: !569, file: !189, line: 61, type: !238)
!575 = !DILocalVariable(name: "s", scope: !569, file: !189, line: 61, type: !238)
!576 = !DILocation(line: 0, scope: !569)
!577 = !DILocation(line: 63, column: 7, scope: !569)
!578 = !DILocation(line: 0, scope: !430, inlinedAt: !579)
!579 = distinct !DILocation(line: 65, column: 7, scope: !569)
!580 = !DILocation(line: 64, column: 17, scope: !430, inlinedAt: !579)
!581 = !DILocation(line: 64, column: 3, scope: !430, inlinedAt: !579)
!582 = !DILocation(line: 66, column: 22, scope: !442, inlinedAt: !579)
!583 = !DILocation(line: 66, column: 26, scope: !442, inlinedAt: !579)
!584 = !DILocation(line: 66, column: 32, scope: !442, inlinedAt: !579)
!585 = !DILocation(line: 66, column: 35, scope: !442, inlinedAt: !579)
!586 = !DILocation(line: 66, column: 39, scope: !442, inlinedAt: !579)
!587 = !DILocation(line: 66, column: 9, scope: !443, inlinedAt: !579)
!588 = !DILocation(line: 69, column: 6, scope: !443, inlinedAt: !579)
!589 = !DILocation(line: 64, column: 10, scope: !430, inlinedAt: !579)
!590 = !DILocation(line: 64, column: 13, scope: !430, inlinedAt: !579)
!591 = distinct !{!591, !581, !592, !375, !376}
!592 = !DILocation(line: 70, column: 3, scope: !430, inlinedAt: !579)
!593 = !DILocation(line: 71, column: 6, scope: !455, inlinedAt: !579)
!594 = !DILocation(line: 71, column: 8, scope: !455, inlinedAt: !579)
!595 = !DILocation(line: 71, column: 6, scope: !430, inlinedAt: !579)
!596 = !DILocation(line: 66, column: 37, scope: !569)
!597 = !DILocation(line: 66, column: 3, scope: !569)
!598 = !DILocation(line: 67, column: 3, scope: !569)
!599 = !DILocation(line: 68, column: 1, scope: !569)
!600 = distinct !DISubprogram(name: "data_to_output", scope: !189, file: !189, line: 70, type: !418, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !601)
!601 = !{!602, !603, !604}
!602 = !DILocalVariable(name: "fd", arg: 1, scope: !600, file: !189, line: 70, type: !206)
!603 = !DILocalVariable(name: "vdata", arg: 2, scope: !600, file: !189, line: 70, type: !239)
!604 = !DILocalVariable(name: "data", scope: !600, file: !189, line: 71, type: !191)
!605 = !DILocation(line: 0, scope: !600)
!606 = !DILocation(line: 0, scope: !510, inlinedAt: !607)
!607 = distinct !DILocation(line: 73, column: 3, scope: !600)
!608 = !DILocation(line: 190, column: 3, scope: !517, inlinedAt: !607)
!609 = !DILocation(line: 191, column: 3, scope: !510, inlinedAt: !607)
!610 = !DILocation(line: 74, column: 38, scope: !600)
!611 = !DILocation(line: 0, scope: !521, inlinedAt: !612)
!612 = distinct !DILocation(line: 74, column: 3, scope: !600)
!613 = !DILocation(line: 187, column: 1, scope: !531, inlinedAt: !612)
!614 = !DILocation(line: 187, column: 1, scope: !533, inlinedAt: !612)
!615 = !DILocation(line: 187, column: 1, scope: !534, inlinedAt: !612)
!616 = distinct !{!616, !613, !613, !375, !376}
!617 = !DILocation(line: 75, column: 1, scope: !600)
!618 = distinct !DISubprogram(name: "check_data", scope: !189, file: !189, line: 77, type: !619, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !621)
!619 = !DISubroutineType(types: !620)
!620 = !{!206, !239, !239}
!621 = !{!622, !623, !624, !625, !626, !627, !628}
!622 = !DILocalVariable(name: "vdata", arg: 1, scope: !618, file: !189, line: 77, type: !239)
!623 = !DILocalVariable(name: "vref", arg: 2, scope: !618, file: !189, line: 77, type: !239)
!624 = !DILocalVariable(name: "data", scope: !618, file: !189, line: 78, type: !191)
!625 = !DILocalVariable(name: "ref", scope: !618, file: !189, line: 79, type: !191)
!626 = !DILocalVariable(name: "has_errors", scope: !618, file: !189, line: 80, type: !206)
!627 = !DILocalVariable(name: "i", scope: !618, file: !189, line: 81, type: !206)
!628 = !DILocalVariable(name: "diff", scope: !618, file: !189, line: 82, type: !197)
!629 = !DILocation(line: 0, scope: !618)
!630 = !DILocation(line: 84, column: 3, scope: !631)
!631 = distinct !DILexicalBlock(scope: !618, file: !189, line: 84, column: 3)
!632 = !DILocation(line: 85, column: 12, scope: !633)
!633 = distinct !DILexicalBlock(scope: !634, file: !189, line: 84, column: 22)
!634 = distinct !DILexicalBlock(scope: !631, file: !189, line: 84, column: 3)
!635 = !DILocation(line: 85, column: 27, scope: !633)
!636 = !DILocation(line: 85, column: 25, scope: !633)
!637 = !DILocation(line: 86, column: 35, scope: !633)
!638 = !DILocation(line: 86, column: 16, scope: !633)
!639 = !DILocation(line: 84, column: 18, scope: !634)
!640 = !DILocation(line: 84, column: 13, scope: !634)
!641 = distinct !{!641, !630, !642, !375, !376}
!642 = !DILocation(line: 87, column: 3, scope: !631)
!643 = !DILocation(line: 90, column: 10, scope: !618)
!644 = !DILocation(line: 90, column: 3, scope: !618)
!645 = distinct !DISubprogram(name: "readfile", scope: !2, file: !2, line: 34, type: !646, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !648)
!646 = !DISubroutineType(types: !647)
!647 = !{!238, !206}
!648 = !{!649, !650, !651, !688, !691, !694}
!649 = !DILocalVariable(name: "fd", arg: 1, scope: !645, file: !2, line: 34, type: !206)
!650 = !DILocalVariable(name: "p", scope: !645, file: !2, line: 35, type: !238)
!651 = !DILocalVariable(name: "s", scope: !645, file: !2, line: 36, type: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !653, line: 44, size: 1024, elements: !654)
!653 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/struct_stat.h", directory: "")
!654 = !{!655, !657, !659, !661, !663, !665, !667, !668, !669, !671, !673, !674, !676, !684, !685, !686}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !652, file: !653, line: 46, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !205, line: 145, baseType: !252)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !652, file: !653, line: 47, baseType: !658, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !205, line: 148, baseType: !252)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !652, file: !653, line: 48, baseType: !660, size: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !205, line: 150, baseType: !249)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !652, file: !653, line: 49, baseType: !662, size: 32, offset: 160)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !205, line: 151, baseType: !249)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !652, file: !653, line: 50, baseType: !664, size: 32, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !205, line: 146, baseType: !249)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !652, file: !653, line: 51, baseType: !666, size: 32, offset: 224)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !205, line: 147, baseType: !249)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !652, file: !653, line: 52, baseType: !656, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !652, file: !653, line: 53, baseType: !656, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !652, file: !653, line: 54, baseType: !670, size: 64, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !205, line: 152, baseType: !261)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !652, file: !653, line: 55, baseType: !672, size: 32, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !205, line: 175, baseType: !206)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !652, file: !653, line: 56, baseType: !206, size: 32, offset: 480)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !652, file: !653, line: 57, baseType: !675, size: 64, offset: 512)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !205, line: 180, baseType: !261)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !652, file: !653, line: 65, baseType: !677, size: 128, offset: 576)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !678, line: 11, size: 128, elements: !679)
!678 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_timespec.h", directory: "")
!679 = !{!680, !682}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !677, file: !678, line: 16, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !205, line: 160, baseType: !261)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !677, file: !678, line: 21, baseType: !683, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !205, line: 197, baseType: !261)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !652, file: !653, line: 66, baseType: !677, size: 128, offset: 704)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !652, file: !653, line: 67, baseType: !677, size: 128, offset: 832)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !652, file: !653, line: 79, baseType: !687, size: 64, offset: 960)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 64, elements: !55)
!688 = !DILocalVariable(name: "len", scope: !645, file: !2, line: 37, type: !689)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !690, line: 85, baseType: !670)
!690 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/types.h", directory: "")
!691 = !DILocalVariable(name: "bytes_read", scope: !645, file: !2, line: 38, type: !692)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !690, line: 108, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !205, line: 194, baseType: !261)
!694 = !DILocalVariable(name: "status", scope: !645, file: !2, line: 38, type: !692)
!695 = distinct !DIAssignID()
!696 = !DILocation(line: 0, scope: !645)
!697 = !DILocation(line: 36, column: 3, scope: !645)
!698 = !DILocation(line: 40, column: 3, scope: !699)
!699 = distinct !DILexicalBlock(scope: !700, file: !2, line: 40, column: 3)
!700 = distinct !DILexicalBlock(scope: !645, file: !2, line: 40, column: 3)
!701 = !DILocation(line: 41, column: 3, scope: !702)
!702 = distinct !DILexicalBlock(scope: !703, file: !2, line: 41, column: 3)
!703 = distinct !DILexicalBlock(scope: !645, file: !2, line: 41, column: 3)
!704 = !DILocation(line: 42, column: 11, scope: !645)
!705 = !DILocation(line: 43, column: 3, scope: !706)
!706 = distinct !DILexicalBlock(scope: !707, file: !2, line: 43, column: 3)
!707 = distinct !DILexicalBlock(scope: !645, file: !2, line: 43, column: 3)
!708 = !DILocation(line: 44, column: 25, scope: !645)
!709 = !DILocation(line: 44, column: 15, scope: !645)
!710 = !DILocation(line: 46, column: 3, scope: !645)
!711 = !DILocation(line: 49, column: 15, scope: !712)
!712 = distinct !DILexicalBlock(scope: !645, file: !2, line: 46, column: 27)
!713 = !DILocation(line: 46, column: 20, scope: !645)
!714 = distinct !{!714, !710, !715, !375, !376}
!715 = !DILocation(line: 50, column: 3, scope: !645)
!716 = !DILocation(line: 47, column: 24, scope: !712)
!717 = !DILocation(line: 47, column: 42, scope: !712)
!718 = !DILocation(line: 47, column: 14, scope: !712)
!719 = !DILocation(line: 48, column: 5, scope: !720)
!720 = distinct !DILexicalBlock(scope: !721, file: !2, line: 48, column: 5)
!721 = distinct !DILexicalBlock(scope: !712, file: !2, line: 48, column: 5)
!722 = !DILocation(line: 51, column: 3, scope: !645)
!723 = !DILocation(line: 51, column: 10, scope: !645)
!724 = !DILocation(line: 52, column: 3, scope: !645)
!725 = !DILocation(line: 54, column: 1, scope: !645)
!726 = !DILocation(line: 53, column: 3, scope: !645)
!727 = !DISubprogram(name: "__assert_fail", scope: !728, file: !728, line: 67, type: !729, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!728 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/assert.h", directory: "")
!729 = !DISubroutineType(types: !730)
!730 = !{null, !731, !731, !249, !731}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!732 = !DISubprogram(name: "fstat", scope: !733, file: !733, line: 210, type: !734, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!733 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/stat.h", directory: "")
!734 = !DISubroutineType(types: !735)
!735 = !{!206, !206, !736}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!737 = !DISubprogram(name: "malloc", scope: !502, file: !502, line: 672, type: !738, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!738 = !DISubroutineType(types: !739)
!739 = !{!239, !740}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !741, line: 18, baseType: !252)
!741 = !DIFile(filename: "/opt/riscv/lib/clang/18/include/__stddef_size_t.h", directory: "")
!742 = !DISubprogram(name: "read", scope: !743, file: !743, line: 371, type: !744, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!743 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/unistd.h", directory: "")
!744 = !DISubroutineType(types: !745)
!745 = !{!692, !206, !239, !740}
!746 = !DISubprogram(name: "close", scope: !743, file: !743, line: 358, type: !511, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!747 = !DILocation(line: 0, scope: !430)
!748 = !DILocation(line: 59, column: 3, scope: !749)
!749 = distinct !DILexicalBlock(scope: !750, file: !2, line: 59, column: 3)
!750 = distinct !DILexicalBlock(scope: !430, file: !2, line: 59, column: 3)
!751 = !DILocation(line: 60, column: 7, scope: !752)
!752 = distinct !DILexicalBlock(scope: !430, file: !2, line: 60, column: 6)
!753 = !DILocation(line: 60, column: 6, scope: !430)
!754 = !DILocation(line: 64, column: 17, scope: !430)
!755 = !DILocation(line: 64, column: 3, scope: !430)
!756 = !DILocation(line: 66, column: 22, scope: !442)
!757 = !DILocation(line: 66, column: 26, scope: !442)
!758 = !DILocation(line: 66, column: 32, scope: !442)
!759 = !DILocation(line: 66, column: 35, scope: !442)
!760 = !DILocation(line: 66, column: 39, scope: !442)
!761 = !DILocation(line: 66, column: 9, scope: !443)
!762 = !DILocation(line: 69, column: 6, scope: !443)
!763 = !DILocation(line: 64, column: 10, scope: !430)
!764 = !DILocation(line: 64, column: 13, scope: !430)
!765 = distinct !{!765, !755, !766, !375, !376}
!766 = !DILocation(line: 70, column: 3, scope: !430)
!767 = !DILocation(line: 71, column: 6, scope: !455)
!768 = !DILocation(line: 71, column: 8, scope: !455)
!769 = !DILocation(line: 71, column: 6, scope: !430)
!770 = !DILocation(line: 74, column: 1, scope: !430)
!771 = distinct !DISubprogram(name: "parse_string", scope: !2, file: !2, line: 77, type: !772, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !774)
!772 = !DISubroutineType(types: !773)
!773 = !{!206, !238, !238, !206}
!774 = !{!775, !776, !777, !778}
!775 = !DILocalVariable(name: "s", arg: 1, scope: !771, file: !2, line: 77, type: !238)
!776 = !DILocalVariable(name: "arr", arg: 2, scope: !771, file: !2, line: 77, type: !238)
!777 = !DILocalVariable(name: "n", arg: 3, scope: !771, file: !2, line: 77, type: !206)
!778 = !DILocalVariable(name: "k", scope: !771, file: !2, line: 78, type: !206)
!779 = !DILocation(line: 0, scope: !771)
!780 = !DILocation(line: 79, column: 3, scope: !781)
!781 = distinct !DILexicalBlock(scope: !782, file: !2, line: 79, column: 3)
!782 = distinct !DILexicalBlock(scope: !771, file: !2, line: 79, column: 3)
!783 = !DILocation(line: 81, column: 8, scope: !784)
!784 = distinct !DILexicalBlock(scope: !771, file: !2, line: 81, column: 7)
!785 = !DILocation(line: 81, column: 7, scope: !771)
!786 = !DILocation(line: 83, column: 12, scope: !787)
!787 = distinct !DILexicalBlock(scope: !784, file: !2, line: 81, column: 13)
!788 = !DILocation(line: 83, column: 5, scope: !787)
!789 = !DILocation(line: 91, column: 19, scope: !771)
!790 = !DILocation(line: 91, column: 3, scope: !771)
!791 = !DILocation(line: 92, column: 7, scope: !771)
!792 = !DILocation(line: 83, column: 16, scope: !787)
!793 = !DILocation(line: 83, column: 26, scope: !787)
!794 = !DILocation(line: 83, column: 32, scope: !787)
!795 = !DILocation(line: 83, column: 29, scope: !787)
!796 = !DILocation(line: 83, column: 35, scope: !787)
!797 = !DILocation(line: 83, column: 45, scope: !787)
!798 = !DILocation(line: 83, column: 48, scope: !787)
!799 = !DILocation(line: 83, column: 54, scope: !787)
!800 = !DILocation(line: 84, column: 9, scope: !787)
!801 = !DILocation(line: 84, column: 18, scope: !787)
!802 = !DILocation(line: 84, column: 26, scope: !787)
!803 = distinct !{!803, !788, !804, !375, !376}
!804 = !DILocation(line: 86, column: 5, scope: !787)
!805 = !DILocation(line: 93, column: 5, scope: !806)
!806 = distinct !DILexicalBlock(scope: !771, file: !2, line: 92, column: 7)
!807 = !DILocation(line: 93, column: 12, scope: !806)
!808 = !DILocation(line: 95, column: 3, scope: !771)
!809 = distinct !DISubprogram(name: "parse_uint8_t_array", scope: !2, file: !2, line: 132, type: !810, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !813)
!810 = !DISubroutineType(types: !811)
!811 = !{!206, !238, !812, !206}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!813 = !{!814, !815, !816, !817, !818, !819, !820}
!814 = !DILocalVariable(name: "s", arg: 1, scope: !809, file: !2, line: 132, type: !238)
!815 = !DILocalVariable(name: "arr", arg: 2, scope: !809, file: !2, line: 132, type: !812)
!816 = !DILocalVariable(name: "n", arg: 3, scope: !809, file: !2, line: 132, type: !206)
!817 = !DILocalVariable(name: "line", scope: !809, file: !2, line: 132, type: !238)
!818 = !DILocalVariable(name: "endptr", scope: !809, file: !2, line: 132, type: !238)
!819 = !DILocalVariable(name: "i", scope: !809, file: !2, line: 132, type: !206)
!820 = !DILocalVariable(name: "v", scope: !809, file: !2, line: 132, type: !240)
!821 = distinct !DIAssignID()
!822 = !DILocation(line: 0, scope: !809)
!823 = !DILocation(line: 132, column: 1, scope: !809)
!824 = !DILocation(line: 132, column: 1, scope: !825)
!825 = distinct !DILexicalBlock(scope: !826, file: !2, line: 132, column: 1)
!826 = distinct !DILexicalBlock(scope: !809, file: !2, line: 132, column: 1)
!827 = !DILocation(line: 132, column: 1, scope: !828)
!828 = distinct !DILexicalBlock(scope: !809, file: !2, line: 132, column: 1)
!829 = !{!830, !830, i64 0}
!830 = !{!"any pointer", !363, i64 0}
!831 = distinct !DIAssignID()
!832 = !DILocation(line: 132, column: 1, scope: !833)
!833 = distinct !DILexicalBlock(scope: !828, file: !2, line: 132, column: 1)
!834 = !DILocation(line: 132, column: 1, scope: !835)
!835 = distinct !DILexicalBlock(scope: !833, file: !2, line: 132, column: 1)
!836 = distinct !{!836, !823, !823, !375, !376}
!837 = !DILocation(line: 132, column: 1, scope: !838)
!838 = distinct !DILexicalBlock(scope: !839, file: !2, line: 132, column: 1)
!839 = distinct !DILexicalBlock(scope: !809, file: !2, line: 132, column: 1)
!840 = !DISubprogram(name: "strtok", scope: !841, file: !841, line: 356, type: !842, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!841 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/string.h", directory: "")
!842 = !DISubroutineType(types: !843)
!843 = !{!238, !844, !845}
!844 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !238)
!845 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !731)
!846 = !DISubprogram(name: "strtol", scope: !502, file: !502, line: 177, type: !847, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!847 = !DISubroutineType(types: !848)
!848 = !{!261, !845, !849, !206}
!849 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!851 = !DISubprogram(name: "fprintf", scope: !852, file: !852, line: 357, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!852 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdio.h", directory: "")
!853 = !DISubroutineType(types: !854)
!854 = !{!206, !855, !845, null}
!855 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !856)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !858, line: 7, baseType: !859)
!858 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/FILE.h", directory: "")
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !860, line: 49, size: 1728, elements: !861)
!860 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_FILE.h", directory: "")
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !877, !879, !880, !881, !882, !883, !884, !888, !891, !893, !896, !899, !900, !901, !903, !904}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !859, file: !860, line: 51, baseType: !206, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !859, file: !860, line: 54, baseType: !238, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !859, file: !860, line: 55, baseType: !238, size: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !859, file: !860, line: 56, baseType: !238, size: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !859, file: !860, line: 57, baseType: !238, size: 64, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !859, file: !860, line: 58, baseType: !238, size: 64, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !859, file: !860, line: 59, baseType: !238, size: 64, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !859, file: !860, line: 60, baseType: !238, size: 64, offset: 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !859, file: !860, line: 61, baseType: !238, size: 64, offset: 512)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !859, file: !860, line: 64, baseType: !238, size: 64, offset: 576)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !859, file: !860, line: 65, baseType: !238, size: 64, offset: 640)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !859, file: !860, line: 66, baseType: !238, size: 64, offset: 704)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !859, file: !860, line: 68, baseType: !875, size: 64, offset: 768)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !860, line: 36, flags: DIFlagFwdDecl)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !859, file: !860, line: 70, baseType: !878, size: 64, offset: 832)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !859, file: !860, line: 72, baseType: !206, size: 32, offset: 896)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !859, file: !860, line: 73, baseType: !206, size: 32, offset: 928)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !859, file: !860, line: 74, baseType: !670, size: 64, offset: 960)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !859, file: !860, line: 77, baseType: !246, size: 16, offset: 1024)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !859, file: !860, line: 78, baseType: !255, size: 8, offset: 1040)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !859, file: !860, line: 79, baseType: !885, size: 8, offset: 1048)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 1)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !859, file: !860, line: 81, baseType: !889, size: 64, offset: 1088)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !860, line: 43, baseType: null)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !859, file: !860, line: 89, baseType: !892, size: 64, offset: 1152)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !205, line: 153, baseType: !261)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !859, file: !860, line: 91, baseType: !894, size: 64, offset: 1216)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !860, line: 37, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !859, file: !860, line: 92, baseType: !897, size: 64, offset: 1280)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !860, line: 38, flags: DIFlagFwdDecl)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !859, file: !860, line: 93, baseType: !878, size: 64, offset: 1344)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !859, file: !860, line: 94, baseType: !239, size: 64, offset: 1408)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_prevchain", scope: !859, file: !860, line: 95, baseType: !902, size: 64, offset: 1472)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !859, file: !860, line: 96, baseType: !206, size: 32, offset: 1536)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !859, file: !860, line: 98, baseType: !905, size: 160, offset: 1568)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !16)
!906 = !DISubprogram(name: "strlen", scope: !841, file: !841, line: 407, type: !907, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!907 = !DISubroutineType(types: !908)
!908 = !{!252, !731}
!909 = distinct !DISubprogram(name: "parse_uint16_t_array", scope: !2, file: !2, line: 133, type: !910, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !913)
!910 = !DISubroutineType(types: !911)
!911 = !{!206, !238, !912, !206}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!913 = !{!914, !915, !916, !917, !918, !919, !920}
!914 = !DILocalVariable(name: "s", arg: 1, scope: !909, file: !2, line: 133, type: !238)
!915 = !DILocalVariable(name: "arr", arg: 2, scope: !909, file: !2, line: 133, type: !912)
!916 = !DILocalVariable(name: "n", arg: 3, scope: !909, file: !2, line: 133, type: !206)
!917 = !DILocalVariable(name: "line", scope: !909, file: !2, line: 133, type: !238)
!918 = !DILocalVariable(name: "endptr", scope: !909, file: !2, line: 133, type: !238)
!919 = !DILocalVariable(name: "i", scope: !909, file: !2, line: 133, type: !206)
!920 = !DILocalVariable(name: "v", scope: !909, file: !2, line: 133, type: !244)
!921 = distinct !DIAssignID()
!922 = !DILocation(line: 0, scope: !909)
!923 = !DILocation(line: 133, column: 1, scope: !909)
!924 = !DILocation(line: 133, column: 1, scope: !925)
!925 = distinct !DILexicalBlock(scope: !926, file: !2, line: 133, column: 1)
!926 = distinct !DILexicalBlock(scope: !909, file: !2, line: 133, column: 1)
!927 = !DILocation(line: 133, column: 1, scope: !928)
!928 = distinct !DILexicalBlock(scope: !909, file: !2, line: 133, column: 1)
!929 = distinct !DIAssignID()
!930 = !DILocation(line: 133, column: 1, scope: !931)
!931 = distinct !DILexicalBlock(scope: !928, file: !2, line: 133, column: 1)
!932 = !DILocation(line: 133, column: 1, scope: !933)
!933 = distinct !DILexicalBlock(scope: !931, file: !2, line: 133, column: 1)
!934 = !{!935, !935, i64 0}
!935 = !{!"short", !363, i64 0}
!936 = distinct !{!936, !923, !923, !375, !376}
!937 = !DILocation(line: 133, column: 1, scope: !938)
!938 = distinct !DILexicalBlock(scope: !939, file: !2, line: 133, column: 1)
!939 = distinct !DILexicalBlock(scope: !909, file: !2, line: 133, column: 1)
!940 = distinct !DISubprogram(name: "parse_uint32_t_array", scope: !2, file: !2, line: 134, type: !941, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !944)
!941 = !DISubroutineType(types: !942)
!942 = !{!206, !238, !943, !206}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!944 = !{!945, !946, !947, !948, !949, !950, !951}
!945 = !DILocalVariable(name: "s", arg: 1, scope: !940, file: !2, line: 134, type: !238)
!946 = !DILocalVariable(name: "arr", arg: 2, scope: !940, file: !2, line: 134, type: !943)
!947 = !DILocalVariable(name: "n", arg: 3, scope: !940, file: !2, line: 134, type: !206)
!948 = !DILocalVariable(name: "line", scope: !940, file: !2, line: 134, type: !238)
!949 = !DILocalVariable(name: "endptr", scope: !940, file: !2, line: 134, type: !238)
!950 = !DILocalVariable(name: "i", scope: !940, file: !2, line: 134, type: !206)
!951 = !DILocalVariable(name: "v", scope: !940, file: !2, line: 134, type: !247)
!952 = distinct !DIAssignID()
!953 = !DILocation(line: 0, scope: !940)
!954 = !DILocation(line: 134, column: 1, scope: !940)
!955 = !DILocation(line: 134, column: 1, scope: !956)
!956 = distinct !DILexicalBlock(scope: !957, file: !2, line: 134, column: 1)
!957 = distinct !DILexicalBlock(scope: !940, file: !2, line: 134, column: 1)
!958 = !DILocation(line: 134, column: 1, scope: !959)
