; ModuleID = 'stencil/stencil3d/stencil_opt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "riscv64-unknown-linux-gnu"

%struct.bench_args_t = type { [2 x i32], [16384 x i32], [16384 x i32] }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str.1 = private unnamed_addr constant [34 x i8] c"fd>1 && \22Invalid file descriptor\22\00", align 1, !dbg !0
@.str.2 = private unnamed_addr constant [23 x i8] c"../../common/support.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.readfile = private unnamed_addr constant [20 x i8] c"char *readfile(int)\00", align 1, !dbg !12
@.str.4 = private unnamed_addr constant [51 x i8] c"0==fstat(fd, &s) && \22Couldn't determine file size\22\00", align 1, !dbg !18
@.str.6 = private unnamed_addr constant [25 x i8] c"len>0 && \22File is empty\22\00", align 1, !dbg !23
@.str.8 = private unnamed_addr constant [29 x i8] c"status>=0 && \22read() failed\22\00", align 1, !dbg !28
@.str.10 = private unnamed_addr constant [33 x i8] c"n>=0 && \22Invalid section number\22\00", align 1, !dbg !33
@__PRETTY_FUNCTION__.find_section_start = private unnamed_addr constant [38 x i8] c"char *find_section_start(char *, int)\00", align 1, !dbg !38
@.str.12 = private unnamed_addr constant [34 x i8] c"s!=NULL && \22Invalid input string\22\00", align 1, !dbg !43

!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 182, type: !99, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !99, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !99, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !118, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 328, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 41)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 7)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !123, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 240, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 30)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 6)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 90)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !40, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !65)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !171, isLocal: true, isDefinition: true)
!170 = !DIFile(filename: "../../common/harness.c", directory: "/home/kelvin/MachSuite/stencil/stencil3d")
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 57)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !9, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 184, elements: !10)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !170, line: 22, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 11)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !170, line: 24, type: !181, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "INPUT_SIZE", scope: !188, file: !189, line: 4, type: !201, isLocal: false, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C11, file: !189, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !190, globals: !207, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "local_support.c", directory: "/home/kelvin/MachSuite/stencil/stencil3d")
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bench_args_t", file: !193, line: 29, size: 1048640, elements: !194)
!193 = !DIFile(filename: "./stencil.h", directory: "/home/kelvin/MachSuite/stencil/stencil3d")
!194 = !{!195, !202, !206}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !192, file: !193, line: 30, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 64, elements: !55)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !198, line: 26, baseType: !199)
!198 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-intn.h", directory: "")
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !200, line: 41, baseType: !201)
!200 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types.h", directory: "")
!201 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !192, file: !193, line: 31, baseType: !203, size: 524288, offset: 64)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 524288, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 16384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sol", scope: !192, file: !193, line: 32, baseType: !203, size: 524288, offset: 524352)
!207 = !{!186}
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !210, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !151)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !124)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !170, line: 47, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 12)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !100)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !170, line: 58, type: !30, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !74)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !170, line: 67, type: !35, isLocal: true, isDefinition: true)
!229 = distinct !DICompileUnit(language: DW_LANG_C11, file: !230, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!230 = !DIFile(filename: "stencil.c", directory: "/home/kelvin/MachSuite/stencil/stencil3d")
!231 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !232, globals: !259, splitDebugInlining: false, nameTableKind: None)
!232 = !{!233, !4, !234, !235, !239, !242, !245, !248, !251, !197, !254, !257, !258}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !236, line: 24, baseType: !237)
!236 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-uintn.h", directory: "")
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !200, line: 38, baseType: !238)
!238 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !236, line: 25, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !200, line: 40, baseType: !241)
!241 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !236, line: 26, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !200, line: 42, baseType: !244)
!244 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !236, line: 27, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !200, line: 45, baseType: !247)
!247 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !198, line: 24, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !200, line: 37, baseType: !250)
!250 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !198, line: 25, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !200, line: 39, baseType: !253)
!253 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !198, line: 27, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !200, line: 44, baseType: !256)
!256 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!257 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!258 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!259 = !{!260, !0, !7, !12, !265, !18, !267, !23, !272, !28, !274, !33, !38, !276, !43, !45, !47, !52, !57, !62, !67, !69, !71, !76, !78, !80, !82, !87, !89, !281, !92, !97, !102, !107, !112, !114, !116, !121, !126, !128, !130, !132, !134, !136, !141, !146, !148, !153, !286, !158, !163, !288, !165}
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !262, isLocal: true, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 24)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !30, isLocal: true, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !269, isLocal: true, isDefinition: true)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 14)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !269, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !9, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !278, isLocal: true, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 21)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !2, line: 154, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 13)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !20, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !290, isLocal: true, isDefinition: true)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 27)
!293 = distinct !DICompileUnit(language: DW_LANG_C11, file: !170, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !294, globals: !295, splitDebugInlining: false, nameTableKind: None)
!294 = !{!234}
!295 = !{!296, !168, !174, !176, !179, !184, !298, !208, !300, !211, !214, !302, !219, !222, !307, !224, !227, !309}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !221, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !269, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !210, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 31)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !210, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !170, line: 74, type: !311, isLocal: true, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 10)
!314 = !{!"clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)"}
!315 = !{i32 7, !"Dwarf Version", i32 4}
!316 = !{i32 2, !"Debug Info Version", i32 3}
!317 = !{i32 1, !"wchar_size", i32 4}
!318 = !{i32 1, !"target-abi", !"lp64d"}
!319 = distinct !{i32 6, !"riscv-isa", !320}
!320 = distinct !{!"rv64i2p1_m2p0_a2p1_f2p2_d2p2_zicsr2p0_zifencei2p0"}
!321 = !{i32 8, !"PIC Level", i32 2}
!322 = !{i32 7, !"PIE Level", i32 2}
!323 = !{i32 7, !"uwtable", i32 2}
!324 = !{i32 8, !"SmallDataLimit", i32 8}
!325 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!326 = distinct !DISubprogram(name: "stencil", scope: !230, file: !230, line: 10, type: !327, scopeLine: 10, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !229, retainedNodes: !330)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !329, !329, !329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !346, !347, !351, !352, !356, !357, !361}
!331 = !DILocalVariable(name: "C", arg: 1, scope: !326, file: !230, line: 10, type: !329)
!332 = !DILocalVariable(name: "orig", arg: 2, scope: !326, file: !230, line: 10, type: !329)
!333 = !DILocalVariable(name: "sol", arg: 3, scope: !326, file: !230, line: 10, type: !329)
!334 = !DILocalVariable(name: "i", scope: !326, file: !230, line: 11, type: !201)
!335 = !DILocalVariable(name: "j", scope: !326, file: !230, line: 11, type: !201)
!336 = !DILocalVariable(name: "k", scope: !326, file: !230, line: 11, type: !201)
!337 = !DILocalVariable(name: "sum0", scope: !326, file: !230, line: 12, type: !197)
!338 = !DILocalVariable(name: "sum1", scope: !326, file: !230, line: 12, type: !197)
!339 = !DILocalVariable(name: "mul0", scope: !326, file: !230, line: 12, type: !197)
!340 = !DILocalVariable(name: "mul1", scope: !326, file: !230, line: 12, type: !197)
!341 = !DILabel(scope: !326, name: "height_bound_col", file: !230, line: 15)
!342 = !DILabel(scope: !343, name: "height_bound_row", file: !230, line: 16)
!343 = distinct !DILexicalBlock(scope: !344, file: !230, line: 15, column: 50)
!344 = distinct !DILexicalBlock(scope: !345, file: !230, line: 15, column: 24)
!345 = distinct !DILexicalBlock(scope: !326, file: !230, line: 15, column: 24)
!346 = !DILabel(scope: !326, name: "col_bound_height", file: !230, line: 21)
!347 = !DILabel(scope: !348, name: "col_bound_row", file: !230, line: 22)
!348 = distinct !DILexicalBlock(scope: !349, file: !230, line: 21, column: 55)
!349 = distinct !DILexicalBlock(scope: !350, file: !230, line: 21, column: 24)
!350 = distinct !DILexicalBlock(scope: !326, file: !230, line: 21, column: 24)
!351 = !DILabel(scope: !326, name: "row_bound_height", file: !230, line: 27)
!352 = !DILabel(scope: !353, name: "row_bound_col", file: !230, line: 28)
!353 = distinct !DILexicalBlock(scope: !354, file: !230, line: 27, column: 55)
!354 = distinct !DILexicalBlock(scope: !355, file: !230, line: 27, column: 24)
!355 = distinct !DILexicalBlock(scope: !326, file: !230, line: 27, column: 24)
!356 = !DILabel(scope: !326, name: "loop_height", file: !230, line: 36)
!357 = !DILabel(scope: !358, name: "loop_col", file: !230, line: 37)
!358 = distinct !DILexicalBlock(scope: !359, file: !230, line: 36, column: 55)
!359 = distinct !DILexicalBlock(scope: !360, file: !230, line: 36, column: 19)
!360 = distinct !DILexicalBlock(scope: !326, file: !230, line: 36, column: 19)
!361 = !DILabel(scope: !362, name: "loop_row", file: !230, line: 38)
!362 = distinct !DILexicalBlock(scope: !363, file: !230, line: 37, column: 53)
!363 = distinct !DILexicalBlock(scope: !364, file: !230, line: 37, column: 20)
!364 = distinct !DILexicalBlock(scope: !358, file: !230, line: 37, column: 20)
!365 = !DILocation(line: 0, scope: !326)
!366 = !DILocation(line: 15, column: 5, scope: !326)
!367 = !DILocation(line: 15, column: 24, scope: !345)
!368 = !DILocation(line: 16, column: 28, scope: !369)
!369 = distinct !DILexicalBlock(scope: !343, file: !230, line: 16, column: 28)
!370 = !DILocation(line: 17, column: 59, scope: !371)
!371 = distinct !DILexicalBlock(scope: !372, file: !230, line: 16, column: 54)
!372 = distinct !DILexicalBlock(scope: !369, file: !230, line: 16, column: 28)
!373 = !DILocation(line: 17, column: 54, scope: !371)
!374 = !{!375, !375, i64 0}
!375 = !{!"int", !376, i64 0}
!376 = !{!"omnipotent char", !377, i64 0}
!377 = !{!"Simple C/C++ TBAA"}
!378 = !DILocation(line: 17, column: 13, scope: !371)
!379 = !DILocation(line: 17, column: 52, scope: !371)
!380 = !DILocation(line: 18, column: 66, scope: !371)
!381 = !DILocation(line: 18, column: 13, scope: !371)
!382 = !DILocation(line: 18, column: 64, scope: !371)
!383 = !DILocation(line: 16, column: 50, scope: !372)
!384 = !DILocation(line: 16, column: 38, scope: !372)
!385 = distinct !{!385, !368, !386, !387, !388}
!386 = !DILocation(line: 19, column: 9, scope: !369)
!387 = !{!"llvm.loop.mustprogress"}
!388 = !{!"llvm.loop.unroll.disable"}
!389 = !DILocation(line: 15, column: 46, scope: !344)
!390 = !DILocation(line: 15, column: 34, scope: !344)
!391 = distinct !{!391, !367, !392, !387, !388}
!392 = !DILocation(line: 20, column: 5, scope: !345)
!393 = !DILocation(line: 22, column: 25, scope: !394)
!394 = distinct !DILexicalBlock(scope: !348, file: !230, line: 22, column: 25)
!395 = !DILocation(line: 23, column: 59, scope: !396)
!396 = distinct !DILexicalBlock(scope: !397, file: !230, line: 22, column: 51)
!397 = distinct !DILexicalBlock(scope: !394, file: !230, line: 22, column: 25)
!398 = !DILocation(line: 23, column: 54, scope: !396)
!399 = !DILocation(line: 23, column: 13, scope: !396)
!400 = !DILocation(line: 23, column: 52, scope: !396)
!401 = !DILocation(line: 24, column: 63, scope: !396)
!402 = !DILocation(line: 24, column: 13, scope: !396)
!403 = !DILocation(line: 24, column: 61, scope: !396)
!404 = !DILocation(line: 22, column: 47, scope: !397)
!405 = !DILocation(line: 22, column: 35, scope: !397)
!406 = distinct !{!406, !393, !407, !387, !388}
!407 = !DILocation(line: 25, column: 9, scope: !394)
!408 = !DILocation(line: 21, column: 51, scope: !349)
!409 = !DILocation(line: 21, column: 34, scope: !349)
!410 = !DILocation(line: 21, column: 24, scope: !350)
!411 = distinct !{!411, !410, !412, !387, !388}
!412 = !DILocation(line: 26, column: 5, scope: !350)
!413 = !DILocation(line: 28, column: 25, scope: !414)
!414 = distinct !DILexicalBlock(scope: !353, file: !230, line: 28, column: 25)
!415 = !DILocation(line: 36, column: 19, scope: !360)
!416 = !DILocation(line: 29, column: 59, scope: !417)
!417 = distinct !DILexicalBlock(scope: !418, file: !230, line: 28, column: 53)
!418 = distinct !DILexicalBlock(scope: !414, file: !230, line: 28, column: 25)
!419 = !DILocation(line: 29, column: 54, scope: !417)
!420 = !DILocation(line: 29, column: 13, scope: !417)
!421 = !DILocation(line: 29, column: 52, scope: !417)
!422 = !DILocation(line: 30, column: 68, scope: !417)
!423 = !DILocation(line: 30, column: 63, scope: !417)
!424 = !DILocation(line: 30, column: 13, scope: !417)
!425 = !DILocation(line: 30, column: 61, scope: !417)
!426 = !DILocation(line: 28, column: 49, scope: !418)
!427 = !DILocation(line: 28, column: 35, scope: !418)
!428 = distinct !{!428, !413, !429, !387, !388}
!429 = !DILocation(line: 31, column: 9, scope: !414)
!430 = !DILocation(line: 27, column: 51, scope: !354)
!431 = !DILocation(line: 27, column: 34, scope: !354)
!432 = !DILocation(line: 27, column: 24, scope: !355)
!433 = distinct !{!433, !432, !434, !387, !388}
!434 = !DILocation(line: 32, column: 5, scope: !355)
!435 = !DILocation(line: 37, column: 20, scope: !364)
!436 = !DILocation(line: 38, column: 24, scope: !437)
!437 = distinct !DILexicalBlock(scope: !362, file: !230, line: 38, column: 24)
!438 = !DILocation(line: 39, column: 29, scope: !439)
!439 = distinct !DILexicalBlock(scope: !440, file: !230, line: 38, column: 57)
!440 = distinct !DILexicalBlock(scope: !437, file: !230, line: 38, column: 24)
!441 = !DILocation(line: 39, column: 24, scope: !439)
!442 = !DILocation(line: 40, column: 24, scope: !439)
!443 = !DILocation(line: 41, column: 24, scope: !439)
!444 = !DILocation(line: 40, column: 68, scope: !439)
!445 = !DILocation(line: 42, column: 24, scope: !439)
!446 = !DILocation(line: 41, column: 68, scope: !439)
!447 = !DILocation(line: 43, column: 24, scope: !439)
!448 = !DILocation(line: 42, column: 68, scope: !439)
!449 = !DILocation(line: 44, column: 29, scope: !439)
!450 = !DILocation(line: 44, column: 24, scope: !439)
!451 = !DILocation(line: 43, column: 68, scope: !439)
!452 = !DILocation(line: 45, column: 24, scope: !439)
!453 = !DILocation(line: 44, column: 68, scope: !439)
!454 = !DILocation(line: 46, column: 31, scope: !439)
!455 = !DILocation(line: 46, column: 29, scope: !439)
!456 = !DILocation(line: 47, column: 31, scope: !439)
!457 = !DILocation(line: 47, column: 29, scope: !439)
!458 = !DILocation(line: 48, column: 63, scope: !439)
!459 = !DILocation(line: 48, column: 17, scope: !439)
!460 = !DILocation(line: 48, column: 56, scope: !439)
!461 = !DILocation(line: 38, column: 37, scope: !440)
!462 = distinct !{!462, !436, !463, !387, !388}
!463 = !DILocation(line: 49, column: 13, scope: !437)
!464 = !DILocation(line: 37, column: 50, scope: !363)
!465 = !DILocation(line: 37, column: 33, scope: !363)
!466 = distinct !{!466, !435, !467, !387, !388}
!467 = !DILocation(line: 50, column: 9, scope: !364)
!468 = !DILocation(line: 36, column: 52, scope: !359)
!469 = !DILocation(line: 36, column: 32, scope: !359)
!470 = distinct !{!470, !415, !471, !387, !388}
!471 = !DILocation(line: 51, column: 5, scope: !360)
!472 = !DILocation(line: 52, column: 1, scope: !326)
!473 = !{!474}
!474 = distinct !{!474, !475, !"polly.alias.scope.MemRef0"}
!475 = distinct !{!475, !"polly.alias.scope.domain"}
!476 = !{!477, !478}
!477 = distinct !{!477, !475, !"polly.alias.scope.MemRef1"}
!478 = distinct !{!478, !475, !"polly.alias.scope.MemRef2"}
!479 = !{!477}
!480 = !{!474, !478}
!481 = distinct !DISubprogram(name: "run_benchmark", scope: !189, file: !189, line: 8, type: !482, scopeLine: 8, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !484)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !234}
!484 = !{!485, !486}
!485 = !DILocalVariable(name: "vargs", arg: 1, scope: !481, file: !189, line: 8, type: !234)
!486 = !DILocalVariable(name: "args", scope: !481, file: !189, line: 9, type: !191)
!487 = !DILocation(line: 0, scope: !481)
!488 = !DILocation(line: 10, column: 27, scope: !481)
!489 = !DILocation(line: 10, column: 39, scope: !481)
!490 = !DILocation(line: 10, column: 3, scope: !481)
!491 = !DILocation(line: 11, column: 1, scope: !481)
!492 = distinct !DISubprogram(name: "input_to_data", scope: !189, file: !189, line: 20, type: !493, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !495)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !201, !234}
!495 = !{!496, !497, !498, !499, !500}
!496 = !DILocalVariable(name: "fd", arg: 1, scope: !492, file: !189, line: 20, type: !201)
!497 = !DILocalVariable(name: "vdata", arg: 2, scope: !492, file: !189, line: 20, type: !234)
!498 = !DILocalVariable(name: "data", scope: !492, file: !189, line: 21, type: !191)
!499 = !DILocalVariable(name: "p", scope: !492, file: !189, line: 22, type: !233)
!500 = !DILocalVariable(name: "s", scope: !492, file: !189, line: 22, type: !233)
!501 = !DILocation(line: 0, scope: !492)
!502 = !DILocation(line: 24, column: 7, scope: !492)
!503 = !DILocalVariable(name: "s", arg: 1, scope: !504, file: !2, line: 56, type: !233)
!504 = distinct !DISubprogram(name: "find_section_start", scope: !2, file: !2, line: 56, type: !505, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !507)
!505 = !DISubroutineType(types: !506)
!506 = !{!233, !233, !201}
!507 = !{!503, !508, !509}
!508 = !DILocalVariable(name: "n", arg: 2, scope: !504, file: !2, line: 56, type: !201)
!509 = !DILocalVariable(name: "i", scope: !504, file: !2, line: 57, type: !201)
!510 = !DILocation(line: 0, scope: !504, inlinedAt: !511)
!511 = distinct !DILocation(line: 26, column: 7, scope: !492)
!512 = !DILocation(line: 64, column: 17, scope: !504, inlinedAt: !511)
!513 = !{!376, !376, i64 0}
!514 = !DILocation(line: 64, column: 3, scope: !504, inlinedAt: !511)
!515 = !DILocation(line: 66, column: 22, scope: !516, inlinedAt: !511)
!516 = distinct !DILexicalBlock(scope: !517, file: !2, line: 66, column: 9)
!517 = distinct !DILexicalBlock(scope: !504, file: !2, line: 64, column: 31)
!518 = !DILocation(line: 66, column: 26, scope: !516, inlinedAt: !511)
!519 = !DILocation(line: 66, column: 32, scope: !516, inlinedAt: !511)
!520 = !DILocation(line: 66, column: 35, scope: !516, inlinedAt: !511)
!521 = !DILocation(line: 66, column: 39, scope: !516, inlinedAt: !511)
!522 = !DILocation(line: 66, column: 9, scope: !517, inlinedAt: !511)
!523 = !DILocation(line: 69, column: 6, scope: !517, inlinedAt: !511)
!524 = !DILocation(line: 64, column: 10, scope: !504, inlinedAt: !511)
!525 = !DILocation(line: 64, column: 13, scope: !504, inlinedAt: !511)
!526 = distinct !{!526, !514, !527, !387, !388}
!527 = !DILocation(line: 70, column: 3, scope: !504, inlinedAt: !511)
!528 = !DILocation(line: 71, column: 6, scope: !529, inlinedAt: !511)
!529 = distinct !DILexicalBlock(scope: !504, file: !2, line: 71, column: 6)
!530 = !DILocation(line: 71, column: 8, scope: !529, inlinedAt: !511)
!531 = !DILocation(line: 71, column: 6, scope: !504, inlinedAt: !511)
!532 = !DILocation(line: 27, column: 3, scope: !492)
!533 = !DILocation(line: 0, scope: !504, inlinedAt: !534)
!534 = distinct !DILocation(line: 29, column: 7, scope: !492)
!535 = !DILocation(line: 64, column: 17, scope: !504, inlinedAt: !534)
!536 = !DILocation(line: 64, column: 3, scope: !504, inlinedAt: !534)
!537 = !DILocation(line: 66, column: 22, scope: !516, inlinedAt: !534)
!538 = !DILocation(line: 66, column: 26, scope: !516, inlinedAt: !534)
!539 = !DILocation(line: 66, column: 32, scope: !516, inlinedAt: !534)
!540 = !DILocation(line: 66, column: 35, scope: !516, inlinedAt: !534)
!541 = !DILocation(line: 66, column: 39, scope: !516, inlinedAt: !534)
!542 = !DILocation(line: 66, column: 9, scope: !517, inlinedAt: !534)
!543 = !DILocation(line: 69, column: 6, scope: !517, inlinedAt: !534)
!544 = !DILocation(line: 64, column: 10, scope: !504, inlinedAt: !534)
!545 = !DILocation(line: 64, column: 13, scope: !504, inlinedAt: !534)
!546 = distinct !{!546, !536, !547, !387, !388}
!547 = !DILocation(line: 70, column: 3, scope: !504, inlinedAt: !534)
!548 = !DILocation(line: 71, column: 6, scope: !529, inlinedAt: !534)
!549 = !DILocation(line: 71, column: 8, scope: !529, inlinedAt: !534)
!550 = !DILocation(line: 71, column: 6, scope: !504, inlinedAt: !534)
!551 = !DILocation(line: 30, column: 37, scope: !492)
!552 = !DILocation(line: 30, column: 3, scope: !492)
!553 = !DILocation(line: 31, column: 3, scope: !492)
!554 = !DILocation(line: 32, column: 1, scope: !492)
!555 = !DISubprogram(name: "free", scope: !556, file: !556, line: 687, type: !482, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!556 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdlib.h", directory: "")
!557 = distinct !DISubprogram(name: "data_to_input", scope: !189, file: !189, line: 34, type: !493, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !558)
!558 = !{!559, !560, !561}
!559 = !DILocalVariable(name: "fd", arg: 1, scope: !557, file: !189, line: 34, type: !201)
!560 = !DILocalVariable(name: "vdata", arg: 2, scope: !557, file: !189, line: 34, type: !234)
!561 = !DILocalVariable(name: "data", scope: !557, file: !189, line: 35, type: !191)
!562 = !DILocation(line: 0, scope: !557)
!563 = !DILocalVariable(name: "fd", arg: 1, scope: !564, file: !2, line: 189, type: !201)
!564 = distinct !DISubprogram(name: "write_section_header", scope: !2, file: !2, line: 189, type: !565, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !567)
!565 = !DISubroutineType(types: !566)
!566 = !{!201, !201}
!567 = !{!563}
!568 = !DILocation(line: 0, scope: !564, inlinedAt: !569)
!569 = distinct !DILocation(line: 37, column: 3, scope: !557)
!570 = !DILocation(line: 190, column: 3, scope: !571, inlinedAt: !569)
!571 = distinct !DILexicalBlock(scope: !572, file: !2, line: 190, column: 3)
!572 = distinct !DILexicalBlock(scope: !564, file: !2, line: 190, column: 3)
!573 = !DILocation(line: 191, column: 3, scope: !564, inlinedAt: !569)
!574 = !DILocalVariable(name: "fd", arg: 1, scope: !575, file: !2, line: 183, type: !201)
!575 = distinct !DISubprogram(name: "write_int32_t_array", scope: !2, file: !2, line: 183, type: !576, scopeLine: 183, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !578)
!576 = !DISubroutineType(types: !577)
!577 = !{!201, !201, !329, !201}
!578 = !{!574, !579, !580, !581}
!579 = !DILocalVariable(name: "arr", arg: 2, scope: !575, file: !2, line: 183, type: !329)
!580 = !DILocalVariable(name: "n", arg: 3, scope: !575, file: !2, line: 183, type: !201)
!581 = !DILocalVariable(name: "i", scope: !575, file: !2, line: 183, type: !201)
!582 = !DILocation(line: 0, scope: !575, inlinedAt: !583)
!583 = distinct !DILocation(line: 38, column: 3, scope: !557)
!584 = !DILocation(line: 183, column: 1, scope: !585, inlinedAt: !583)
!585 = distinct !DILexicalBlock(scope: !575, file: !2, line: 183, column: 1)
!586 = !DILocation(line: 183, column: 1, scope: !587, inlinedAt: !583)
!587 = distinct !DILexicalBlock(scope: !588, file: !2, line: 183, column: 1)
!588 = distinct !DILexicalBlock(scope: !585, file: !2, line: 183, column: 1)
!589 = !DILocation(line: 183, column: 1, scope: !588, inlinedAt: !583)
!590 = distinct !{!590, !584, !584, !387, !388}
!591 = !DILocation(line: 0, scope: !564, inlinedAt: !592)
!592 = distinct !DILocation(line: 40, column: 3, scope: !557)
!593 = !DILocation(line: 191, column: 3, scope: !564, inlinedAt: !592)
!594 = !DILocation(line: 41, column: 38, scope: !557)
!595 = !DILocation(line: 0, scope: !575, inlinedAt: !596)
!596 = distinct !DILocation(line: 41, column: 3, scope: !557)
!597 = !DILocation(line: 183, column: 1, scope: !585, inlinedAt: !596)
!598 = !DILocation(line: 183, column: 1, scope: !587, inlinedAt: !596)
!599 = !DILocation(line: 183, column: 1, scope: !588, inlinedAt: !596)
!600 = distinct !{!600, !597, !597, !387, !388}
!601 = !DILocation(line: 42, column: 1, scope: !557)
!602 = distinct !DISubprogram(name: "output_to_data", scope: !189, file: !189, line: 49, type: !493, scopeLine: 49, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !603)
!603 = !{!604, !605, !606, !607, !608}
!604 = !DILocalVariable(name: "fd", arg: 1, scope: !602, file: !189, line: 49, type: !201)
!605 = !DILocalVariable(name: "vdata", arg: 2, scope: !602, file: !189, line: 49, type: !234)
!606 = !DILocalVariable(name: "data", scope: !602, file: !189, line: 50, type: !191)
!607 = !DILocalVariable(name: "p", scope: !602, file: !189, line: 51, type: !233)
!608 = !DILocalVariable(name: "s", scope: !602, file: !189, line: 51, type: !233)
!609 = !DILocation(line: 0, scope: !602)
!610 = !DILocation(line: 53, column: 7, scope: !602)
!611 = !DILocation(line: 0, scope: !504, inlinedAt: !612)
!612 = distinct !DILocation(line: 55, column: 7, scope: !602)
!613 = !DILocation(line: 64, column: 17, scope: !504, inlinedAt: !612)
!614 = !DILocation(line: 64, column: 3, scope: !504, inlinedAt: !612)
!615 = !DILocation(line: 66, column: 22, scope: !516, inlinedAt: !612)
!616 = !DILocation(line: 66, column: 26, scope: !516, inlinedAt: !612)
!617 = !DILocation(line: 66, column: 32, scope: !516, inlinedAt: !612)
!618 = !DILocation(line: 66, column: 35, scope: !516, inlinedAt: !612)
!619 = !DILocation(line: 66, column: 39, scope: !516, inlinedAt: !612)
!620 = !DILocation(line: 66, column: 9, scope: !517, inlinedAt: !612)
!621 = !DILocation(line: 69, column: 6, scope: !517, inlinedAt: !612)
!622 = !DILocation(line: 64, column: 10, scope: !504, inlinedAt: !612)
!623 = !DILocation(line: 64, column: 13, scope: !504, inlinedAt: !612)
!624 = distinct !{!624, !614, !625, !387, !388}
!625 = !DILocation(line: 70, column: 3, scope: !504, inlinedAt: !612)
!626 = !DILocation(line: 71, column: 6, scope: !529, inlinedAt: !612)
!627 = !DILocation(line: 71, column: 8, scope: !529, inlinedAt: !612)
!628 = !DILocation(line: 71, column: 6, scope: !504, inlinedAt: !612)
!629 = !DILocation(line: 56, column: 37, scope: !602)
!630 = !DILocation(line: 56, column: 3, scope: !602)
!631 = !DILocation(line: 57, column: 3, scope: !602)
!632 = !DILocation(line: 58, column: 1, scope: !602)
!633 = distinct !DISubprogram(name: "data_to_output", scope: !189, file: !189, line: 60, type: !493, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !634)
!634 = !{!635, !636, !637}
!635 = !DILocalVariable(name: "fd", arg: 1, scope: !633, file: !189, line: 60, type: !201)
!636 = !DILocalVariable(name: "vdata", arg: 2, scope: !633, file: !189, line: 60, type: !234)
!637 = !DILocalVariable(name: "data", scope: !633, file: !189, line: 61, type: !191)
!638 = !DILocation(line: 0, scope: !633)
!639 = !DILocation(line: 0, scope: !564, inlinedAt: !640)
!640 = distinct !DILocation(line: 63, column: 3, scope: !633)
!641 = !DILocation(line: 190, column: 3, scope: !571, inlinedAt: !640)
!642 = !DILocation(line: 191, column: 3, scope: !564, inlinedAt: !640)
!643 = !DILocation(line: 64, column: 38, scope: !633)
!644 = !DILocation(line: 0, scope: !575, inlinedAt: !645)
!645 = distinct !DILocation(line: 64, column: 3, scope: !633)
!646 = !DILocation(line: 183, column: 1, scope: !585, inlinedAt: !645)
!647 = !DILocation(line: 183, column: 1, scope: !587, inlinedAt: !645)
!648 = !DILocation(line: 183, column: 1, scope: !588, inlinedAt: !645)
!649 = distinct !{!649, !646, !646, !387, !388}
!650 = !DILocation(line: 65, column: 1, scope: !633)
!651 = distinct !DISubprogram(name: "check_data", scope: !189, file: !189, line: 67, type: !652, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !654)
!652 = !DISubroutineType(types: !653)
!653 = !{!201, !234, !234}
!654 = !{!655, !656, !657, !658, !659, !660, !661}
!655 = !DILocalVariable(name: "vdata", arg: 1, scope: !651, file: !189, line: 67, type: !234)
!656 = !DILocalVariable(name: "vref", arg: 2, scope: !651, file: !189, line: 67, type: !234)
!657 = !DILocalVariable(name: "data", scope: !651, file: !189, line: 68, type: !191)
!658 = !DILocalVariable(name: "ref", scope: !651, file: !189, line: 69, type: !191)
!659 = !DILocalVariable(name: "has_errors", scope: !651, file: !189, line: 70, type: !201)
!660 = !DILocalVariable(name: "i", scope: !651, file: !189, line: 71, type: !201)
!661 = !DILocalVariable(name: "diff", scope: !651, file: !189, line: 72, type: !197)
!662 = !DILocation(line: 0, scope: !651)
!663 = !DILocation(line: 74, column: 3, scope: !664)
!664 = distinct !DILexicalBlock(scope: !651, file: !189, line: 74, column: 3)
!665 = !DILocation(line: 75, column: 12, scope: !666)
!666 = distinct !DILexicalBlock(scope: !667, file: !189, line: 74, column: 25)
!667 = distinct !DILexicalBlock(scope: !664, file: !189, line: 74, column: 3)
!668 = !DILocation(line: 75, column: 27, scope: !666)
!669 = !DILocation(line: 76, column: 35, scope: !666)
!670 = !DILocation(line: 76, column: 16, scope: !666)
!671 = !DILocation(line: 74, column: 21, scope: !667)
!672 = !DILocation(line: 74, column: 13, scope: !667)
!673 = distinct !{!673, !663, !674, !387, !388}
!674 = !DILocation(line: 77, column: 3, scope: !664)
!675 = !DILocation(line: 80, column: 10, scope: !651)
!676 = !DILocation(line: 80, column: 3, scope: !651)
!677 = distinct !DISubprogram(name: "readfile", scope: !2, file: !2, line: 34, type: !678, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !680)
!678 = !DISubroutineType(types: !679)
!679 = !{!233, !201}
!680 = !{!681, !682, !683, !720, !723, !726}
!681 = !DILocalVariable(name: "fd", arg: 1, scope: !677, file: !2, line: 34, type: !201)
!682 = !DILocalVariable(name: "p", scope: !677, file: !2, line: 35, type: !233)
!683 = !DILocalVariable(name: "s", scope: !677, file: !2, line: 36, type: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !685, line: 44, size: 1024, elements: !686)
!685 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/struct_stat.h", directory: "")
!686 = !{!687, !689, !691, !693, !695, !697, !699, !700, !701, !703, !705, !706, !708, !716, !717, !718}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !684, file: !685, line: 46, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !200, line: 145, baseType: !247)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !684, file: !685, line: 47, baseType: !690, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !200, line: 148, baseType: !247)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !684, file: !685, line: 48, baseType: !692, size: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !200, line: 150, baseType: !244)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !684, file: !685, line: 49, baseType: !694, size: 32, offset: 160)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !200, line: 151, baseType: !244)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !684, file: !685, line: 50, baseType: !696, size: 32, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !200, line: 146, baseType: !244)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !684, file: !685, line: 51, baseType: !698, size: 32, offset: 224)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !200, line: 147, baseType: !244)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !684, file: !685, line: 52, baseType: !688, size: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !684, file: !685, line: 53, baseType: !688, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !684, file: !685, line: 54, baseType: !702, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !200, line: 152, baseType: !256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !684, file: !685, line: 55, baseType: !704, size: 32, offset: 448)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !200, line: 175, baseType: !201)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !684, file: !685, line: 56, baseType: !201, size: 32, offset: 480)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !684, file: !685, line: 57, baseType: !707, size: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !200, line: 180, baseType: !256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !684, file: !685, line: 65, baseType: !709, size: 128, offset: 576)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !710, line: 11, size: 128, elements: !711)
!710 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_timespec.h", directory: "")
!711 = !{!712, !714}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !709, file: !710, line: 16, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !200, line: 160, baseType: !256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !709, file: !710, line: 21, baseType: !715, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !200, line: 197, baseType: !256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !684, file: !685, line: 66, baseType: !709, size: 128, offset: 704)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !684, file: !685, line: 67, baseType: !709, size: 128, offset: 832)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !684, file: !685, line: 79, baseType: !719, size: 64, offset: 960)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 64, elements: !55)
!720 = !DILocalVariable(name: "len", scope: !677, file: !2, line: 37, type: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !722, line: 85, baseType: !702)
!722 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/types.h", directory: "")
!723 = !DILocalVariable(name: "bytes_read", scope: !677, file: !2, line: 38, type: !724)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !722, line: 108, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !200, line: 194, baseType: !256)
!726 = !DILocalVariable(name: "status", scope: !677, file: !2, line: 38, type: !724)
!727 = distinct !DIAssignID()
!728 = !DILocation(line: 0, scope: !677)
!729 = !DILocation(line: 36, column: 3, scope: !677)
!730 = !DILocation(line: 40, column: 3, scope: !731)
!731 = distinct !DILexicalBlock(scope: !732, file: !2, line: 40, column: 3)
!732 = distinct !DILexicalBlock(scope: !677, file: !2, line: 40, column: 3)
!733 = !DILocation(line: 41, column: 3, scope: !734)
!734 = distinct !DILexicalBlock(scope: !735, file: !2, line: 41, column: 3)
!735 = distinct !DILexicalBlock(scope: !677, file: !2, line: 41, column: 3)
!736 = !DILocation(line: 42, column: 11, scope: !677)
!737 = !DILocation(line: 43, column: 3, scope: !738)
!738 = distinct !DILexicalBlock(scope: !739, file: !2, line: 43, column: 3)
!739 = distinct !DILexicalBlock(scope: !677, file: !2, line: 43, column: 3)
!740 = !DILocation(line: 44, column: 25, scope: !677)
!741 = !DILocation(line: 44, column: 15, scope: !677)
!742 = !DILocation(line: 46, column: 3, scope: !677)
!743 = !DILocation(line: 49, column: 15, scope: !744)
!744 = distinct !DILexicalBlock(scope: !677, file: !2, line: 46, column: 27)
!745 = !DILocation(line: 46, column: 20, scope: !677)
!746 = distinct !{!746, !742, !747, !387, !388}
!747 = !DILocation(line: 50, column: 3, scope: !677)
!748 = !DILocation(line: 47, column: 24, scope: !744)
!749 = !DILocation(line: 47, column: 42, scope: !744)
!750 = !DILocation(line: 47, column: 14, scope: !744)
!751 = !DILocation(line: 48, column: 5, scope: !752)
!752 = distinct !DILexicalBlock(scope: !753, file: !2, line: 48, column: 5)
!753 = distinct !DILexicalBlock(scope: !744, file: !2, line: 48, column: 5)
!754 = !DILocation(line: 51, column: 3, scope: !677)
!755 = !DILocation(line: 51, column: 10, scope: !677)
!756 = !DILocation(line: 52, column: 3, scope: !677)
!757 = !DILocation(line: 54, column: 1, scope: !677)
!758 = !DILocation(line: 53, column: 3, scope: !677)
!759 = !DISubprogram(name: "__assert_fail", scope: !760, file: !760, line: 67, type: !761, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!760 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/assert.h", directory: "")
!761 = !DISubroutineType(types: !762)
!762 = !{null, !763, !763, !244, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!764 = !DISubprogram(name: "fstat", scope: !765, file: !765, line: 210, type: !766, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!765 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/stat.h", directory: "")
!766 = !DISubroutineType(types: !767)
!767 = !{!201, !201, !768}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!769 = !DISubprogram(name: "malloc", scope: !556, file: !556, line: 672, type: !770, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!770 = !DISubroutineType(types: !771)
!771 = !{!234, !772}
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !773, line: 18, baseType: !247)
!773 = !DIFile(filename: "/opt/riscv/lib/clang/18/include/__stddef_size_t.h", directory: "")
!774 = !DISubprogram(name: "read", scope: !775, file: !775, line: 371, type: !776, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!775 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/unistd.h", directory: "")
!776 = !DISubroutineType(types: !777)
!777 = !{!724, !201, !234, !772}
!778 = !DISubprogram(name: "close", scope: !775, file: !775, line: 358, type: !565, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!779 = !DILocation(line: 0, scope: !504)
!780 = !DILocation(line: 59, column: 3, scope: !781)
!781 = distinct !DILexicalBlock(scope: !782, file: !2, line: 59, column: 3)
!782 = distinct !DILexicalBlock(scope: !504, file: !2, line: 59, column: 3)
!783 = !DILocation(line: 60, column: 7, scope: !784)
!784 = distinct !DILexicalBlock(scope: !504, file: !2, line: 60, column: 6)
!785 = !DILocation(line: 60, column: 6, scope: !504)
!786 = !DILocation(line: 64, column: 17, scope: !504)
!787 = !DILocation(line: 64, column: 3, scope: !504)
!788 = !DILocation(line: 66, column: 22, scope: !516)
!789 = !DILocation(line: 66, column: 26, scope: !516)
!790 = !DILocation(line: 66, column: 32, scope: !516)
!791 = !DILocation(line: 66, column: 35, scope: !516)
!792 = !DILocation(line: 66, column: 39, scope: !516)
!793 = !DILocation(line: 66, column: 9, scope: !517)
!794 = !DILocation(line: 69, column: 6, scope: !517)
!795 = !DILocation(line: 64, column: 10, scope: !504)
!796 = !DILocation(line: 64, column: 13, scope: !504)
!797 = distinct !{!797, !787, !798, !387, !388}
!798 = !DILocation(line: 70, column: 3, scope: !504)
!799 = !DILocation(line: 71, column: 6, scope: !529)
!800 = !DILocation(line: 71, column: 8, scope: !529)
!801 = !DILocation(line: 71, column: 6, scope: !504)
!802 = !DILocation(line: 74, column: 1, scope: !504)
!803 = distinct !DISubprogram(name: "parse_string", scope: !2, file: !2, line: 77, type: !804, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !806)
!804 = !DISubroutineType(types: !805)
!805 = !{!201, !233, !233, !201}
!806 = !{!807, !808, !809, !810}
!807 = !DILocalVariable(name: "s", arg: 1, scope: !803, file: !2, line: 77, type: !233)
!808 = !DILocalVariable(name: "arr", arg: 2, scope: !803, file: !2, line: 77, type: !233)
!809 = !DILocalVariable(name: "n", arg: 3, scope: !803, file: !2, line: 77, type: !201)
!810 = !DILocalVariable(name: "k", scope: !803, file: !2, line: 78, type: !201)
!811 = !DILocation(line: 0, scope: !803)
!812 = !DILocation(line: 79, column: 3, scope: !813)
!813 = distinct !DILexicalBlock(scope: !814, file: !2, line: 79, column: 3)
!814 = distinct !DILexicalBlock(scope: !803, file: !2, line: 79, column: 3)
!815 = !DILocation(line: 81, column: 8, scope: !816)
!816 = distinct !DILexicalBlock(scope: !803, file: !2, line: 81, column: 7)
!817 = !DILocation(line: 81, column: 7, scope: !803)
!818 = !DILocation(line: 83, column: 12, scope: !819)
!819 = distinct !DILexicalBlock(scope: !816, file: !2, line: 81, column: 13)
!820 = !DILocation(line: 83, column: 5, scope: !819)
!821 = !DILocation(line: 91, column: 19, scope: !803)
!822 = !DILocation(line: 91, column: 3, scope: !803)
!823 = !DILocation(line: 92, column: 7, scope: !803)
!824 = !DILocation(line: 83, column: 16, scope: !819)
!825 = !DILocation(line: 83, column: 26, scope: !819)
!826 = !DILocation(line: 83, column: 32, scope: !819)
!827 = !DILocation(line: 83, column: 29, scope: !819)
!828 = !DILocation(line: 83, column: 35, scope: !819)
!829 = !DILocation(line: 83, column: 45, scope: !819)
!830 = !DILocation(line: 83, column: 48, scope: !819)
!831 = !DILocation(line: 83, column: 54, scope: !819)
!832 = !DILocation(line: 84, column: 9, scope: !819)
!833 = !DILocation(line: 84, column: 18, scope: !819)
!834 = !DILocation(line: 84, column: 26, scope: !819)
!835 = distinct !{!835, !820, !836, !387, !388}
!836 = !DILocation(line: 86, column: 5, scope: !819)
!837 = !DILocation(line: 93, column: 5, scope: !838)
!838 = distinct !DILexicalBlock(scope: !803, file: !2, line: 92, column: 7)
!839 = !DILocation(line: 93, column: 12, scope: !838)
!840 = !DILocation(line: 95, column: 3, scope: !803)
!841 = distinct !DISubprogram(name: "parse_uint8_t_array", scope: !2, file: !2, line: 132, type: !842, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !845)
!842 = !DISubroutineType(types: !843)
!843 = !{!201, !233, !844, !201}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!845 = !{!846, !847, !848, !849, !850, !851, !852}
!846 = !DILocalVariable(name: "s", arg: 1, scope: !841, file: !2, line: 132, type: !233)
!847 = !DILocalVariable(name: "arr", arg: 2, scope: !841, file: !2, line: 132, type: !844)
!848 = !DILocalVariable(name: "n", arg: 3, scope: !841, file: !2, line: 132, type: !201)
!849 = !DILocalVariable(name: "line", scope: !841, file: !2, line: 132, type: !233)
!850 = !DILocalVariable(name: "endptr", scope: !841, file: !2, line: 132, type: !233)
!851 = !DILocalVariable(name: "i", scope: !841, file: !2, line: 132, type: !201)
!852 = !DILocalVariable(name: "v", scope: !841, file: !2, line: 132, type: !235)
!853 = distinct !DIAssignID()
!854 = !DILocation(line: 0, scope: !841)
!855 = !DILocation(line: 132, column: 1, scope: !841)
!856 = !DILocation(line: 132, column: 1, scope: !857)
!857 = distinct !DILexicalBlock(scope: !858, file: !2, line: 132, column: 1)
!858 = distinct !DILexicalBlock(scope: !841, file: !2, line: 132, column: 1)
!859 = !DILocation(line: 132, column: 1, scope: !860)
!860 = distinct !DILexicalBlock(scope: !841, file: !2, line: 132, column: 1)
!861 = !{!862, !862, i64 0}
!862 = !{!"any pointer", !376, i64 0}
!863 = distinct !DIAssignID()
!864 = !DILocation(line: 132, column: 1, scope: !865)
!865 = distinct !DILexicalBlock(scope: !860, file: !2, line: 132, column: 1)
!866 = !DILocation(line: 132, column: 1, scope: !867)
!867 = distinct !DILexicalBlock(scope: !865, file: !2, line: 132, column: 1)
!868 = distinct !{!868, !855, !855, !387, !388}
!869 = !DILocation(line: 132, column: 1, scope: !870)
!870 = distinct !DILexicalBlock(scope: !871, file: !2, line: 132, column: 1)
!871 = distinct !DILexicalBlock(scope: !841, file: !2, line: 132, column: 1)
!872 = !DISubprogram(name: "strtok", scope: !873, file: !873, line: 356, type: !874, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!873 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/string.h", directory: "")
!874 = !DISubroutineType(types: !875)
!875 = !{!233, !876, !877}
!876 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !233)
!877 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !763)
!878 = !DISubprogram(name: "strtol", scope: !556, file: !556, line: 177, type: !879, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!879 = !DISubroutineType(types: !880)
!880 = !{!256, !877, !881, !201}
!881 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!883 = !DISubprogram(name: "fprintf", scope: !884, file: !884, line: 357, type: !885, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!884 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdio.h", directory: "")
!885 = !DISubroutineType(types: !886)
!886 = !{!201, !887, !877, null}
!887 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !890, line: 7, baseType: !891)
!890 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/FILE.h", directory: "")
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !892, line: 49, size: 1728, elements: !893)
!892 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_FILE.h", directory: "")
!893 = !{!894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !909, !911, !912, !913, !914, !915, !916, !920, !923, !925, !928, !931, !932, !933, !935, !936}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !891, file: !892, line: 51, baseType: !201, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !891, file: !892, line: 54, baseType: !233, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !891, file: !892, line: 55, baseType: !233, size: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !891, file: !892, line: 56, baseType: !233, size: 64, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !891, file: !892, line: 57, baseType: !233, size: 64, offset: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !891, file: !892, line: 58, baseType: !233, size: 64, offset: 320)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !891, file: !892, line: 59, baseType: !233, size: 64, offset: 384)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !891, file: !892, line: 60, baseType: !233, size: 64, offset: 448)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !891, file: !892, line: 61, baseType: !233, size: 64, offset: 512)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !891, file: !892, line: 64, baseType: !233, size: 64, offset: 576)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !891, file: !892, line: 65, baseType: !233, size: 64, offset: 640)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !891, file: !892, line: 66, baseType: !233, size: 64, offset: 704)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !891, file: !892, line: 68, baseType: !907, size: 64, offset: 768)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !892, line: 36, flags: DIFlagFwdDecl)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !891, file: !892, line: 70, baseType: !910, size: 64, offset: 832)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !891, file: !892, line: 72, baseType: !201, size: 32, offset: 896)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !891, file: !892, line: 73, baseType: !201, size: 32, offset: 928)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !891, file: !892, line: 74, baseType: !702, size: 64, offset: 960)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !891, file: !892, line: 77, baseType: !241, size: 16, offset: 1024)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !891, file: !892, line: 78, baseType: !250, size: 8, offset: 1040)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !891, file: !892, line: 79, baseType: !917, size: 8, offset: 1048)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 1)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !891, file: !892, line: 81, baseType: !921, size: 64, offset: 1088)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !892, line: 43, baseType: null)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !891, file: !892, line: 89, baseType: !924, size: 64, offset: 1152)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !200, line: 153, baseType: !256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !891, file: !892, line: 91, baseType: !926, size: 64, offset: 1216)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !892, line: 37, flags: DIFlagFwdDecl)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !891, file: !892, line: 92, baseType: !929, size: 64, offset: 1280)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !892, line: 38, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !891, file: !892, line: 93, baseType: !910, size: 64, offset: 1344)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !891, file: !892, line: 94, baseType: !234, size: 64, offset: 1408)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_prevchain", scope: !891, file: !892, line: 95, baseType: !934, size: 64, offset: 1472)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !891, file: !892, line: 96, baseType: !201, size: 32, offset: 1536)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !891, file: !892, line: 98, baseType: !937, size: 160, offset: 1568)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !16)
!938 = !DISubprogram(name: "strlen", scope: !873, file: !873, line: 407, type: !939, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!939 = !DISubroutineType(types: !940)
!940 = !{!247, !763}
!941 = distinct !DISubprogram(name: "parse_uint16_t_array", scope: !2, file: !2, line: 133, type: !942, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !945)
!942 = !DISubroutineType(types: !943)
!943 = !{!201, !233, !944, !201}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!945 = !{!946, !947, !948, !949, !950, !951, !952}
!946 = !DILocalVariable(name: "s", arg: 1, scope: !941, file: !2, line: 133, type: !233)
!947 = !DILocalVariable(name: "arr", arg: 2, scope: !941, file: !2, line: 133, type: !944)
!948 = !DILocalVariable(name: "n", arg: 3, scope: !941, file: !2, line: 133, type: !201)
!949 = !DILocalVariable(name: "line", scope: !941, file: !2, line: 133, type: !233)
!950 = !DILocalVariable(name: "endptr", scope: !941, file: !2, line: 133, type: !233)
!951 = !DILocalVariable(name: "i", scope: !941, file: !2, line: 133, type: !201)
!952 = !DILocalVariable(name: "v", scope: !941, file: !2, line: 133, type: !239)
!953 = distinct !DIAssignID()
!954 = !DILocation(line: 0, scope: !941)
!955 = !DILocation(line: 133, column: 1, scope: !941)
!956 = !DILocation(line: 133, column: 1, scope: !957)
!957 = distinct !DILexicalBlock(scope: !958, file: !2, line: 133, column: 1)
!958 = distinct !DILexicalBlock(scope: !941, file: !2, line: 133, column: 1)
!959 = !DILocation(line: 133, column: 1, scope: !960)
!960 = distinct !DILexicalBlock(scope: !941, file: !2, line: 133, column: 1)
!961 = distinct !DIAssignID()
!962 = !DILocation(line: 133, column: 1, scope: !963)
!963 = distinct !DILexicalBlock(scope: !960, file: !2, line: 133, column: 1)
!964 = !DILocation(line: 133, column: 1, scope: !965)
!965 = distinct !DILexicalBlock(scope: !963, file: !2, line: 133, column: 1)
!966 = !{!967, !967, i64 0}
!967 = !{!"short", !376, i64 0}
!968 = distinct !{!968, !955, !955, !387, !388}
!969 = !DILocation(line: 133, column: 1, scope: !970)
!970 = distinct !DILexicalBlock(scope: !971, file: !2, line: 133, column: 1)
!971 = distinct !DILexicalBlock(scope: !941, file: !2, line: 133, column: 1)
!972 = distinct !DISubprogram(name: "parse_uint32_t_array", scope: !2, file: !2, line: 134, type: !973, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !976)
!973 = !DISubroutineType(types: !974)
!974 = !{!201, !233, !975, !201}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!976 = !{!977, !978, !979, !980, !981, !982, !983}
!977 = !DILocalVariable(name: "s", arg: 1, scope: !972, file: !2, line: 134, type: !233)
!978 = !DILocalVariable(name: "arr", arg: 2, scope: !972, file: !2, line: 134, type: !975)
!979 = !DILocalVariable(name: "n", arg: 3, scope: !972, file: !2, line: 134, type: !201)
!980 = !DILocalVariable(name: "line", scope: !972, file: !2, line: 134, type: !233)
!981 = !DILocalVariable(name: "endptr", scope: !972, file: !2, line: 134, type: !233)
!982 = !DILocalVariable(name: "i", scope: !972, file: !2, line: 134, type: !201)
!983 = !DILocalVariable(name: "v", scope: !972, file: !2, line: 134, type: !242)
!984 = distinct !DIAssignID()
!985 = !DILocation(line: 0, scope: !972)
!986 = !DILocation(line: 134, column: 1, scope: !972)
!987 = !DILocation(line: 134, column: 1, scope: !988)
!988 = distinct !DILexicalBlock(scope: !989, file: !2, line: 134, column: 1)
!989 = distinct !DILexicalBlock(scope: !972, file: !2, line: 134, column: 1)
!990 = !DILocation(line: 134, column: 1, scope: !991)
