; ModuleID = 'viterbi/viterbi/viterbi_opt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "riscv64-unknown-linux-gnu"

%struct.bench_args_t = type { [140 x i8], [64 x double], [4096 x double], [4096 x double], [140 x i8] }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str.1 = private unnamed_addr constant [34 x i8] c"fd>1 && \22Invalid file descriptor\22\00", align 1, !dbg !0
@.str.2 = private unnamed_addr constant [23 x i8] c"../../common/support.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.readfile = private unnamed_addr constant [20 x i8] c"char *readfile(int)\00", align 1, !dbg !12
@.str.4 = private unnamed_addr constant [51 x i8] c"0==fstat(fd, &s) && \22Couldn't determine file size\22\00", align 1, !dbg !18
@.str.6 = private unnamed_addr constant [25 x i8] c"len>0 && \22File is empty\22\00", align 1, !dbg !23
@.str.8 = private unnamed_addr constant [29 x i8] c"status>=0 && \22read() failed\22\00", align 1, !dbg !28
@.str.10 = private unnamed_addr constant [33 x i8] c"n>=0 && \22Invalid section number\22\00", align 1, !dbg !33
@__PRETTY_FUNCTION__.find_section_start = private unnamed_addr constant [38 x i8] c"char *find_section_start(char *, int)\00", align 1, !dbg !38

!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 182, type: !99, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !99, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !99, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !118, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 328, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 41)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 7)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !123, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 240, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 30)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 6)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 90)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !40, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !65)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !171, isLocal: true, isDefinition: true)
!170 = !DIFile(filename: "../../common/harness.c", directory: "/home/kelvin/MachSuite/viterbi/viterbi")
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 57)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !9, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 184, elements: !10)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !170, line: 22, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 11)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !170, line: 24, type: !181, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "INPUT_SIZE", scope: !188, file: !189, line: 4, type: !220, isLocal: false, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C11, file: !189, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !190, globals: !219, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "local_support.c", directory: "/home/kelvin/MachSuite/viterbi/viterbi")
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bench_args_t", file: !193, line: 30, size: 530688, elements: !194)
!193 = !DIFile(filename: "./viterbi.h", directory: "/home/kelvin/MachSuite/viterbi/viterbi")
!194 = !{!195, !205, !211, !215, !216}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !192, file: !193, line: 31, baseType: !196, size: 1120)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 1120, elements: !203)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "tok_t", file: !193, line: 13, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !199, line: 24, baseType: !200)
!199 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-uintn.h", directory: "")
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !201, line: 38, baseType: !202)
!201 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types.h", directory: "")
!202 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!203 = !{!204}
!204 = !DISubrange(count: 140)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !192, file: !193, line: 32, baseType: !206, size: 4096, offset: 1152)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 4096, elements: !209)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "prob_t", file: !193, line: 14, baseType: !208)
!208 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!209 = !{!210}
!210 = !DISubrange(count: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "transition", scope: !192, file: !193, line: 33, baseType: !212, size: 262144, offset: 5248)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 262144, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 4096)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !192, file: !193, line: 34, baseType: !212, size: 262144, offset: 267392)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !192, file: !193, line: 35, baseType: !217, size: 1120, offset: 529536)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 1120, elements: !203)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "state_t", file: !193, line: 15, baseType: !198)
!219 = !{!186}
!220 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !223, isLocal: true, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !151)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !124)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !170, line: 47, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 12)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !234, isLocal: true, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !100)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !170, line: 58, type: !30, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !74)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !170, line: 67, type: !35, isLocal: true, isDefinition: true)
!242 = distinct !DICompileUnit(language: DW_LANG_C11, file: !243, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!243 = !DIFile(filename: "viterbi.c", directory: "/home/kelvin/MachSuite/viterbi/viterbi")
!244 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !245, globals: !270, splitDebugInlining: false, nameTableKind: None)
!245 = !{!246, !4, !247, !198, !248, !251, !254, !257, !261, !264, !266, !269, !208}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !199, line: 25, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !201, line: 40, baseType: !250)
!250 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !199, line: 26, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !201, line: 42, baseType: !253)
!253 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !199, line: 27, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !201, line: 45, baseType: !256)
!256 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !258, line: 24, baseType: !259)
!258 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/stdint-intn.h", directory: "")
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !201, line: 37, baseType: !260)
!260 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !258, line: 25, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !201, line: 39, baseType: !263)
!263 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !258, line: 26, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !201, line: 41, baseType: !220)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !258, line: 27, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !201, line: 44, baseType: !268)
!268 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!269 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!270 = !{!271, !0, !7, !12, !276, !18, !278, !23, !283, !28, !285, !33, !38, !287, !43, !45, !47, !52, !57, !62, !67, !69, !71, !76, !78, !80, !82, !87, !89, !292, !92, !97, !102, !107, !112, !114, !116, !121, !126, !128, !130, !132, !134, !136, !141, !146, !148, !153, !297, !158, !163, !299, !165}
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 24)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !30, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 14)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !280, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !9, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 21)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !2, line: 154, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 13)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !2, line: 22, type: !20, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 27)
!304 = distinct !DICompileUnit(language: DW_LANG_C11, file: !170, producer: "clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !305, globals: !306, splitDebugInlining: false, nameTableKind: None)
!305 = !{!247}
!306 = !{!307, !168, !174, !176, !179, !184, !309, !221, !311, !224, !227, !313, !232, !235, !318, !237, !240, !320}
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !170, line: 21, type: !234, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !170, line: 37, type: !280, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !170, line: 39, type: !223, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !170, line: 48, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 31)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !170, line: 60, type: !223, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !170, line: 74, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 10)
!325 = !{!"clang version 18.1.8 (https://github.com/llvm/llvm-project.git 3b5b5c1ec4a3095ab096dd780e84d7ab81f3d7ff)"}
!326 = !{i32 7, !"Dwarf Version", i32 4}
!327 = !{i32 2, !"Debug Info Version", i32 3}
!328 = !{i32 1, !"wchar_size", i32 4}
!329 = !{i32 1, !"target-abi", !"lp64d"}
!330 = distinct !{i32 6, !"riscv-isa", !331}
!331 = distinct !{!"rv64i2p1_m2p0_a2p1_f2p2_d2p2_zicsr2p0_zifencei2p0"}
!332 = !{i32 8, !"PIC Level", i32 2}
!333 = !{i32 7, !"PIE Level", i32 2}
!334 = !{i32 7, !"uwtable", i32 2}
!335 = !{i32 8, !"SmallDataLimit", i32 8}
!336 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!337 = distinct !DISubprogram(name: "viterbi", scope: !243, file: !243, line: 3, type: !338, scopeLine: 4, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !242, retainedNodes: !343)
!338 = !DISubroutineType(types: !339)
!339 = !{!220, !340, !341, !341, !341, !342}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!343 = !{!344, !345, !346, !347, !348, !349, !352, !354, !355, !356, !357, !358, !359, !360, !361, !362, !366, !370, !371, !372}
!344 = !DILocalVariable(name: "obs", arg: 1, scope: !337, file: !243, line: 3, type: !340)
!345 = !DILocalVariable(name: "init", arg: 2, scope: !337, file: !243, line: 3, type: !341)
!346 = !DILocalVariable(name: "transition", arg: 3, scope: !337, file: !243, line: 3, type: !341)
!347 = !DILocalVariable(name: "emission", arg: 4, scope: !337, file: !243, line: 3, type: !341)
!348 = !DILocalVariable(name: "path", arg: 5, scope: !337, file: !243, line: 3, type: !342)
!349 = !DILocalVariable(name: "llike", scope: !337, file: !243, line: 5, type: !350)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 573440, elements: !351)
!351 = !{!204, !210}
!352 = !DILocalVariable(name: "t", scope: !337, file: !243, line: 6, type: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "step_t", file: !193, line: 16, baseType: !264)
!354 = !DILocalVariable(name: "prev", scope: !337, file: !243, line: 7, type: !218)
!355 = !DILocalVariable(name: "curr", scope: !337, file: !243, line: 7, type: !218)
!356 = !DILocalVariable(name: "min_p", scope: !337, file: !243, line: 8, type: !207)
!357 = !DILocalVariable(name: "p", scope: !337, file: !243, line: 8, type: !207)
!358 = !DILocalVariable(name: "min_s", scope: !337, file: !243, line: 9, type: !218)
!359 = !DILocalVariable(name: "s", scope: !337, file: !243, line: 9, type: !218)
!360 = !DILabel(scope: !337, name: "L_init", file: !243, line: 13)
!361 = !DILabel(scope: !337, name: "L_timestep", file: !243, line: 18)
!362 = !DILabel(scope: !363, name: "L_curr_state", file: !243, line: 19)
!363 = distinct !DILexicalBlock(scope: !364, file: !243, line: 18, column: 40)
!364 = distinct !DILexicalBlock(scope: !365, file: !243, line: 18, column: 15)
!365 = distinct !DILexicalBlock(scope: !337, file: !243, line: 18, column: 15)
!366 = !DILabel(scope: !367, name: "L_prev_state", file: !243, line: 25)
!367 = distinct !DILexicalBlock(scope: !368, file: !243, line: 19, column: 56)
!368 = distinct !DILexicalBlock(scope: !369, file: !243, line: 19, column: 19)
!369 = distinct !DILexicalBlock(scope: !363, file: !243, line: 19, column: 19)
!370 = !DILabel(scope: !337, name: "L_end", file: !243, line: 40)
!371 = !DILabel(scope: !337, name: "L_backtrack", file: !243, line: 50)
!372 = !DILabel(scope: !373, name: "L_state", file: !243, line: 53)
!373 = distinct !DILexicalBlock(scope: !374, file: !243, line: 50, column: 44)
!374 = distinct !DILexicalBlock(scope: !375, file: !243, line: 50, column: 16)
!375 = distinct !DILexicalBlock(scope: !337, file: !243, line: 50, column: 16)
!376 = distinct !DIAssignID()
!377 = !DILocation(line: 0, scope: !337)
!378 = !DILocation(line: 5, column: 3, scope: !337)
!379 = !DILocation(line: 13, column: 3, scope: !337)
!380 = !{!381, !381, i64 0}
!381 = !{!"omnipotent char", !382, i64 0}
!382 = !{!"Simple C/C++ TBAA"}
!383 = !DILocation(line: 13, column: 16, scope: !384)
!384 = distinct !DILexicalBlock(scope: !337, file: !243, line: 13, column: 11)
!385 = !DILocation(line: 13, column: 11, scope: !384)
!386 = !DILocation(line: 14, column: 19, scope: !387)
!387 = distinct !DILexicalBlock(scope: !388, file: !243, line: 13, column: 39)
!388 = distinct !DILexicalBlock(scope: !384, file: !243, line: 13, column: 11)
!389 = !{!390, !390, i64 0}
!390 = !{!"double", !381, i64 0}
!391 = !DILocation(line: 14, column: 29, scope: !387)
!392 = !DILocation(line: 14, column: 27, scope: !387)
!393 = !DILocation(line: 14, column: 5, scope: !387)
!394 = !DILocation(line: 14, column: 17, scope: !387)
!395 = !DILocation(line: 13, column: 34, scope: !388)
!396 = !DILocation(line: 13, column: 22, scope: !388)
!397 = distinct !{!397, !385, !398, !399, !400}
!398 = !DILocation(line: 15, column: 3, scope: !384)
!399 = !{!"llvm.loop.mustprogress"}
!400 = !{!"llvm.loop.unroll.disable"}
!401 = !DILocation(line: 18, column: 15, scope: !365)
!402 = !DILocation(line: 19, column: 19, scope: !369)
!403 = !DILocation(line: 22, column: 15, scope: !367)
!404 = !DILocation(line: 23, column: 15, scope: !367)
!405 = !DILocation(line: 22, column: 32, scope: !367)
!406 = !DILocation(line: 24, column: 15, scope: !367)
!407 = !DILocation(line: 23, column: 46, scope: !367)
!408 = !DILocation(line: 25, column: 7, scope: !367)
!409 = !DILocation(line: 25, column: 21, scope: !410)
!410 = distinct !DILexicalBlock(scope: !367, file: !243, line: 25, column: 21)
!411 = !DILocation(line: 26, column: 13, scope: !412)
!412 = distinct !DILexicalBlock(scope: !413, file: !243, line: 25, column: 58)
!413 = distinct !DILexicalBlock(scope: !410, file: !243, line: 25, column: 21)
!414 = !DILocation(line: 27, column: 13, scope: !412)
!415 = !DILocation(line: 26, column: 30, scope: !412)
!416 = !DILocation(line: 27, column: 44, scope: !412)
!417 = !DILocation(line: 29, column: 14, scope: !418)
!418 = distinct !DILexicalBlock(scope: !412, file: !243, line: 29, column: 13)
!419 = !DILocation(line: 29, column: 13, scope: !412)
!420 = !DILocation(line: 25, column: 53, scope: !413)
!421 = !DILocation(line: 25, column: 38, scope: !413)
!422 = distinct !{!422, !409, !423, !399, !400}
!423 = !DILocation(line: 32, column: 7, scope: !410)
!424 = !DILocation(line: 33, column: 7, scope: !367)
!425 = !DILocation(line: 33, column: 22, scope: !367)
!426 = !DILocation(line: 19, column: 51, scope: !368)
!427 = !DILocation(line: 19, column: 36, scope: !368)
!428 = distinct !{!428, !402, !429, !399, !400}
!429 = !DILocation(line: 34, column: 5, scope: !369)
!430 = !DILocation(line: 18, column: 35, scope: !364)
!431 = !DILocation(line: 18, column: 26, scope: !364)
!432 = distinct !{!432, !401, !433, !399, !400}
!433 = !DILocation(line: 35, column: 3, scope: !365)
!434 = !DILocation(line: 39, column: 11, scope: !337)
!435 = !DILocation(line: 40, column: 3, scope: !337)
!436 = !DILocation(line: 40, column: 10, scope: !437)
!437 = distinct !DILexicalBlock(scope: !337, file: !243, line: 40, column: 10)
!438 = !DILocation(line: 41, column: 9, scope: !439)
!439 = distinct !DILexicalBlock(scope: !440, file: !243, line: 40, column: 38)
!440 = distinct !DILexicalBlock(scope: !437, file: !243, line: 40, column: 10)
!441 = !DILocation(line: 42, column: 10, scope: !442)
!442 = distinct !DILexicalBlock(scope: !439, file: !243, line: 42, column: 9)
!443 = !DILocation(line: 42, column: 9, scope: !439)
!444 = !DILocation(line: 40, column: 33, scope: !440)
!445 = !DILocation(line: 40, column: 21, scope: !440)
!446 = distinct !{!446, !436, !447, !399, !400}
!447 = !DILocation(line: 46, column: 3, scope: !437)
!448 = !DILocation(line: 47, column: 3, scope: !337)
!449 = !DILocation(line: 47, column: 17, scope: !337)
!450 = !DILocation(line: 50, column: 3, scope: !337)
!451 = !DILocation(line: 50, column: 16, scope: !375)
!452 = !DILocation(line: 52, column: 13, scope: !373)
!453 = !DILocation(line: 52, column: 57, scope: !373)
!454 = !DILocation(line: 52, column: 31, scope: !373)
!455 = !DILocation(line: 52, column: 29, scope: !373)
!456 = !DILocation(line: 53, column: 5, scope: !373)
!457 = !DILocation(line: 53, column: 14, scope: !458)
!458 = distinct !DILexicalBlock(scope: !373, file: !243, line: 53, column: 14)
!459 = !DILocation(line: 54, column: 11, scope: !460)
!460 = distinct !DILexicalBlock(scope: !461, file: !243, line: 53, column: 42)
!461 = distinct !DILexicalBlock(scope: !458, file: !243, line: 53, column: 14)
!462 = !DILocation(line: 54, column: 25, scope: !460)
!463 = !DILocation(line: 54, column: 23, scope: !460)
!464 = !DILocation(line: 55, column: 12, scope: !465)
!465 = distinct !DILexicalBlock(scope: !460, file: !243, line: 55, column: 11)
!466 = !DILocation(line: 55, column: 11, scope: !460)
!467 = !DILocation(line: 53, column: 37, scope: !461)
!468 = !DILocation(line: 53, column: 25, scope: !461)
!469 = distinct !{!469, !457, !470, !399, !400}
!470 = !DILocation(line: 59, column: 5, scope: !458)
!471 = !DILocation(line: 60, column: 13, scope: !373)
!472 = !DILocation(line: 50, column: 39, scope: !374)
!473 = !DILocation(line: 50, column: 33, scope: !374)
!474 = distinct !{!474, !451, !475, !399, !400}
!475 = !DILocation(line: 61, column: 3, scope: !375)
!476 = !DILocation(line: 64, column: 1, scope: !337)
!477 = !DILocation(line: 63, column: 3, scope: !337)
!478 = !{!479}
!479 = distinct !{!479, !480, !"polly.alias.scope.MemRef0"}
!480 = distinct !{!480, !"polly.alias.scope.domain"}
!481 = !{!482, !483}
!482 = distinct !{!482, !480, !"polly.alias.scope.MemRef2"}
!483 = distinct !{!483, !480, !"polly.alias.scope.MemRef5"}
!484 = !{!482}
!485 = !{!479, !483}
!486 = !{!483}
!487 = !{!479, !482}
!488 = distinct !DISubprogram(name: "run_benchmark", scope: !189, file: !189, line: 6, type: !489, scopeLine: 6, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !491)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !247}
!491 = !{!492, !493}
!492 = !DILocalVariable(name: "vargs", arg: 1, scope: !488, file: !189, line: 6, type: !247)
!493 = !DILocalVariable(name: "args", scope: !488, file: !189, line: 7, type: !191)
!494 = !DILocation(line: 0, scope: !488)
!495 = !DILocation(line: 8, column: 29, scope: !488)
!496 = !DILocation(line: 8, column: 41, scope: !488)
!497 = !DILocation(line: 8, column: 59, scope: !488)
!498 = !DILocation(line: 8, column: 75, scope: !488)
!499 = !DILocation(line: 8, column: 3, scope: !488)
!500 = !DILocation(line: 9, column: 1, scope: !488)
!501 = distinct !DISubprogram(name: "input_to_data", scope: !189, file: !189, line: 22, type: !502, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !504)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !220, !247}
!504 = !{!505, !506, !507, !508, !509}
!505 = !DILocalVariable(name: "fd", arg: 1, scope: !501, file: !189, line: 22, type: !220)
!506 = !DILocalVariable(name: "vdata", arg: 2, scope: !501, file: !189, line: 22, type: !247)
!507 = !DILocalVariable(name: "data", scope: !501, file: !189, line: 23, type: !191)
!508 = !DILocalVariable(name: "p", scope: !501, file: !189, line: 24, type: !246)
!509 = !DILocalVariable(name: "s", scope: !501, file: !189, line: 24, type: !246)
!510 = !DILocation(line: 0, scope: !501)
!511 = !DILocation(line: 26, column: 3, scope: !501)
!512 = !DILocation(line: 28, column: 7, scope: !501)
!513 = !DILocalVariable(name: "s", arg: 1, scope: !514, file: !2, line: 56, type: !246)
!514 = distinct !DISubprogram(name: "find_section_start", scope: !2, file: !2, line: 56, type: !515, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !244, retainedNodes: !517)
!515 = !DISubroutineType(types: !516)
!516 = !{!246, !246, !220}
!517 = !{!513, !518, !519}
!518 = !DILocalVariable(name: "n", arg: 2, scope: !514, file: !2, line: 56, type: !220)
!519 = !DILocalVariable(name: "i", scope: !514, file: !2, line: 57, type: !220)
!520 = !DILocation(line: 0, scope: !514, inlinedAt: !521)
!521 = distinct !DILocation(line: 30, column: 7, scope: !501)
!522 = !DILocation(line: 64, column: 17, scope: !514, inlinedAt: !521)
!523 = !DILocation(line: 64, column: 3, scope: !514, inlinedAt: !521)
!524 = !DILocation(line: 66, column: 22, scope: !525, inlinedAt: !521)
!525 = distinct !DILexicalBlock(scope: !526, file: !2, line: 66, column: 9)
!526 = distinct !DILexicalBlock(scope: !514, file: !2, line: 64, column: 31)
!527 = !DILocation(line: 66, column: 26, scope: !525, inlinedAt: !521)
!528 = !DILocation(line: 66, column: 32, scope: !525, inlinedAt: !521)
!529 = !DILocation(line: 66, column: 35, scope: !525, inlinedAt: !521)
!530 = !DILocation(line: 66, column: 39, scope: !525, inlinedAt: !521)
!531 = !DILocation(line: 66, column: 9, scope: !526, inlinedAt: !521)
!532 = !DILocation(line: 69, column: 6, scope: !526, inlinedAt: !521)
!533 = !DILocation(line: 64, column: 10, scope: !514, inlinedAt: !521)
!534 = !DILocation(line: 64, column: 13, scope: !514, inlinedAt: !521)
!535 = distinct !{!535, !523, !536, !399, !400}
!536 = !DILocation(line: 70, column: 3, scope: !514, inlinedAt: !521)
!537 = !DILocation(line: 71, column: 6, scope: !538, inlinedAt: !521)
!538 = distinct !DILexicalBlock(scope: !514, file: !2, line: 71, column: 6)
!539 = !DILocation(line: 71, column: 8, scope: !538, inlinedAt: !521)
!540 = !DILocation(line: 71, column: 6, scope: !514, inlinedAt: !521)
!541 = !DILocation(line: 31, column: 3, scope: !501)
!542 = !DILocation(line: 0, scope: !514, inlinedAt: !543)
!543 = distinct !DILocation(line: 33, column: 7, scope: !501)
!544 = !DILocation(line: 64, column: 17, scope: !514, inlinedAt: !543)
!545 = !DILocation(line: 64, column: 3, scope: !514, inlinedAt: !543)
!546 = !DILocation(line: 66, column: 22, scope: !525, inlinedAt: !543)
!547 = !DILocation(line: 66, column: 26, scope: !525, inlinedAt: !543)
!548 = !DILocation(line: 66, column: 32, scope: !525, inlinedAt: !543)
!549 = !DILocation(line: 66, column: 35, scope: !525, inlinedAt: !543)
!550 = !DILocation(line: 66, column: 39, scope: !525, inlinedAt: !543)
!551 = !DILocation(line: 66, column: 9, scope: !526, inlinedAt: !543)
!552 = !DILocation(line: 69, column: 6, scope: !526, inlinedAt: !543)
!553 = !DILocation(line: 64, column: 10, scope: !514, inlinedAt: !543)
!554 = !DILocation(line: 64, column: 13, scope: !514, inlinedAt: !543)
!555 = distinct !{!555, !545, !556, !399, !400}
!556 = !DILocation(line: 70, column: 3, scope: !514, inlinedAt: !543)
!557 = !DILocation(line: 71, column: 6, scope: !538, inlinedAt: !543)
!558 = !DILocation(line: 71, column: 8, scope: !538, inlinedAt: !543)
!559 = !DILocation(line: 71, column: 6, scope: !514, inlinedAt: !543)
!560 = !DILocation(line: 34, column: 37, scope: !501)
!561 = !DILocation(line: 34, column: 3, scope: !501)
!562 = !DILocation(line: 0, scope: !514, inlinedAt: !563)
!563 = distinct !DILocation(line: 36, column: 7, scope: !501)
!564 = !DILocation(line: 64, column: 17, scope: !514, inlinedAt: !563)
!565 = !DILocation(line: 64, column: 3, scope: !514, inlinedAt: !563)
!566 = !DILocation(line: 66, column: 22, scope: !525, inlinedAt: !563)
!567 = !DILocation(line: 66, column: 26, scope: !525, inlinedAt: !563)
!568 = !DILocation(line: 66, column: 32, scope: !525, inlinedAt: !563)
!569 = !DILocation(line: 66, column: 35, scope: !525, inlinedAt: !563)
!570 = !DILocation(line: 66, column: 39, scope: !525, inlinedAt: !563)
!571 = !DILocation(line: 66, column: 9, scope: !526, inlinedAt: !563)
!572 = !DILocation(line: 69, column: 6, scope: !526, inlinedAt: !563)
!573 = !DILocation(line: 64, column: 10, scope: !514, inlinedAt: !563)
!574 = !DILocation(line: 64, column: 13, scope: !514, inlinedAt: !563)
!575 = distinct !{!575, !565, !576, !399, !400}
!576 = !DILocation(line: 70, column: 3, scope: !514, inlinedAt: !563)
!577 = !DILocation(line: 71, column: 6, scope: !538, inlinedAt: !563)
!578 = !DILocation(line: 71, column: 8, scope: !538, inlinedAt: !563)
!579 = !DILocation(line: 71, column: 6, scope: !514, inlinedAt: !563)
!580 = !DILocation(line: 37, column: 37, scope: !501)
!581 = !DILocation(line: 37, column: 3, scope: !501)
!582 = !DILocation(line: 0, scope: !514, inlinedAt: !583)
!583 = distinct !DILocation(line: 39, column: 7, scope: !501)
!584 = !DILocation(line: 64, column: 17, scope: !514, inlinedAt: !583)
!585 = !DILocation(line: 64, column: 3, scope: !514, inlinedAt: !583)
!586 = !DILocation(line: 66, column: 22, scope: !525, inlinedAt: !583)
!587 = !DILocation(line: 66, column: 26, scope: !525, inlinedAt: !583)
!588 = !DILocation(line: 66, column: 32, scope: !525, inlinedAt: !583)
!589 = !DILocation(line: 66, column: 35, scope: !525, inlinedAt: !583)
!590 = !DILocation(line: 66, column: 39, scope: !525, inlinedAt: !583)
!591 = !DILocation(line: 66, column: 9, scope: !526, inlinedAt: !583)
!592 = !DILocation(line: 69, column: 6, scope: !526, inlinedAt: !583)
!593 = !DILocation(line: 64, column: 10, scope: !514, inlinedAt: !583)
!594 = !DILocation(line: 64, column: 13, scope: !514, inlinedAt: !583)
!595 = distinct !{!595, !585, !596, !399, !400}
!596 = !DILocation(line: 70, column: 3, scope: !514, inlinedAt: !583)
!597 = !DILocation(line: 71, column: 6, scope: !538, inlinedAt: !583)
!598 = !DILocation(line: 71, column: 8, scope: !538, inlinedAt: !583)
!599 = !DILocation(line: 71, column: 6, scope: !514, inlinedAt: !583)
!600 = !DILocation(line: 40, column: 37, scope: !501)
!601 = !DILocation(line: 40, column: 3, scope: !501)
!602 = !DILocation(line: 41, column: 3, scope: !501)
!603 = !DILocation(line: 42, column: 1, scope: !501)
!604 = !DISubprogram(name: "free", scope: !605, file: !605, line: 687, type: !489, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!605 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdlib.h", directory: "")
!606 = distinct !DISubprogram(name: "data_to_input", scope: !189, file: !189, line: 44, type: !502, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !607)
!607 = !{!608, !609, !610}
!608 = !DILocalVariable(name: "fd", arg: 1, scope: !606, file: !189, line: 44, type: !220)
!609 = !DILocalVariable(name: "vdata", arg: 2, scope: !606, file: !189, line: 44, type: !247)
!610 = !DILocalVariable(name: "data", scope: !606, file: !189, line: 45, type: !191)
!611 = !DILocation(line: 0, scope: !606)
!612 = !DILocalVariable(name: "fd", arg: 1, scope: !613, file: !2, line: 189, type: !220)
!613 = distinct !DISubprogram(name: "write_section_header", scope: !2, file: !2, line: 189, type: !614, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !244, retainedNodes: !616)
!614 = !DISubroutineType(types: !615)
!615 = !{!220, !220}
!616 = !{!612}
!617 = !DILocation(line: 0, scope: !613, inlinedAt: !618)
!618 = distinct !DILocation(line: 47, column: 3, scope: !606)
!619 = !DILocation(line: 190, column: 3, scope: !620, inlinedAt: !618)
!620 = distinct !DILexicalBlock(scope: !621, file: !2, line: 190, column: 3)
!621 = distinct !DILexicalBlock(scope: !613, file: !2, line: 190, column: 3)
!622 = !DILocation(line: 191, column: 3, scope: !613, inlinedAt: !618)
!623 = !DILocalVariable(name: "fd", arg: 1, scope: !624, file: !2, line: 177, type: !220)
!624 = distinct !DISubprogram(name: "write_uint8_t_array", scope: !2, file: !2, line: 177, type: !625, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !244, retainedNodes: !628)
!625 = !DISubroutineType(types: !626)
!626 = !{!220, !220, !627, !220}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!628 = !{!623, !629, !630, !631}
!629 = !DILocalVariable(name: "arr", arg: 2, scope: !624, file: !2, line: 177, type: !627)
!630 = !DILocalVariable(name: "n", arg: 3, scope: !624, file: !2, line: 177, type: !220)
!631 = !DILocalVariable(name: "i", scope: !624, file: !2, line: 177, type: !220)
!632 = !DILocation(line: 0, scope: !624, inlinedAt: !633)
!633 = distinct !DILocation(line: 48, column: 3, scope: !606)
!634 = !DILocation(line: 177, column: 1, scope: !635, inlinedAt: !633)
!635 = distinct !DILexicalBlock(scope: !624, file: !2, line: 177, column: 1)
!636 = !DILocation(line: 177, column: 1, scope: !637, inlinedAt: !633)
!637 = distinct !DILexicalBlock(scope: !638, file: !2, line: 177, column: 1)
!638 = distinct !DILexicalBlock(scope: !635, file: !2, line: 177, column: 1)
!639 = !DILocation(line: 177, column: 1, scope: !638, inlinedAt: !633)
!640 = distinct !{!640, !634, !634, !399, !400}
!641 = !DILocation(line: 0, scope: !613, inlinedAt: !642)
!642 = distinct !DILocation(line: 50, column: 3, scope: !606)
!643 = !DILocation(line: 191, column: 3, scope: !613, inlinedAt: !642)
!644 = !DILocation(line: 51, column: 38, scope: !606)
!645 = !DILocalVariable(name: "fd", arg: 1, scope: !646, file: !2, line: 187, type: !220)
!646 = distinct !DISubprogram(name: "write_double_array", scope: !2, file: !2, line: 187, type: !647, scopeLine: 187, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !244, retainedNodes: !650)
!647 = !DISubroutineType(types: !648)
!648 = !{!220, !220, !649, !220}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!650 = !{!645, !651, !652, !653}
!651 = !DILocalVariable(name: "arr", arg: 2, scope: !646, file: !2, line: 187, type: !649)
!652 = !DILocalVariable(name: "n", arg: 3, scope: !646, file: !2, line: 187, type: !220)
!653 = !DILocalVariable(name: "i", scope: !646, file: !2, line: 187, type: !220)
!654 = !DILocation(line: 0, scope: !646, inlinedAt: !655)
!655 = distinct !DILocation(line: 51, column: 3, scope: !606)
!656 = !DILocation(line: 187, column: 1, scope: !657, inlinedAt: !655)
!657 = distinct !DILexicalBlock(scope: !646, file: !2, line: 187, column: 1)
!658 = !DILocation(line: 187, column: 1, scope: !659, inlinedAt: !655)
!659 = distinct !DILexicalBlock(scope: !660, file: !2, line: 187, column: 1)
!660 = distinct !DILexicalBlock(scope: !657, file: !2, line: 187, column: 1)
!661 = !DILocation(line: 187, column: 1, scope: !660, inlinedAt: !655)
!662 = distinct !{!662, !656, !656, !399, !400}
!663 = !DILocation(line: 0, scope: !613, inlinedAt: !664)
!664 = distinct !DILocation(line: 53, column: 3, scope: !606)
!665 = !DILocation(line: 191, column: 3, scope: !613, inlinedAt: !664)
!666 = !DILocation(line: 54, column: 38, scope: !606)
!667 = !DILocation(line: 0, scope: !646, inlinedAt: !668)
!668 = distinct !DILocation(line: 54, column: 3, scope: !606)
!669 = !DILocation(line: 187, column: 1, scope: !657, inlinedAt: !668)
!670 = !DILocation(line: 187, column: 1, scope: !659, inlinedAt: !668)
!671 = !DILocation(line: 187, column: 1, scope: !660, inlinedAt: !668)
!672 = distinct !{!672, !669, !669, !399, !400}
!673 = !DILocation(line: 0, scope: !613, inlinedAt: !674)
!674 = distinct !DILocation(line: 56, column: 3, scope: !606)
!675 = !DILocation(line: 191, column: 3, scope: !613, inlinedAt: !674)
!676 = !DILocation(line: 57, column: 38, scope: !606)
!677 = !DILocation(line: 0, scope: !646, inlinedAt: !678)
!678 = distinct !DILocation(line: 57, column: 3, scope: !606)
!679 = !DILocation(line: 187, column: 1, scope: !657, inlinedAt: !678)
!680 = !DILocation(line: 187, column: 1, scope: !659, inlinedAt: !678)
!681 = !DILocation(line: 187, column: 1, scope: !660, inlinedAt: !678)
!682 = distinct !{!682, !679, !679, !399, !400}
!683 = !DILocation(line: 58, column: 1, scope: !606)
!684 = distinct !DISubprogram(name: "output_to_data", scope: !189, file: !189, line: 65, type: !502, scopeLine: 65, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !685)
!685 = !{!686, !687, !688, !689, !690}
!686 = !DILocalVariable(name: "fd", arg: 1, scope: !684, file: !189, line: 65, type: !220)
!687 = !DILocalVariable(name: "vdata", arg: 2, scope: !684, file: !189, line: 65, type: !247)
!688 = !DILocalVariable(name: "data", scope: !684, file: !189, line: 66, type: !191)
!689 = !DILocalVariable(name: "p", scope: !684, file: !189, line: 67, type: !246)
!690 = !DILocalVariable(name: "s", scope: !684, file: !189, line: 67, type: !246)
!691 = !DILocation(line: 0, scope: !684)
!692 = !DILocation(line: 69, column: 3, scope: !684)
!693 = !DILocation(line: 71, column: 7, scope: !684)
!694 = !DILocation(line: 0, scope: !514, inlinedAt: !695)
!695 = distinct !DILocation(line: 73, column: 7, scope: !684)
!696 = !DILocation(line: 64, column: 17, scope: !514, inlinedAt: !695)
!697 = !DILocation(line: 64, column: 3, scope: !514, inlinedAt: !695)
!698 = !DILocation(line: 66, column: 22, scope: !525, inlinedAt: !695)
!699 = !DILocation(line: 66, column: 26, scope: !525, inlinedAt: !695)
!700 = !DILocation(line: 66, column: 32, scope: !525, inlinedAt: !695)
!701 = !DILocation(line: 66, column: 35, scope: !525, inlinedAt: !695)
!702 = !DILocation(line: 66, column: 39, scope: !525, inlinedAt: !695)
!703 = !DILocation(line: 66, column: 9, scope: !526, inlinedAt: !695)
!704 = !DILocation(line: 69, column: 6, scope: !526, inlinedAt: !695)
!705 = !DILocation(line: 64, column: 10, scope: !514, inlinedAt: !695)
!706 = !DILocation(line: 64, column: 13, scope: !514, inlinedAt: !695)
!707 = distinct !{!707, !697, !708, !399, !400}
!708 = !DILocation(line: 70, column: 3, scope: !514, inlinedAt: !695)
!709 = !DILocation(line: 71, column: 6, scope: !538, inlinedAt: !695)
!710 = !DILocation(line: 71, column: 8, scope: !538, inlinedAt: !695)
!711 = !DILocation(line: 71, column: 6, scope: !514, inlinedAt: !695)
!712 = !DILocation(line: 74, column: 32, scope: !684)
!713 = !DILocation(line: 74, column: 3, scope: !684)
!714 = !DILocation(line: 75, column: 3, scope: !684)
!715 = !DILocation(line: 76, column: 1, scope: !684)
!716 = distinct !DISubprogram(name: "data_to_output", scope: !189, file: !189, line: 78, type: !502, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !717)
!717 = !{!718, !719, !720}
!718 = !DILocalVariable(name: "fd", arg: 1, scope: !716, file: !189, line: 78, type: !220)
!719 = !DILocalVariable(name: "vdata", arg: 2, scope: !716, file: !189, line: 78, type: !247)
!720 = !DILocalVariable(name: "data", scope: !716, file: !189, line: 79, type: !191)
!721 = !DILocation(line: 0, scope: !716)
!722 = !DILocation(line: 0, scope: !613, inlinedAt: !723)
!723 = distinct !DILocation(line: 81, column: 3, scope: !716)
!724 = !DILocation(line: 190, column: 3, scope: !620, inlinedAt: !723)
!725 = !DILocation(line: 191, column: 3, scope: !613, inlinedAt: !723)
!726 = !DILocation(line: 82, column: 33, scope: !716)
!727 = !DILocation(line: 0, scope: !624, inlinedAt: !728)
!728 = distinct !DILocation(line: 82, column: 3, scope: !716)
!729 = !DILocation(line: 177, column: 1, scope: !635, inlinedAt: !728)
!730 = !DILocation(line: 177, column: 1, scope: !637, inlinedAt: !728)
!731 = !DILocation(line: 177, column: 1, scope: !638, inlinedAt: !728)
!732 = distinct !{!732, !729, !729, !399, !400}
!733 = !DILocation(line: 83, column: 1, scope: !716)
!734 = distinct !DISubprogram(name: "check_data", scope: !189, file: !189, line: 85, type: !735, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !737)
!735 = !DISubroutineType(types: !736)
!736 = !{!220, !247, !247}
!737 = !{!738, !739, !740, !741, !742, !743}
!738 = !DILocalVariable(name: "vdata", arg: 1, scope: !734, file: !189, line: 85, type: !247)
!739 = !DILocalVariable(name: "vref", arg: 2, scope: !734, file: !189, line: 85, type: !247)
!740 = !DILocalVariable(name: "data", scope: !734, file: !189, line: 86, type: !191)
!741 = !DILocalVariable(name: "ref", scope: !734, file: !189, line: 87, type: !191)
!742 = !DILocalVariable(name: "has_errors", scope: !734, file: !189, line: 88, type: !220)
!743 = !DILocalVariable(name: "i", scope: !734, file: !189, line: 89, type: !220)
!744 = !DILocation(line: 0, scope: !734)
!745 = !DILocation(line: 91, column: 3, scope: !746)
!746 = distinct !DILexicalBlock(scope: !734, file: !189, line: 91, column: 3)
!747 = !DILocation(line: 92, column: 20, scope: !748)
!748 = distinct !DILexicalBlock(scope: !749, file: !189, line: 91, column: 26)
!749 = distinct !DILexicalBlock(scope: !746, file: !189, line: 91, column: 3)
!750 = !DILocation(line: 92, column: 35, scope: !748)
!751 = !DILocation(line: 92, column: 33, scope: !748)
!752 = !DILocation(line: 92, column: 16, scope: !748)
!753 = !DILocation(line: 91, column: 22, scope: !749)
!754 = !DILocation(line: 91, column: 13, scope: !749)
!755 = distinct !{!755, !745, !756, !399, !400}
!756 = !DILocation(line: 93, column: 3, scope: !746)
!757 = !DILocation(line: 96, column: 10, scope: !734)
!758 = !DILocation(line: 96, column: 3, scope: !734)
!759 = distinct !DISubprogram(name: "readfile", scope: !2, file: !2, line: 34, type: !760, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !244, retainedNodes: !762)
!760 = !DISubroutineType(types: !761)
!761 = !{!246, !220}
!762 = !{!763, !764, !765, !802, !805, !808}
!763 = !DILocalVariable(name: "fd", arg: 1, scope: !759, file: !2, line: 34, type: !220)
!764 = !DILocalVariable(name: "p", scope: !759, file: !2, line: 35, type: !246)
!765 = !DILocalVariable(name: "s", scope: !759, file: !2, line: 36, type: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !767, line: 44, size: 1024, elements: !768)
!767 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/struct_stat.h", directory: "")
!768 = !{!769, !771, !773, !775, !777, !779, !781, !782, !783, !785, !787, !788, !790, !798, !799, !800}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !766, file: !767, line: 46, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !201, line: 145, baseType: !256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !766, file: !767, line: 47, baseType: !772, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !201, line: 148, baseType: !256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !766, file: !767, line: 48, baseType: !774, size: 32, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !201, line: 150, baseType: !253)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !766, file: !767, line: 49, baseType: !776, size: 32, offset: 160)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !201, line: 151, baseType: !253)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !766, file: !767, line: 50, baseType: !778, size: 32, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !201, line: 146, baseType: !253)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !766, file: !767, line: 51, baseType: !780, size: 32, offset: 224)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !201, line: 147, baseType: !253)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !766, file: !767, line: 52, baseType: !770, size: 64, offset: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !766, file: !767, line: 53, baseType: !770, size: 64, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !766, file: !767, line: 54, baseType: !784, size: 64, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !201, line: 152, baseType: !268)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !766, file: !767, line: 55, baseType: !786, size: 32, offset: 448)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !201, line: 175, baseType: !220)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !766, file: !767, line: 56, baseType: !220, size: 32, offset: 480)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !766, file: !767, line: 57, baseType: !789, size: 64, offset: 512)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !201, line: 180, baseType: !268)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !766, file: !767, line: 65, baseType: !791, size: 128, offset: 576)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !792, line: 11, size: 128, elements: !793)
!792 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_timespec.h", directory: "")
!793 = !{!794, !796}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !791, file: !792, line: 16, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !201, line: 160, baseType: !268)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !791, file: !792, line: 21, baseType: !797, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !201, line: 197, baseType: !268)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !766, file: !767, line: 66, baseType: !791, size: 128, offset: 704)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !766, file: !767, line: 67, baseType: !791, size: 128, offset: 832)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !766, file: !767, line: 79, baseType: !801, size: 64, offset: 960)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 64, elements: !55)
!802 = !DILocalVariable(name: "len", scope: !759, file: !2, line: 37, type: !803)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !804, line: 85, baseType: !784)
!804 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/types.h", directory: "")
!805 = !DILocalVariable(name: "bytes_read", scope: !759, file: !2, line: 38, type: !806)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !804, line: 108, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !201, line: 194, baseType: !268)
!808 = !DILocalVariable(name: "status", scope: !759, file: !2, line: 38, type: !806)
!809 = distinct !DIAssignID()
!810 = !DILocation(line: 0, scope: !759)
!811 = !DILocation(line: 36, column: 3, scope: !759)
!812 = !DILocation(line: 40, column: 3, scope: !813)
!813 = distinct !DILexicalBlock(scope: !814, file: !2, line: 40, column: 3)
!814 = distinct !DILexicalBlock(scope: !759, file: !2, line: 40, column: 3)
!815 = !DILocation(line: 41, column: 3, scope: !816)
!816 = distinct !DILexicalBlock(scope: !817, file: !2, line: 41, column: 3)
!817 = distinct !DILexicalBlock(scope: !759, file: !2, line: 41, column: 3)
!818 = !DILocation(line: 42, column: 11, scope: !759)
!819 = !DILocation(line: 43, column: 3, scope: !820)
!820 = distinct !DILexicalBlock(scope: !821, file: !2, line: 43, column: 3)
!821 = distinct !DILexicalBlock(scope: !759, file: !2, line: 43, column: 3)
!822 = !DILocation(line: 44, column: 25, scope: !759)
!823 = !DILocation(line: 44, column: 15, scope: !759)
!824 = !DILocation(line: 46, column: 3, scope: !759)
!825 = !DILocation(line: 49, column: 15, scope: !826)
!826 = distinct !DILexicalBlock(scope: !759, file: !2, line: 46, column: 27)
!827 = !DILocation(line: 46, column: 20, scope: !759)
!828 = distinct !{!828, !824, !829, !399, !400}
!829 = !DILocation(line: 50, column: 3, scope: !759)
!830 = !DILocation(line: 47, column: 24, scope: !826)
!831 = !DILocation(line: 47, column: 42, scope: !826)
!832 = !DILocation(line: 47, column: 14, scope: !826)
!833 = !DILocation(line: 48, column: 5, scope: !834)
!834 = distinct !DILexicalBlock(scope: !835, file: !2, line: 48, column: 5)
!835 = distinct !DILexicalBlock(scope: !826, file: !2, line: 48, column: 5)
!836 = !DILocation(line: 51, column: 3, scope: !759)
!837 = !DILocation(line: 51, column: 10, scope: !759)
!838 = !DILocation(line: 52, column: 3, scope: !759)
!839 = !DILocation(line: 54, column: 1, scope: !759)
!840 = !DILocation(line: 53, column: 3, scope: !759)
!841 = !DISubprogram(name: "__assert_fail", scope: !842, file: !842, line: 67, type: !843, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!842 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/assert.h", directory: "")
!843 = !DISubroutineType(types: !844)
!844 = !{null, !845, !845, !253, !845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!846 = !DISubprogram(name: "fstat", scope: !847, file: !847, line: 210, type: !848, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!847 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/sys/stat.h", directory: "")
!848 = !DISubroutineType(types: !849)
!849 = !{!220, !220, !850}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!851 = !DISubprogram(name: "malloc", scope: !605, file: !605, line: 672, type: !852, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!852 = !DISubroutineType(types: !853)
!853 = !{!247, !854}
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !855, line: 18, baseType: !256)
!855 = !DIFile(filename: "/opt/riscv/lib/clang/18/include/__stddef_size_t.h", directory: "")
!856 = !DISubprogram(name: "read", scope: !857, file: !857, line: 371, type: !858, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!857 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/unistd.h", directory: "")
!858 = !DISubroutineType(types: !859)
!859 = !{!806, !220, !247, !854}
!860 = !DISubprogram(name: "close", scope: !857, file: !857, line: 358, type: !614, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!861 = !DILocation(line: 0, scope: !514)
!862 = !DILocation(line: 59, column: 3, scope: !863)
!863 = distinct !DILexicalBlock(scope: !864, file: !2, line: 59, column: 3)
!864 = distinct !DILexicalBlock(scope: !514, file: !2, line: 59, column: 3)
!865 = !DILocation(line: 60, column: 7, scope: !866)
!866 = distinct !DILexicalBlock(scope: !514, file: !2, line: 60, column: 6)
!867 = !DILocation(line: 60, column: 6, scope: !514)
!868 = !DILocation(line: 64, column: 17, scope: !514)
!869 = !DILocation(line: 64, column: 3, scope: !514)
!870 = !DILocation(line: 66, column: 22, scope: !525)
!871 = !DILocation(line: 66, column: 26, scope: !525)
!872 = !DILocation(line: 66, column: 32, scope: !525)
!873 = !DILocation(line: 66, column: 35, scope: !525)
!874 = !DILocation(line: 66, column: 39, scope: !525)
!875 = !DILocation(line: 66, column: 9, scope: !526)
!876 = !DILocation(line: 69, column: 6, scope: !526)
!877 = !DILocation(line: 64, column: 10, scope: !514)
!878 = !DILocation(line: 64, column: 13, scope: !514)
!879 = distinct !{!879, !869, !880, !399, !400}
!880 = !DILocation(line: 70, column: 3, scope: !514)
!881 = !DILocation(line: 71, column: 6, scope: !538)
!882 = !DILocation(line: 71, column: 8, scope: !538)
!883 = !DILocation(line: 71, column: 6, scope: !514)
!884 = !DILocation(line: 74, column: 1, scope: !514)
!885 = distinct !DISubprogram(name: "parse_string", scope: !2, file: !2, line: 77, type: !886, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !244, retainedNodes: !888)
!886 = !DISubroutineType(types: !887)
!887 = !{!220, !246, !246, !220}
!888 = !{!889, !890, !891, !892}
!889 = !DILocalVariable(name: "s", arg: 1, scope: !885, file: !2, line: 77, type: !246)
!890 = !DILocalVariable(name: "arr", arg: 2, scope: !885, file: !2, line: 77, type: !246)
!891 = !DILocalVariable(name: "n", arg: 3, scope: !885, file: !2, line: 77, type: !220)
!892 = !DILocalVariable(name: "k", scope: !885, file: !2, line: 78, type: !220)
!893 = !DILocation(line: 0, scope: !885)
!894 = !DILocation(line: 79, column: 3, scope: !895)
!895 = distinct !DILexicalBlock(scope: !896, file: !2, line: 79, column: 3)
!896 = distinct !DILexicalBlock(scope: !885, file: !2, line: 79, column: 3)
!897 = !DILocation(line: 81, column: 8, scope: !898)
!898 = distinct !DILexicalBlock(scope: !885, file: !2, line: 81, column: 7)
!899 = !DILocation(line: 81, column: 7, scope: !885)
!900 = !DILocation(line: 83, column: 12, scope: !901)
!901 = distinct !DILexicalBlock(scope: !898, file: !2, line: 81, column: 13)
!902 = !DILocation(line: 83, column: 5, scope: !901)
!903 = !DILocation(line: 91, column: 19, scope: !885)
!904 = !DILocation(line: 91, column: 3, scope: !885)
!905 = !DILocation(line: 92, column: 7, scope: !885)
!906 = !DILocation(line: 83, column: 16, scope: !901)
!907 = !DILocation(line: 83, column: 26, scope: !901)
!908 = !DILocation(line: 83, column: 32, scope: !901)
!909 = !DILocation(line: 83, column: 29, scope: !901)
!910 = !DILocation(line: 83, column: 35, scope: !901)
!911 = !DILocation(line: 83, column: 45, scope: !901)
!912 = !DILocation(line: 83, column: 48, scope: !901)
!913 = !DILocation(line: 83, column: 54, scope: !901)
!914 = !DILocation(line: 84, column: 9, scope: !901)
!915 = !DILocation(line: 84, column: 18, scope: !901)
!916 = !DILocation(line: 84, column: 26, scope: !901)
!917 = distinct !{!917, !902, !918, !399, !400}
!918 = !DILocation(line: 86, column: 5, scope: !901)
!919 = !DILocation(line: 93, column: 5, scope: !920)
!920 = distinct !DILexicalBlock(scope: !885, file: !2, line: 92, column: 7)
!921 = !DILocation(line: 93, column: 12, scope: !920)
!922 = !DILocation(line: 95, column: 3, scope: !885)
!923 = distinct !DISubprogram(name: "parse_uint8_t_array", scope: !2, file: !2, line: 132, type: !924, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !244, retainedNodes: !926)
!924 = !DISubroutineType(types: !925)
!925 = !{!220, !246, !627, !220}
!926 = !{!927, !928, !929, !930, !931, !932, !933}
!927 = !DILocalVariable(name: "s", arg: 1, scope: !923, file: !2, line: 132, type: !246)
!928 = !DILocalVariable(name: "arr", arg: 2, scope: !923, file: !2, line: 132, type: !627)
!929 = !DILocalVariable(name: "n", arg: 3, scope: !923, file: !2, line: 132, type: !220)
!930 = !DILocalVariable(name: "line", scope: !923, file: !2, line: 132, type: !246)
!931 = !DILocalVariable(name: "endptr", scope: !923, file: !2, line: 132, type: !246)
!932 = !DILocalVariable(name: "i", scope: !923, file: !2, line: 132, type: !220)
!933 = !DILocalVariable(name: "v", scope: !923, file: !2, line: 132, type: !198)
!934 = distinct !DIAssignID()
!935 = !DILocation(line: 0, scope: !923)
!936 = !DILocation(line: 132, column: 1, scope: !923)
!937 = !DILocation(line: 132, column: 1, scope: !938)
!938 = distinct !DILexicalBlock(scope: !939, file: !2, line: 132, column: 1)
!939 = distinct !DILexicalBlock(scope: !923, file: !2, line: 132, column: 1)
!940 = !DILocation(line: 132, column: 1, scope: !941)
!941 = distinct !DILexicalBlock(scope: !923, file: !2, line: 132, column: 1)
!942 = !{!943, !943, i64 0}
!943 = !{!"any pointer", !381, i64 0}
!944 = distinct !DIAssignID()
!945 = !DILocation(line: 132, column: 1, scope: !946)
!946 = distinct !DILexicalBlock(scope: !941, file: !2, line: 132, column: 1)
!947 = !DILocation(line: 132, column: 1, scope: !948)
!948 = distinct !DILexicalBlock(scope: !946, file: !2, line: 132, column: 1)
!949 = distinct !{!949, !936, !936, !399, !400}
!950 = !DILocation(line: 132, column: 1, scope: !951)
!951 = distinct !DILexicalBlock(scope: !952, file: !2, line: 132, column: 1)
!952 = distinct !DILexicalBlock(scope: !923, file: !2, line: 132, column: 1)
!953 = !DISubprogram(name: "strtok", scope: !954, file: !954, line: 356, type: !955, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!954 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/string.h", directory: "")
!955 = !DISubroutineType(types: !956)
!956 = !{!246, !957, !958}
!957 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !246)
!958 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !845)
!959 = !DISubprogram(name: "strtol", scope: !605, file: !605, line: 177, type: !960, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!960 = !DISubroutineType(types: !961)
!961 = !{!268, !958, !962, !220}
!962 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!964 = !DISubprogram(name: "fprintf", scope: !965, file: !965, line: 357, type: !966, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!965 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/stdio.h", directory: "")
!966 = !DISubroutineType(types: !967)
!967 = !{!220, !968, !958, null}
!968 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !971, line: 7, baseType: !972)
!971 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/FILE.h", directory: "")
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !973, line: 49, size: 1728, elements: !974)
!973 = !DIFile(filename: "/opt/riscv/sysroot/usr/include/bits/types/struct_FILE.h", directory: "")
!974 = !{!975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !990, !992, !993, !994, !995, !996, !997, !1001, !1004, !1006, !1009, !1012, !1013, !1014, !1016, !1017}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !972, file: !973, line: 51, baseType: !220, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !972, file: !973, line: 54, baseType: !246, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !972, file: !973, line: 55, baseType: !246, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !972, file: !973, line: 56, baseType: !246, size: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !972, file: !973, line: 57, baseType: !246, size: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !972, file: !973, line: 58, baseType: !246, size: 64, offset: 320)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !972, file: !973, line: 59, baseType: !246, size: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !972, file: !973, line: 60, baseType: !246, size: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !972, file: !973, line: 61, baseType: !246, size: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !972, file: !973, line: 64, baseType: !246, size: 64, offset: 576)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !972, file: !973, line: 65, baseType: !246, size: 64, offset: 640)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !972, file: !973, line: 66, baseType: !246, size: 64, offset: 704)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !972, file: !973, line: 68, baseType: !988, size: 64, offset: 768)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !973, line: 36, flags: DIFlagFwdDecl)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !972, file: !973, line: 70, baseType: !991, size: 64, offset: 832)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !972, file: !973, line: 72, baseType: !220, size: 32, offset: 896)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !972, file: !973, line: 73, baseType: !220, size: 32, offset: 928)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !972, file: !973, line: 74, baseType: !784, size: 64, offset: 960)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !972, file: !973, line: 77, baseType: !250, size: 16, offset: 1024)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !972, file: !973, line: 78, baseType: !260, size: 8, offset: 1040)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !972, file: !973, line: 79, baseType: !998, size: 8, offset: 1048)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !999)
!999 = !{!1000}
!1000 = !DISubrange(count: 1)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !972, file: !973, line: 81, baseType: !1002, size: 64, offset: 1088)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !973, line: 43, baseType: null)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !972, file: !973, line: 89, baseType: !1005, size: 64, offset: 1152)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !201, line: 153, baseType: !268)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !972, file: !973, line: 91, baseType: !1007, size: 64, offset: 1216)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !973, line: 37, flags: DIFlagFwdDecl)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !972, file: !973, line: 92, baseType: !1010, size: 64, offset: 1280)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !973, line: 38, flags: DIFlagFwdDecl)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !972, file: !973, line: 93, baseType: !991, size: 64, offset: 1344)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !972, file: !973, line: 94, baseType: !247, size: 64, offset: 1408)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_prevchain", scope: !972, file: !973, line: 95, baseType: !1015, size: 64, offset: 1472)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !972, file: !973, line: 96, baseType: !220, size: 32, offset: 1536)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !972, file: !973, line: 98, baseType: !1018, size: 160, offset: 1568)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !16)
!1019 = !DISubprogram(name: "strlen", scope: !954, file: !954, line: 407, type: !1020, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!256, !845}
!1022 = distinct !DISubprogram(name: "parse_uint16_t_array", scope: !2, file: !2, line: 133, type: !1023, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !244, retainedNodes: !1026)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!220, !246, !1025, !220}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1032, !1033}
!1027 = !DILocalVariable(name: "s", arg: 1, scope: !1022, file: !2, line: 133, type: !246)
!1028 = !DILocalVariable(name: "arr", arg: 2, scope: !1022, file: !2, line: 133, type: !1025)
!1029 = !DILocalVariable(name: "n", arg: 3, scope: !1022, file: !2, line: 133, type: !220)
!1030 = !DILocalVariable(name: "line", scope: !1022, file: !2, line: 133, type: !246)
!1031 = !DILocalVariable(name: "endptr", scope: !1022, file: !2, line: 133, type: !246)
!1032 = !DILocalVariable(name: "i", scope: !1022, file: !2, line: 133, type: !220)
!1033 = !DILocalVariable(name: "v", scope: !1022, file: !2, line: 133, type: !248)
!1034 = distinct !DIAssignID()
!1035 = !DILocation(line: 0, scope: !1022)
!1036 = !DILocation(line: 133, column: 1, scope: !1022)
!1037 = !DILocation(line: 133, column: 1, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !2, line: 133, column: 1)
!1039 = distinct !DILexicalBlock(scope: !1022, file: !2, line: 133, column: 1)
!1040 = !DILocation(line: 133, column: 1, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1022, file: !2, line: 133, column: 1)
!1042 = distinct !DIAssignID()
!1043 = !DILocation(line: 133, column: 1, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1041, file: !2, line: 133, column: 1)
!1045 = !DILocation(line: 133, column: 1, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1044, file: !2, line: 133, column: 1)
!1047 = !{!1048, !1048, i64 0}
!1048 = !{!"short", !381, i64 0}
!1049 = distinct !{!1049, !1036, !1036, !399, !400}
!1050 = !DILocation(line: 133, column: 1, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !2, line: 133, column: 1)
!1052 = distinct !DILexicalBlock(scope: !1022, file: !2, line: 133, column: 1)
!1053 = distinct !DISubprogram(name: "parse_uint32_t_array", scope: !2, file: !2, line: 134, type: !1054, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !244, retainedNodes: !1057)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!220, !246, !1056, !220}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!1057 = !{!1058, !1059, !1060, !1061, !1062, !1063, !1064}
!1058 = !DILocalVariable(name: "s", arg: 1, scope: !1053, file: !2, line: 134, type: !246)
!1059 = !DILocalVariable(name: "arr", arg: 2, scope: !1053, file: !2, line: 134, type: !1056)
!1060 = !DILocalVariable(name: "n", arg: 3, scope: !1053, file: !2, line: 134, type: !220)
!1061 = !DILocalVariable(name: "line", scope: !1053, file: !2, line: 134, type: !246)
!1062 = !DILocalVariable(name: "endptr", scope: !1053, file: !2, line: 134, type: !246)
!1063 = !DILocalVariable(name: "i", scope: !1053, file: !2, line: 134, type: !220)
!1064 = !DILocalVariable(name: "v", scope: !1053, file: !2, line: 134, type: !251)
!1065 = distinct !DIAssignID()
!1066 = !DILocation(line: 0, scope: !1053)
!1067 = !DILocation(line: 134, column: 1, scope: !1053)
!1068 = !DILocation(line: 134, column: 1, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !2, line: 134, column: 1)
