read_verilog -sv /home/kelvin/FABulous_fork/myProject/PnR/gemm_calyx_nested.sv
hierarchy -top gemm
flatten -noscopeinfo
proc -noopt;
wreduce;
clean -purge
select gemm
#freduce;
#connect -set go 1
opt -nosdff -nodffe -fine -purge;
fsm -nomap -encoding one-hot;
#techmap -dont_map $mux -dont_map $lt -dont_map $eq -dont_map $add -dont_map $mul
#extract_reduce
opt -fine;;;;
stat
show -width