read_verilog -lib /home/kelvin/FABulous_fork/myProject/PnR/lib.v

read_verilog -lib /home/kelvin/FABulous_fork/myProject/.FABulous/prims.v
hierarchy -top test
flatten
proc
opt;;;
techmap -map /home/kelvin/FABulous_fork/myProject/PnR/map/PE_map.v -max_iter 1
techmap -map /home/kelvin/FABulous_fork/myProject/PnR/map/IO_map.v -max_iter 1
techmap -map /home/kelvin/FABulous_fork/myProject/PnR/map/const_map.v -max_iter 1
techmap -map /home/kelvin/FABulous_fork/myProject/PnR/map/reg_map.v -max_iter 1
stat
