read_verilog -sv /home/kelvin/FABulous_fork/myProject/user_design/test.sv
read_verilog -lib /home/kelvin/FABulous_fork/myProject/.FABulous/libs.v
read_rtlil -lib /home/kelvin/FABulous_fork/myProject/.FABulous/cells.li
read_verilog -lib /home/kelvin/FABulous_fork/myProject/.FABulous/IO_buf.v
prep -auto-top -flatten
opt -full
clean -purge

techmap -map /home/kelvin/FABulous_fork/myProject/.FABulous/wrap_map.v
read_rtlil -lib /home/kelvin/FABulous_fork/myProject/Tile/PE/metadata/cell_ALU_ALU_func_0.il
connwrappers -unsigned $__add_wrapper Y Y_WIDTH ;;
design -push 
read_rtlil /home/kelvin/FABulous_fork/myProject/Tile/PE/metadata/cell_ALU_ALU_func_0.il
techmap -map /home/kelvin/FABulous_fork/myProject/.FABulous/wrap_map.v
design -save __add_xmap
design -pop
extract -constports -ignore_parameters -map %__add_xmap -swap $__add_wrapper A,B;;
techmap -map /home/kelvin/FABulous_fork/myProject/.FABulous/unwrap_map.v
techmap -map /home/kelvin/FABulous_fork/myProject/.FABulous/techmaps.v

read_rtlil -lib /home/kelvin/FABulous_fork/myProject/Tile/PE/metadata/cell_const_unit.il
hilomap -wrap const_unit const_out ConfigBits


extract -map /home/kelvin/FABulous_fork/myProject/Tile/PE/metadata/cell_reg_unit_en_1_rst_z.il
techmap -map /home/kelvin/FABulous_fork/myProject/.FABulous/techmaps.v
iopadmap -widthparam WIDTH -outpad IO from_fabric:out -inpad IO to_fabric:in
iopadmap -bits -outpad OUTBUF I:PAD -inpad INBUF O:PAD

clean -purge

show -width

write_json /home/kelvin/FABulous_fork/myProject/user_design/synth_test.json
