read_verilog ./lib.v
read_verilog ./test.v
read_verilog -lib ./ALU.v
read_verilog -lib ./IO.v
hierarchy -top test
flatten
proc
opt;;;
techmap -map ./PE_map.v -max_iter 1
techmap -map ./IO_map.v -max_iter 1
stat
write_json ./test.json
write_verilog ./test_synth.v