set project_root $env(FAB_PROJECT_DIR)

yosys hierarchy -auto-top

yosys read_verilog -lib $project_root/.FABulous/libs.v
yosys read_rtlil -lib $project_root/.FABulous/cells.il
yosys read_verilog -lib $project_root/.FABulous/IO_buf.v
yosys proc
yosys flatten -noscopeinfo
yosys opt_expr
yosys opt_clean
yosys check
yosys opt -nodffe -nosdff
{# yosys fsm -nomap -encoding binary -expand #}
yosys fsm -encoding binary -expand
yosys opt
yosys techmap -map $project_root/.FABulous/logic_to_std.v
{# yosys wreduce #}
yosys peepopt
yosys opt_clean
yosys share
yosys opt_expr
yosys opt_clean
yosys techmap -map $project_root/.FABulous/reduce_or_to_or.v
yosys techmap -map $project_root/.FABulous/eq_to_and.v
yosys techmap -map $project_root/.FABulous/ne_to_xor.v

# memory opt
yosys opt_mem_priority
yosys opt_mem_feedback
yosys memory_bmux2rom
yosys memory_dff
yosys opt_clean
yosys memory_share
yosys opt_mem_widen
yosys opt_clean
yosys memory_collect

yosys opt -full

proc extract {cell wrapperPath} {
    # wrapping for mapping
    yosys design -push
    yosys read_json $cell
    yosys techmap -map $wrapperPath
    yosys design -save xmap
    yosys design -pop

    # extracting cell
    yosys extract -constports -ignore_parameters -map %xmap
    yosys design -delete xmap
}

yosys memory_libmap -lib $project_root/.FABulous/memory_map.txt

{% for wrapperPath, unWrapperPath, wrapperNames, cells in wrappers %}
# wrapping base design
yosys techmap -map {{ wrapperPath }}
{% for wrapperName, outWidthPair in wrapperNames -%}
yosys connwrappers {% for outPort, outParam in outWidthPair %}-unsigned {{ wrapperName }} {{ outPort }} {{ outParam }} {% endfor %}
{% endfor %}
# extract cells
{%- for cell in cells %}
extract "{{ cell }}" \
        "{{ wrapperPath }}"
{%- endfor %}
# unwrapping
yosys techmap -map {{ unWrapperPath }}
yosys opt
yosys clean -purge
{% endfor %}

# FSM mapping
{# yosys techmap -map /home/kelvin/FABulous_fork/myProject/PnR/fsm_map.v
yosys memory_libmap -lib $project_root/.FABulous/memory_map.txt #}

# cell techmapping
yosys techmap -map $project_root/.FABulous/techmaps.v

# const unit mapping
yosys constmap -cell \$__const O VALUE
yosys techmap -map $project_root/.FABulous/const_map.v

# io mapping
yosys iopadmap -widthparam WIDTH -outpad \$__external_out I:O -inpad \$__external_in O:I
yosys techmap -map $project_root/.FABulous/IO_techmap.v
yosys iopadmap -bits -outpad OUTBUF I:PAD -inpad INBUF O:PAD

# final optimization
yosys opt -full
yosys clean -purge
yosys fsm_info
yosys show -enum -long -width -format dot -prefix $project_root/.FABulous/design
yosys write_json $project_root/user_design/synth_test.json
yosys stat
